{"input_text": "Each year, the United States celebrates a holiday known as Thanksgiving on the fourth Thursday of November. It is a  federal holiday  and frequently involves a family gathering with a large feast, traditionally featuring a  turkey . Civic recognitions of the holiday typically include parades and  football  games. The holiday is meant to honor the First Thanksgiving, which was a harvest feast held in Plymouth in 1621, as first recorded in the book New England's Memorial by  Nathaniel Morton , secretary of Plymouth Colony and nephew of Governor William Bradford.\nThanksgiving, or Thanksgiving Day, is a  public  holiday celebrated on the fourth Thursday of November in the  United States . It originated as a   harvest festival . Thanksgiving has been celebrated nationally on and off since 1789, after a proclamation by  George Washington . It has been celebrated as a  federal holiday  every year since 1863, when, during the  American Civil War , President  Abraham Lincoln  proclaimed a national day of \"Thanksgiving and Praise to our beneficent Father who dwelleth in the Heavens,\" to be celebrated on the last Thursday in November.  Together with  Christmas  and the  New Year , Thanksgiving is a part of the broader  holiday season .\nTurkeys are traditionally eaten as the main course of  Thanksgiving  in the  United States  and  Canada , and at  Christmas   feasts  in much of the rest of the world (often as  stuffed turkey ). It was eaten as such as early as the 16th century in  England . Before the 20th century, pork ribs were the most common food for the North American holidays, as the animals were usually slaughtered in November. Turkeys were once so abundant in the wild that they were eaten throughout the year, the food considered commonplace, whereas pork ribs were rarely available outside of the Thanksgiving-New Year season. While the tradition of turkey at Christmas spread throughout England in the 17th century, among the working classes it became common to serve  goose , which remained the predominant roast until the  Victorian era .\nSeveral days of Thanksgiving were held in early New England history that have been identified as the \"First Thanksgiving\", including Pilgrim holidays in  Plymouth  in 1621 and 1623, and a Puritan holiday in  Boston  in 1631. According to historian Jeremy Bangs, director of the  Leiden American Pilgrim Museum , the Pilgrims may have been influenced by watching the annual services of Thanksgiving for the relief of the  siege of Leiden  in 1574, while they were staying in Leiden. Now called  Oktober Feesten , Leiden's autumn thanksgiving celebration in 1617 was the occasion for sectarian disturbance that appears to have accelerated the pilgrims' plans to emigrate to America. Later in Massachusetts, religious thanksgiving services were declared by civil leaders such as  Governor Bradford , who planned the colony's thanksgiving celebration and fast in 1623.The practice of holding an annual harvest festival did not become a regular affair in New England until the late 1660s.\nAt some holiday meals, such as  Christmas  in  Protestant  countries and  Thanksgiving  in the United States, it is customary for the host to prepare much more food than can be eaten, specifically in order to send leftovers home with the guests. Cold  turkey  is archetypal in the United States as a Thanksgiving leftover, with turkey meat often reappearing in  sandwich es,  soup s, and  casserole s for several days after the feast.\nMashed potato es with  gravy ,  sweet potato es,  cranberry sauce ,  sweet corn , various  fall   vegetable s,  squash , and  pumpkin pie  are commonly associated with Thanksgiving dinner.  Green bean casserole  was introduced in 1955 and remains a favorite. All of these are actually native to the Americas or were introduced as a new food source to the Europeans when they arrived. Turkey may be an exception. In his book Mayflower,  Nathaniel Philbrick  suggests that the Pilgrims might already have been familiar with turkey in England, even though the bird is native to the Americas. The Spaniards had brought domesticated turkeys back from Central America in the early 17th century, and the birds soon became popular fare all over Europe, including England, where turkey (as an alternative to the traditional goose) became a \"fixture at English Christmases\". The Pilgrims did not observe Christmas.\nThe use of the turkey in the USA for Thanksgiving precedes Lincoln's nationalization of the holiday in 1863.  Alexander Hamilton  proclaimed that no \"Citizen of the United States should refrain from turkey on Thanksgiving Day,\" and many of the  Founding Fathers  (particularly  Benjamin Franklin ) had high regard for the wild turkey as an American icon, but turkey was uncommon as Thanksgiving fare until after 1800. By 1857, turkey had become part of the traditional dinner in New England.\nThe species Meleagris gallopavo is used by humans for their meat. However, they were first domesticated by the indigenous people of Mexico from at least 800 BC onwards.  These domesticates were then either introduced into what is now the Southwest US or independently domesticated a second time by the indigenous people of that region by 200 BC, at first for their feathers, which were used in ceremonies and to make robes and blankets. Turkeys were first used for meat by Native Americans by about AD 1100. Compared to wild turkeys, domestic turkeys are selectively bred to grow larger in size for their meat. Humans normally eat turkeys on special occasions such as at  Thanksgiving  or  Christmas .\nTurkeys are eaten on Thanksgiving because the early colonists who  had the first Thanksgiving mentioned eating turkey. The colonists  celebrated the first Thanksgiving with â\u0080¦the Wampanoag Indians. Answers.comÂ® is making the world better one answer at a time.\nTurkeys are eaten on Thanksgiving because the early colonists who  had the first Thanksgiving mentioned eating turkey. The colonists  celebrated the first Thanksgiving with â\u0080¦the Wampanoag Indians. Answered by The WikiAnswersÂ® Community. Answers.comÂ® is making the world better one answer at a time.\nToday, the turkey is one of the most popular meats to eat on festive occasions and is farmed in large numbers across the western world. It is thought that over 250 million turkeys are farmed in the United States every year!he turkey has become famous across the western world as being a special meal on large family occasions including Christmas and Thanksgiving. Despite their large size, turkeys are surprisingly adept fliers and can be seen flying beneath the forest canopy looking for somewhere to perch.\nThanksgiving (United States) Thanksgiving, or Thanksgiving Day, is an important public holiday, celebrated on the fourth Thursday in November in the United States. It originated as a harvest festival. Thanksgiving has been celebrated nationally on and off since 1789, after a proclamation by George Washington.\nThe turkey! The turkey is â\u0080\u009ca much more respectable bird and a true native of the country.â\u0080\u009d. In truth, both species are natives of the United States. The bald eagle was chosen because it stands for strength, courage and freedom. Although the turkey was not chosen for our national symbol, it is the symbol of one of our most famous national holidays, Thanksgiving.\nThanksgiving. Thanksgiving Day is on the fourth Thursday of November. It is a time to give thanks for the harvest and of the preceding year. Today, Thanksgiving means spending time with family and friends over a large feast. Thanksgiving Day has been celebrated in the United States since 1863.elebration\\ Observance. Thanksgiving Day centers around family and friends where a meal is shared. The meal traditionally includes turkey, stuffing, mashed potatoes, sweet potatoes, cranberry sauce, rolls, gravy, and pumpkin pie. It's a time to reflect and give thanks for what they have.\nThe Turkey, a symbol of abundance. The Turkey has traditionally been associated with the spirit of giving and abundance, especially in North America. In the modern American culture, the Turkey is an important part of Thanksgiving Day. Originally, this day commemorates the pilgrimâ\u0080\u0099s first harvest during which four turkeys were eaten.\nDomestic or tame turkeys weigh twice what a wild turkey does and are raised on farms for profit. Most domestic turkeys are so heavy they are unable to fly. Wild turkeys (Meleagris gallopavo) live in woods in parts of North America and are the largest game birds found in this part of the world.They spend their days foraging for food like acorns, seeds, small insects and wild berries.n fact, Benjamin Franklin wanted to make the wild turkey, not the Bald Eagle, the national bird of the United States! The turkey's popularity comes from the American people's love of eating the bird for special occasions like Thanksgiving and Christmas.\nnoun. Eating turkey is part of the Thanksgiving tradition. Eating turkey is part of the Thanksgiving tradition. The definition of a tradition is a custom or belief that is passed down through the generations or that is done time after time or year after year.An example of a tradition is eating turkey on Thanksgiving or putting up a tree on Christmas.ating turkey is part of the Thanksgiving tradition. Eating turkey is part of the Thanksgiving tradition. The definition of a tradition is a custom or belief that is passed down through the generations or that is done time after time or year after year.\nTurkeys have long been important to humans in North America. Native Americans hunted them for food, and some natives even domesticated the big birds. Later, the wild turkey became a steady food source for settlers. It earned a symbolic role as the main course of the Thanksgiving meal, which epitomized the successful harvest.\nWhat Do People Do? Thanksgiving Day is traditionally a day for families and friends to get together for a special meal. The meal often includes a turkey, stuffing, potatoes, cranberry sauce, gravy, pumpkin pie, and vegetables. Thanksgiving Day is a time for many people to give thanks for what they have.", "key": "75_8", "timestamp": "2020-06-23 21:18:59.309583", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}