{"input_text": "The Corcoran Gallery of Art: Corcoran ArtReach  – As one of Washington, DC’s oldest art museums and the city’s only college of art and design, the Corcoran resides as the visual arts partner at THEARC through the Corcoran ArtReach program.  Corcoran ArtReach is a year-round museum outreach program designed to empower DC youth and families to explore and trust their own creativity within the context of art making and art history.  ArtReach provides arts instruction such as family workshops, after-school and summer art classes based on the Corcoran’s renowned collection.  ArtReach makes a special effort to foster visual literacy, critical thinking skills and creative expression among its participants, while encouraging them to develop meaningful connections between art and their lives.  In addition to ArtReach, the Corcoran oversees the Community Gallery at THEARC, which serves as an exhibition venue for program participants, local artists and community organizations and schools. Sixty-five children currently attend art classes at no charge through ArtReach.\nThe museum is open during game days, opening at the same time as the park and closing after the 7th inning with the concession stands. Admission is free, and the museum is open to all ticketholders. In 2012 the museum is open until the 9th inning, but still open only on game days. As of the last week of the 2012 season the museum was back to closing by the 7th inning (beginning of, not after the 7th inning) and the open only on game days policy is still in effect.\nChinatown in  Washington, D.C.  is a small, historic neighborhood east of downtown consisting of about 20 ethnic  Chinese  and other Asian restaurants and small businesses along  H  and I Streets between 5th and 8th Streets,  Northwest . It is known for its annual  Chinese New Year  festival and parade and the Friendship Arch, a  Chinese gate  built over H Street at  7th Street . Other nearby prominent landmarks include the  Verizon Center , a sports and entertainment arena, and the  Old Patent Office Building , which houses two of the  Smithsonian  museums (the  National Portrait Gallery  and the  Smithsonian American Art Museum ). The neighborhood is served by the  Gallery Place-Chinatown  station of the  Washington Metro .\nThe  National Mall  is a central green space in  Washington, DC  that is defined by the structures of the  US Capitol  on one end and the  Jefferson Memorial  on the other. Between these two points, visitors will find numerous memorials and monuments, as well as many museums belonging to the world-renowned  Smithsonian Institution  including the Quadrangle Museums Project, designed in 1987. It opens south from the Smithsonian Castle building and contains two small buildings which are staging areas for two underground museums, the Sackler Gallery of Asian Art, and the National Museum of African Art, and another smaller kiosk–like building which provides the entrance for the S. Dillon Ripley Center.\nMandarin Oriental Washington, D.C. is a luxury  Postmodernist-style   hotel  located at 1330 Maryland Ave SW,  Washington, D.C. , in the United States. Completed in 2004, the hotel is near the  National Mall  and  Smithsonian Institution museums , and overlooks the  Tidal Basin . The hotel contains two restaurants, one of which ( CityZen ) closed permanently on December 6, 2014. Since its opening, the Mandarin Oriental Washington, D.C., has been AAA-rated four diamonds and  Forbes Travel Guide  rated four stars.\nCultural Tourism DC is an independent non-profit coalition of more than 230 culture, heritage, and community-based organizations in  Washington, DC . Cultural Tourism DC and its members develop and present programs in Washington for area residents and visitors. Member organizations represent cultural and community organizations throughout Washington, DC; they include large institutions such as the  John F. Kennedy Center for the Performing Arts  and  U.S. National Arboretum  to smaller ones such as the  Frederick Douglass House  and the  Hillwood Estate, Museum & Gardens .\nThen from there, it's an easy walk to the Washington Monument, which is easy to use as a landmark. The Washingon Monument is halfway between the Lincoln Memorial and the US Capitol. The Smithsonian museums are between the Wash Monument and the US Capital. Frankly, the easiest thing to do is hop on the Metro (subway) at DCA and take it into DC and get off at the Smithsonian station. That would bring you out in the heart of everything and you would save yourself about 2 miles of hoofing it.\nWashington D.C. is a city rich in history. From free museums to historical monuments, thereâ\u0080\u0099s no shortage in free things to do. Washington D.C. serves up a wide variety of special events that run throughout the year.From Abraham Lincolnâ\u0080\u0099s Birthday to the White House Easter Egg Roll, Washington D.C. has a lot to offer any time of the year.But when is the best time to visit Washington D.C.? The answer depends on your preferences.rom free museums to historical monuments, thereâ\u0080\u0099s no shortage in free things to do. Washington D.C. serves up a wide variety of special events that run throughout the year.\nWhen in DC, be ready to walk. 7-10 days is plenty of time. I agree that you could spend ages in DC and still not see it all. There is simply SO much to do there and a lot of it is truly a bargain or free. Smithsonian Museums are great. I also recommend a visit to Arlington National Cemetery and the Iwo Jima Memorial.It is just a short metro ride.ith 7-10 days, you can pretty much see it all in D.C. You could devote 1 day to seeing the memorials and either walk to them or take one of the hop on/hop off buses. (This would also be a good day to go to Arlington Cemetery.\nAttractions & Things to Do. Here's everything you need to know about attractions and things to do in Washington, DC. Find information on the Smithsonian, the National Mall, museums, monuments, government buildings, sightseeing tours, national landmarks, special events, and much more.ttractions & Things to Do. Here's everything you need to know about attractions and things to do in Washington, DC. Find information on the Smithsonian, the National Mall, museums, monuments, government buildings, sightseeing tours, national landmarks, special events, and much more.\nMuseums After Hours: D.C.â\u0080\u0099s Best Kept Secret. If you like visiting the capitalâ\u0080\u0099s museums by day, youâ\u0080\u0099ll love what they offer after five. Washington, D.C. is home to over 50 museums, making it the perfect destination for visitors looking to soak up history, science and culture. The Smithsonian museums alone draw over 30 million visitors each year.\nJune 19, 2014. Washington, D.C. is home to over 50 museums, making it the perfect destination for visitors looking to soak up history, science and culture. The Smithsonian museums alone draw over 30 million visitors each year. But many out-of-towners don't know that some of the area's best museum offerings happen after regular hours.\nWhen in DC, be ready to walk. 7-10 days is plenty of time. I agree that you could spend ages in DC and still not see it all. There is simply SO much to do there and a lot of it is truly a bargain or free. Smithsonian Museums are great. I also recommend a visit to Arlington National Cemetery and the Iwo Jima Memorial. It is just a short metro ride.\nA great list of things to do when you visit Washington, D.C. 1  Visit the Capitol Building. 2  Look at the Washington Monument. 3  Tour The White House. 4  Visit the Hirshhorn Museum and Sculpture Garden. 5  Explore flight at the Smithsonian National Air and Space Museum.\nWashington DC & Georgetown Attractions: History, Museums, Memorials & More. No place in America has more important national treasures and historic sites than this thrilling city, a destination beloved by the young and old alike. You can visit iconic attractions such as the White House, U.S. Capitol Building, Lincoln Memorial and Washington Monument. Other fun things to do in Washington DC near our hotel include visits to the Smithsonian museums, festivals on the National Mall and upscale shopping and dining in Georgetown. U.S. Capitol Building.\nFind things to do in Washington, DC. Washington, DC has fun activities for every kind of visitor, from cultural events to a vibrant dining scene to museums packed with history.\nDelight in dozens of fun Washington, DC and Old Town Alexandria things to do that are within close proximity of our Springfield, Virginia hotel.dditional places of interest include the Alexandria Black History Museum, Carlyle House, and Art on the Avenue. http://visitalexandriava.com. Park of the Smithsonian Institution, the National Zoological Park is located in Washington, DC's Rock Creek Park.\nWhere to eat in Washington, DC. The best pizza in Washington, DC. The best brunch in DC. Whether your weekend plans involve visiting the best museums in DC, exploring the town while on one of many cool Washington, DC tours or working through your best Washington DC attractions bucket list, youâ\u0080\u0099ll need to make some time for a proper DC brunch.\nMuseums After Hours: D.C.â\u0080\u0099s Best Kept Secret. If you like visiting the capitalâ\u0080\u0099s museums by day, youâ\u0080\u0099ll love what they offer after five. Washington, D.C. is home to over 50 museums, making it the perfect destination for visitors looking to soak up history, science and culture. The Smithsonian museums alone draw over 30 million visitors each year. But many out-of-towners don't know that some of the area's best museum offerings happen after regular hours. Over the last few years, more and more D.C. museums have begun opening their doors after five for thematic events, musical performances, special curator-led tours and, of course, cocktails and mingling.", "key": "54_5", "timestamp": "2020-06-23 21:18:59.125111", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}