{"input_text": "Contrary to popular belief, only a few sharks are dangerous to humans. Of more than 568  shark species , only four have been involved in a significant number of fatal unprovoked attacks on humans: the  great white shark ,  tiger shark ,  bull shark , and the  oceanic whitetip shark . These sharks, being large, powerful predators, may sometimes attack and kill humans; however, they have all been filmed in open water by unprotected divers.\nThe tiger shark is a solitary, mostly nocturnal hunter, and is notable for having the widest food spectrum of all sharks, consuming a variety of prey ranging from  crustacean s,  fish ,  seals ,  bird s,  squid ,  turtle s, and  sea snake s to  dolphin s and even other smaller sharks. The tiger shark has been known to eat inedible, man-made objects that linger in its stomach, and it has a reputation as a \"garbage eater\". While the tiger shark sits atop the food chain as an apex predator,  killer whales  have been known on occasion to prey on them.   The tiger shark is considered a  near threatened species  due to  finning  and fishing by humans.\nThe smalltooth sand tiger was originally described as Squalus ferox by Italian-French  naturalist   Antoine Risso  in 1810, based on a specimen from  Nice, France . In 1950,  Gilbert Percy Whitley  described O. herbsti from Australian specimens, separating them from O. ferox on the basis of dentition and the absence of spots.  Leonard Compagno   synonymized  the two species in 1984, as subsequently discovered Pacific specimens had blurred Whitley's distinguishing characters. The  specific epithet  ferox is  Latin  for \"fierce\". Other  common name s for this shark include blue nurse shark, fierce shark, Herbst's nurse shark, and sand tiger shark.\nBecause the sand tiger shark is worldwide in distribution, it has many common names. The term \"sand tiger shark\" actually refers to four different sand tiger shark species in the family Odontaspididae. Furthermore, the name creates confusion with the  tiger shark  Galeocerdo cuvier, which is not related to the sand tiger. The grey nurse shark, the name used in Australia and the United Kingdom, is the second-most-used name for the shark, and in India it is known as blue-nurse sand tiger. However, there are unrelated nurse sharks in the family Ginglymostomatidae. The most unambiguous and descriptive English name is probably the South African one, spotted ragged-tooth shark.\nWhile fins from many shark species are used in the trade, certain shark species have been identified over the centuries as supplying the tastiest and most succulent fins. The shark-like rays (the sawfishes and  shovelnose ray s) supply the highest quality fin. As observed by one of the leading treatises on shark trade, \"The ... fins ... from the white-spotted guitarfish [ Rhynchobatus  spp.] are considered to be most valuable. The preferred shark species for fins are  tiger ,  mako , sawfish,  sandbar ,  bull ,  hammerhead ,  blacktip ,  porbeagle ,  thresher  and  blue shark .\" The fins from the critically endangered sawfishes \"are highly favored in Asian markets and are some of the most valuable shark fins.\" Sawfishes are now protected under the highest protection level of the Convention on International Trade in Endangered Species ( CITES ), Appendix I, but given the great volume of the shark fin trade, and that detached shark fins are difficult to identify, it is unlikely that CITES protection will prevent sawfish fins from entering the trade.\nThe tiger shark had been caught 3 kilometres from the beach suburb of  Coogee  in mid-April and transferred to the Coogee Aquarium Baths, where it was put on public display. Within a week the fish became ill and vomited in front of a small crowd, leaving the left forearm of a man bearing a distinctive  tattoo  floating in the pool. Before it was captured, the tiger shark had devoured a smaller shark. It was this smaller shark that had originally swallowed the human arm.\nThe tiger shark is an  apex predator  and has a reputation for eating anything. These predators swim close inland to eat at night, and during the day swim out into deeper waters. Young tiger sharks are found to prey largely on  small fish , as well as various small  jellyfish ,  cephalopod s, and other  mollusk s. Around the time they attain , or near sexual maturity, their prey selection expands considerably, and much larger animals become regular prey. Numerous  fish ,  crustacean s,  sea bird s,  sea snake s,  marine mammal s (e.g.  bottlenose dolphin s (Tursiops),  common dolphin s (Delphinus),  spotted dolphin s (Stenella),  dugong s (Dugong dugon),  seal s and  sea lion s, and  sea turtle s (including the three largest species: the  leatherback  (Dermochelys coriacea), the  loggerhead  (Caretta caretta) and the  green sea turtle s (Chelonia mydas),) are regularly eaten by adult tiger sharks. They also eat other sharks (including adult  sandbar shark s (Carcharhinus plumbeus)), as well as  ray s, and sometimes even eat other tiger sharks.\nThe bull shark is responsible for biting swimmers around the  Sydney Harbour  inlets. Most of these bites were previously attributed to Great White sharks. In India, bull sharks swim up the  Ganges River  and have bitten bathers. Many of these bite incidents were attributed to the  Ganges shark , Glyphis gangeticus, a critically endangered river shark species, although the  Sand Tiger shark  was also blamed during the 1960s and 1970s.\nThe sand tiger shark (Carcharias taurus), grey nurse shark, spotted ragged-tooth shark, or blue-nurse sand tiger is a species of shark that inhabits subtropical and temperate waters worldwide. It inhabits the  continental shelf , from sandy shorelines (hence the name sand tiger shark) and submerged reefs to a depth of around . They dwell in the waters of Japan, Australia, South Africa, the  Mediterranean  and the east coasts of North and South America. Despite its name, it is not related to the  tiger shark  Galeocerdo cuvier; however, it is a cousin of the  great white shark  Carcharodon carcharias. Despite its fearsome appearance and strong swimming ability, it is a relatively placid and slow-moving shark with no confirmed human fatalities. This species has a sharp, pointy head, and a bulky body. The sand tiger's length can reach . They are grey with reddish-brown spots on their backs. Shivers (groups) have been observed to hunt large schools of fish. Their diet consists of bony fish,  crustaceans ,  squid ,  skates  and other  sharks . Unlike other sharks, the sand tiger can gulp air from the surface, allowing it to be suspended in the  water column  with minimal effort. During pregnancy, the most developed  embryo  will feed on its siblings, a reproductive strategy known as  intrauterine cannibalism  i.e. \"embryophagy\" or, more colorfully,  adelphophagy  — literally \"eating one's brother\". The sand tiger is categorized as vulnerable on the  International Union for Conservation of Nature Red List . It is the most widely kept large shark in public  aquariums  owing to its tolerance for captivity.\nAmong the largest  extant  sharks, the tiger shark ranks in average size only behind the  whale shark  (Rhincodon typus), the  basking shark  (Cetorhinus maximus), and the  great white shark  (Carcharodon carcharias). Some other species such as  megamouth shark s (Megachasma pelagios),  Pacific sleeper shark s (Somniosus pacificus),  Greenland shark s (Somniosus microcephalus), and  bluntnose sixgill shark s (Hexanchus griseus) broadly overlap in size with the tiger shark, but as these species are comparatively poorly studied, it is unclear whether their typical mature size matches that of the tiger shark. The  great hammerhead  (Sphyrna mokarran), a member of the same taxonomic order as the tiger shark, has a similar or even greater average body length, but is lighter and less bulky, with a maximum known weight of .\nThe term shark attack is used to describe an attack on a human by a  shark . Every year over 70 attacks are reported worldwide. Despite their relative rarity, many people fear shark attacks after occasional serial attacks, such as the  Jersey Shore shark attacks of 1916 , and horror fiction and films such as the  Jaws  series. Out of more than 480  shark species , only three are responsible for a double-digit number of fatal, unprovoked attacks on humans: the  great white ,  tiger , and  bull ; however, the  oceanic whitetip  has probably killed many more  castaway s, not recorded in the statistics.\nA reflective layer behind the tiger shark's  retina , called the  tapetum lucidum , allows light-sensing cells a second chance to capture  photon s of visible light, enhancing vision in low-light conditions. A tiger shark generally has long fins to provide lift as the shark maneuvers through water, while the long upper tail provides bursts of speed. The tiger shark normally swims using small body movements. Its high back and  dorsal fin  act as a pivot, allowing it to spin quickly on its axis, though the shark's dorsal fins are distinctively close to its tail.\nThe Future Shark is the future evolution of a modern-day shark. It looks similar to some deep-sea sharks, but has a special adaptation: a very long tongue armed with spikes that can be fired from the jaw like a harpoon. Modern day sharks such as the  tiger shark  have been found with litter in their stomachs, including plastic bags, tins and car registration plates: the basketball and the shoe found in the Future Shark's stomach could be a reference to this.\nTiger Shark Tagging, November 2014 in Tiger Beach, Bahamas:The International SeaKeepers Society teamed up with the UM Rosenstiel School of Marine and Atmospheric Science, Marine Conservation Program, Florida Biodiversity Institute, and National Geographic to conduct another tiger shark tagging expedition. The shark tagging took place at Tiger Beach, Bahamas onboard DISCOVERY Yachts Fugitive, out of West Palm Beach, FL, and Qing, out of Fort Lauderdale, FL. Fugitive is a 125-foot Northcoast and Qing is a 150-foot Cheoy Lee.\nSome sharks can be induced into tonic immobility by inverting them and restraining them by hand, e.g.  dogfish sharks ,  lemon shark s and  reef sharks .  For  tiger shark s (measuring 3–4 metres in length), tonic immobility can be induced by humans placing their hands lightly on the sides of the animal's snout in the area surrounding the eyes. During tonic immobility in sharks, the dorsal fins straighten, and both breathing and muscle contractions become more steady and relaxed. This state persists for an average of 15 minutes before recovery and the resumption of active behaviour.  Scientists have exploited this response to study shark behaviour; chemical  shark repellent  has been studied to test its effectiveness and to more accurately estimate dose sizes, concentrations and time to recovery. Tonic immobility can also be used as a form of mild anesthesia during experimental manipulations of sharks.\nThe tiger shark is a member of the order  Carcharhiniformes , the most species-rich order of sharks, with more than 270 species also including the small  catshark s and  hammerhead shark s. Members of this order are characterized by the presence of a  nictitating membrane  over the eyes, two dorsal fins, an  anal fin , and five  gill  slits. It is the largest member of the Carcharhinidae  family , commonly referred to as  requiem shark s. This family consists of mostly slender but powerful mid- to large-sized sharks and includes some other well-known sharks, such as the  blue shark  (Prionace glauca),  lemon shark  (Negaprion brevirostris), and  bull shark  (Carcharhinus leucas).\nThe tiger shark (Galeocerdo cuvier) is a species of  requiem shark  and the only extant member of the  genus  Galeocerdo. Commonly known as the \"Sea Tiger\", the tiger shark is a relatively large macropredator, capable of attaining a length over . It is found in many  tropical  and  temperate  waters, and it is especially common around central  Pacific  islands. Its name derives from the dark stripes down its body which resemble a  tiger 's pattern, which fade as the shark matures.\nMiguel encourages Steven to live a carefree, womanizing life like he does. Steven agrees. They even start a shark hunting business, swimming out to sea and shooting whatever swims past them, from local  blue shark s to  lemon shark s. Miguel tells Steven that if a tiger shark ever appears, they must immediately get out of the water because tiger sharks or tintoreras are too dangerous to even attempt to hunt.\nWell-known species such as the  great white shark ,  tiger shark ,  blue shark ,  mako shark , and the  hammerhead shark  are  apex predator s—organisms at the top of their underwater  food chain . Many shark populations are threatened by human activities.\nGenerally sharks have only one layer of tesserae, but the jaws of large specimens, such as the bull shark, tiger shark, and the great white shark, have two to three layers or more, depending on body size. The jaws of a large great white shark may have up to five layers. In the  rostrum  (snout), the cartilage can be spongy and flexible to absorb the power of impacts.\nOne contender in maximum size among the predatory sharks is the  tiger shark  (Galeocerdo cuvier). While tiger sharks which are typically both a few feet smaller and have a leaner, less heavy body structure than white sharks, have been confirmed to reach at least  in the length, an unverified specimen was reported to have measured  in length and weighed , more than two times heavier than the largest confirmed specimen at . Some other macropredatory sharks such as the  Greenland shark  (Somniosus microcephalus) and the  Pacific sleeper shark  (S. pacificus) are also reported to rival these sharks in length (but probably weigh a bit less since they are more slender in build than a great white) in exceptional cases. The question of maximum weight is complicated by the unresolved question of whether or not to include the shark's stomach contents when weighing the shark. With a single bite a great white can take in up to  of flesh, and can also consume several hundred kilograms of food.\nThe skin of a tiger shark can typically range from blue to light green with a white or light-yellow underbelly. The advantage of this is that when it is hunting for its prey, when prey looks at the shark from above, the shark will be camouflaged since the water below is darker. And when prey is below the shark and looks up, of course because of the sun, it is lighter so that the light underbelly will also camouflage the shark. This is known as  countershading . Dark spots and stripes are most visible in young sharks and fade as the shark matures. Its head is somewhat wedge-shaped, which makes it easy to turn quickly to one side. They have small pits on the snout which hold electroreceptors called the  ampullae of Lorenzini , which enable them to detect electric fields, including the weak electrical impulses generated by prey, which helps them to hunt. Tiger sharks also have a sensory organ called a  lateral line  which extends on their flanks down most of the length of their sides. The primary role of this structure is to detect minute vibrations in the water. These adaptations allow the tiger shark to hunt in darkness and detect hidden prey.\nDuring the three weeks following the policy's implementation, 66 sharks were caught. Almost 75 per cent of the sharks caught on drum lines were under the target three metre size. Of the 49 undersized sharks, nine were found dead on the hooks and 40 were released alive. Fisheries officers patrolling beaches in Perth and a contractor in the South-West killed 17 sharks longer than three metres. Figures released on 18 February by Fisheries Minister Ken Baston showed 95 per cent of sharks caught were tiger sharks – a total of 63 animals. According to the State Government's SharkSmart website, tiger sharks \"may only have been responsible for one shark bite in WA since 1980\". Two Mako sharks have also been found dead on the drum lines.\nThe Protea banks is a  reef  about 7  km  off the shore of  South Africa  near  Margate . The main attraction of this area is for  scuba diving , owing to the large numbers of  bull sharks  and  tiger sharks  there.\nAlthough sharks rarely bite humans, the tiger shark is reported to be responsible for a large percentage of fatal shark bite incidents, and is sometimes regarded as one of the most dangerous shark species. They often visit shallow reefs, harbors, and canals, creating the potential for encounter with humans. The tiger shark also dwells in river mouths and other runoff-rich water. While the tiger shark is considered to be one of the sharks most dangerous to humans, its bite rate is low. It is second on the list of number of recorded bites on humans, with the  great white shark  being first. On average, three to four shark bites occur per year in Hawaii, but they are rarely fatal. This bite rate is very low considering thousands of people swim, surf, and dive in Hawaiian waters every day. Human interactions with tiger sharks in Hawaiian waters have been shown to increase between September and November, when tiger shark females are believed to migrate to the islands to give birth.\nThe  blacktip reef shark  is typically about  long. It is usually found over reef ledges and sandy flats, though it can also enter  brackish  and  freshwater  environments. This species likes shallow water, while the  whitetip  and the  grey reef shark  are prefer deeper water. Younger sharks favour shallow sandy flats, and older sharks spend more time around reef ledges and near reef drop-offs. Blacktip reef sharks are strongly attached to their own area, where they may remain for up to several years. A tracking study off  Palmyra Atoll  in the central Pacific has found that the blacktip reef shark had a home range of about , among the smallest of any shark species. The size and location of the range does not change with time of day. The blacktip reef shark may be encountered alone or in small groups. Large social aggregations have also been observed. They are active  predator s of small  bony fish es,  cephalopod s, and  crustacean s, and also feed on  sea snake s and  seabird s. Blacktip reef sharks are preyed on by  grouper s, grey reef sharks,  tiger shark s, and members of their own species. At Palmyra Atoll, adult blacktip reef sharks avoid patrolling tiger sharks by staying out of the central, deeper lagoon.\nIrrespective of the cause of their ultimate extinction, during the long time of their existence the pseudotooth birds furnished  prey  for large predators themselves. Few if any birds that coexisted with them were large enough to harm them while airborne; as evidenced by the Early Eocene  Limnofregata , the  frigatebird s coevolved with the Pelagornithidae and may well have harassed any of the small species for food on occasion, as they today harass albatrosses. From the Middle Miocene or Early Pliocene of the Lee Creek Mine, some remains of pseudotooth birds which probably fell victim to  shark s while feeding are known. The large members of the abundant Lee Creek Mine shark fauna that hunted near the water's surface included the  broadnose sevengill shark  (Notorynchus cepedianus),  Carcharias  sand tiger sharks, Isurus and Cosmopolitodus  mako shark s,  Carcharodon  white sharks, the  snaggletooth shark  Hemipristis serra,  tiger shark s (Galeocerdo),  Carcharhinus  whaler sharks, the  lemon shark  (Negaprion brevirostris) and  hammerhead shark s (Sphyrna), and perhaps (depending on the bird fossils' age) also  Pristis  sawfishes,  Odontaspis  sand tiger sharks, and  Lamna  and  Parotodus benedeni  mackerel sharks. It is notable that fossils of smaller diving birds – for example auks,  loon s and  cormorant s – as well as those of albatrosses are much more commonly found in those shark  pellet s than pseudotooth birds, supporting the assumption that the latter had quite low population densities and caught much of their food in mid-flight.\nOver 1000 species of marine life inhabit the reef with many considered as endangered. Animal species found include  manta ray s,  lionfish ,  sea turtles ,  clownfish , and sharks.  Tubbataha has become a popular site for seasoned  sport diver s because of its coral \"walls\" where the shallow coral reef abruptly ends giving way to great depths. These \"walls\" are also habitats for many colonies of fish.  Giant trevally  (jacks),  hammerhead sharks ,  barracuda s,  manta rays , palm-sized  Moorish idol s,  napoleon wrasse ,  parrotfish , and  moray eels  live in the sanctuary. There also have been reported sightings of  whale sharks  and  tiger shark s. Tubbataha is even home to  cetacean s and the hawksbill sea turtles ( Eretmochelys imbricata ) which are critically endangered species.\nShark s inhabit all the coastal waters and estuarine habitats of Australia's coast. There are 166 species, including 30 species of  requiem shark , 32 of  catshark , six of  wobbegong shark , and 40 of  dogfish shark . There are three species from the family  Heterodontidae : the  Port Jackson shark , the  zebra bullhead shark  and the  crested bullhead shark . In 2004, there were 12 unprovoked  shark attacks in Australia , of which two were fatal. Only 3 species of shark pose a significant threat to humans: the  bull shark , the  tiger shark  and the  great white shark . Some popular beaches in Queensland and  New South Wales  are protected by  shark net ting, a method that has reduced the population of both dangerous and harmless shark species through accidental entanglement. The overfishing of sharks has also significantly reduced shark numbers in Australian waters, and several species are now endangered. A  megamouth shark  was found on a  Perth  beach in 1988; very little is known about this species, but this discovery may indicate the presence of the species in Australian coastal waters.\nSand tiger shark. Not to be confused with sand shark, tiger shark, or nurse shark. The sand tiger shark (Carcharias taurus), grey nurse shark, spotted ragged-tooth shark, or blue-nurse sand tiger is a species of shark that inhabits subtropical and temperate waters worldwide.\nFacts about Great White Sharks, Tiger Sharks, Bull Sharks, Whale Sharks, Bull Shark, Hammerhead Shark, Mako Shark and more. Sharks are a large group of fish that have inhabited the oceans for over 400 million years, even before dinosaurs populated our planet.\nThe tiger shark will travel a long way for a bite to eat; one study found that the tiger shark swam about 30 miles to 40 miles (48 km to 64 km) a day looking for food [source: Tennesen ]. It also doesn't appear that tiger sharks have a pattern of particular feeding places.\ntiger sharks in action. Always on the lookout for a quick meal, tiger sharks are best known for their killer instincts and voracious appetites. All kinds of odds and ends have been found inside tiger shark stomachs.\nTURNING A TIGER SHARK INTO A ZOMBIE. A tiger shark is put into a zombie-like trance called â\u0080\u009ctonic immobilityâ\u0080\u009d by shark conservationist Eli Martinez in Zombie Sharks, part of the Shark Week 2014 lineup.\nTiger Shark Habits and Habitat. The tiger shark loves warm waters and is found in most tropical and temperate regions. Other than a ready supply of food, tiger sharks don't have a lot of other requirements for their abode. Tiger sharks are found both on the surface and in depths of up to 1,150 feet (350 meters) [source: Knickle ] and they're found in lots of different waters, including river estuaries and harbors. Most often, though, this shark is found in murky waters in coastal areas.\nThe tiger markings that are typical of younger tiger sharks may be a way to blend in with the waves near the coast, so that larger predators don't find them. Baby tiger sharks better watch out -- larger tiger sharks have been known to eat them! Read on to find out all the other zany things that tiger sharks eat.\nKingdom: Animalia Phylum: Chordata Class: Chondrichthyes (cartilaginous fishes) Order: Selachii (sharks) Family: There are a number of different families of sharks, each with several genera, each of which has several species. For example: Family Carcharidae (sand sharks); Isuridae (mackerel sharks); Cetorhinidae (basking sharks); Alopiidae (thresher sharks); and others. Since there are so many famlies, genera and species, here is the info for a couple of the best known ones: Family Isuridae, Genus Carcharodon, species carcharias (Great White Shark) Family Carcharinidae, Genus Galeocerdo, species cuvier (Tiger Shark) Family Sphyrnidae, Genus Sphyrna, species zygaena (Hammerhead Shark)\nit depends where you are in Hawaii there is some whale shark, bull  shark, tiger shark, and even sometimes on a rare occaican great  whit sharks sand sharks a lot and hammer â\u0080¦ heads     According to researchers there are 40 known species of  sharks in Hawaiian waters, but bull sharks are not one!here do black tip sharks live? Blacktip sharks are found in tropical and subtropical coastal, shelf, and island waters in the Atlantic, where they migrate seasonally between Brazil and Nova Scotia; the Gulf â\u0080¦ of Mexico and the Caribbean Sea, throughout the Mediterranean, and along the central West coast of Africa.\nTHE TIGER SHARK. The tiger shark is one of the largest shark species which has been known to reach lengths of around 18 feet(six metres) in the past. This, however, is a rare occurrence and the more common sizes are ten to 14ft, with the female tiger shark larger than the male.\nThe tiger shark, Galeocerdo cuvier is a species of requiem shark and the only member of the genus Galeocerdo. It is found in many tropical and temperate oceans, and is especially common around central Pacific islands.\nSome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.Like with other species, tiger sharks in captivity do not live as lengthy as in wildlife reaching only 17 to 20 years.n the wild, it is thought that their life expectancy is 30 years. The typical lifespan in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Sandbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 20 years of age.\nIn the wild, it is believed that their life expectancy is about 30 years. Sandbar sharks or Brown sharks are thought to live between 20 and 30 years. Investigation made by Joung (2004) found to be about 20 years of age.While, Sminkey (1996) mention that sandbar sharks can live to be more than 30 years old.s with other species, tiger sharks in captivity do not live as extensive as in wildlife reaching only 17 to 20 years. Some experts presume that the lifespan of the Great White Sharks is approximately 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years.\nThe body of a tiger shark can be around 3-5 meters long which is about 9.8-16.4 feet long. Some can get even bigger than that, for instance one tiger shark was found to be 55 meters long which is about 18 feet long.As for weight, a tiger shark will usually weigh around 385-635kg which is about 849-1400 pounds.he body of a tiger shark can be around 3-5 meters long which is about 9.8-16.4 feet long. Some can get even bigger than that, for instance one tiger shark was found to be 55 meters long which is about 18 feet long.\nThe tiger shark commonly attains a length of 3.25â\u0080\u00934.25 m (10 ft 8 inâ\u0080\u009313 ft 11 in) and weighs around 385â\u0080\u0093635 kg (849â\u0080\u00931,400 lb). Sometimes, an exceptionally large male tiger shark can grow up to 4.5 m (14 ft 9 in).Females are larger, and exceptionally big ones can reportedly measure over 5 m (16 ft).ommonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft). It is found in many tropical and temperate waters, and it is especially common around central Pacific islands.\nThe tiger shark (Galeocerdo cuvier) is a species of requiem shark and the only extant member of the genus Galeocerdo. Commonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft).It is found in many tropical and temperate waters, and it is especially common around central Pacific islands.ommonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft). It is found in many tropical and temperate waters, and it is especially common around central Pacific islands.\nThey have several sets of replaceable teeth. Well-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.hey have several sets of replaceable teeth. Well-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nSince then, sharks have diversified into over 500 species. They range in size from the small dwarf lanternshark (Etmopterus perryi), a deep sea species of only 17 centimetres (6.7 in) in length, to the whale shark (Rhincodon typus), the largest fish in the world, which reaches approximately 12 metres (39 ft) in length.hey have several sets of replaceable teeth. Well-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nSome common kinds of shark include the hammerhead shark, the great white shark, the tiger shark, and the mako shark.\nMany scientists agree that since bull sharks often dwell in shallow waters, they may be more dangerous to humans than any other species of shark, and that they, tiger sharks and great white sharks are the three shark species most likely to attack humans.onfidence votes 28. The Bull Shark is found in tropical and subtropical seas around the world, and prefers warm waters. It also lives very close inshore, and often enters fresh water for long periods.\nTiger Sharks are incredibly impressive and large sharks which can reach a length of more than six meters. Tiger Sharks have the broadest food spectrum of all sharks. Apart from sea turtles, seals, sea lions, other sharks, whales, and sea birds, they also eat invertebrates, garbage and carrion.\nFor Hammerhead sharks, their life expectancy ranges from 20 to 30 years. Brown sharks and sandbar sharks are thought to live between 25 to 30 years. A research conducted in 2004 by joung identified that the lifespan of brown sharks is about 25 years while sandbar sharks can live up to 30 years.he life expectancy of tiger sharks in the wild is thought to be 28 years in average while some reach up to 50 years. But Just like the other kind, tiger sharks in captivity do not have a longer life span as those in the wild.\nBest Answer: If you are asking which is more dangerous, both sharks and whales has their species that can be potentially dangerous. Even though Great white sharks is the most intimidating of all sharks, they're not the most aggressive sharks.Tiger sharks are way more aggressive than the Great white sharks. shark is more dangerous than a whale because whales eat krill. Sharks eat meat but that doesn't mean they would just swim up and eat you. A shark would only hurt a person if you were in its territory,you were surfing and looked like a seal from below, or if it was desperately hungry.\nSome of the most common predators are dusky shark, great white shark, tiger shark, and bull shark. Mostly the calves fall victim to these enemies. Another reason as to why these species are becoming endangered is that dolphins also suffer from parasites and diseases. Some of these species are really declining in numbers such as Amazon river dolphin, Yangtze river dolphin, and Ganges.\nThere are a wide variety of shark teeth, just as there are a wide variety of sharks. These teeth can be divided into two general categories. Many shark species, such as the goblin shark and sand tiger, have very long, thin teeth.This structure is well suited for catching small fish. The shark kills the fish immediately, by piercing it with a single bite. Then it swallows the fish whole.Sharks that go after larger prey need a different strategy and a different sort of tooth. They tear into their prey several times, biting off large pieces of flesh. Sharks in this group, which includes the infamous great white shark, have wide serrated teeth.any shark species, such as the goblin shark and sand tiger, have very long, thin teeth. This structure is well suited for catching small fish. The shark kills the fish immediately, by piercing it with a single bite. Then it swallows the fish whole.\nThe typical lifespan in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Sandbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 20 years of age.ome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.\nSome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.Like with other species, tiger sharks in captivity do not live as lengthy as in wildlife reaching only 17 to 20 years.ome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.\nThe life-span of tiger sharks in the wild is considered to be 27 years in average, even though some may live up to 50 years of age. As with other species, tiger sharks in captivity do not live as extensive as in wildlife reaching only 17 to 20 years.Some experts presume that the lifespan of the Great White Sharks is approximately 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years.ately, GPS systems have brought a new way to track migration and how long do sharks live, providing more accurate information about them. Shark lifespan vary by kind and it is very different for each of them. While many types live 20 to 30 years in the wild, there are some types that live much longer than others.\nIn the wild, it is believed that their life expectancy is about 30 years. Sandbar sharks or Brown sharks are thought to live between 20 and 30 years. Investigation made by Joung (2004) found to be about 20 years of age. While, Sminkey (1996) mention that sandbar sharks can live to be more than 30 years old.ately, GPS systems have brought a new way to track migration and how long do sharks live, providing more accurate information about them. Shark lifespan vary by kind and it is very different for each of them. While many types live 20 to 30 years in the wild, there are some types that live much longer than others.\nShark lifespan vary by kind. Although the majority of types live 20 to 30 years in the wild, there are some kinds that live much longer than others. For example, the spiny dogfish has one of the longest lifespan at more than 100 years, while the blue shark in the wild has an average lifespan of 15-16 years.ome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.\nSome experts believe that the lifespan of the Great white sharks is about 30 years but other studies show that they can live up to 40 years. The life expectancy of tiger sharks in the wild is thought to be 28 years in average while some reach up to 50 years.But Just like the other kind, tiger sharks in captivity do not have a longer life span as those in the wild. If they are lucky they can reach 17 to 21 years.heir lifespan vary by kind. Even though most of them live about 20 to 30 years in the wild, there are some types that live longer than others. For instance, the dogfish has one of the longest lifespan of more than 100 years while blue shark has an average lifespan of about 15-16 years in the wild.\nThe tiger shark will travel a long way for a bite to eat; one study found that the tiger shark swam about 30 miles to 40 miles (48 km to 64 km) a day looking for food [source: Tennesen ].It also doesn't appear that tiger sharks have a pattern of particular feeding places.he tiger shark will travel a long way for a bite to eat; one study found that the tiger shark swam about 30 miles to 40 miles (48 km to 64 km) a day looking for food [source: Tennesen ].\nOther than a ready supply of food, tiger sharks don't have a lot of other requirements for their abode. Tiger sharks are found both on the surface and in depths of up to 1,150 feet (350 meters) [source: Knickle ] and they're found in lots of different waters, including river estuaries and harbors.Most often, though, this shark is found in murky waters in coastal areas.he tiger shark will travel a long way for a bite to eat; one study found that the tiger shark swam about 30 miles to 40 miles (48 km to 64 km) a day looking for food [source: Tennesen ].\nDistribution: Off the Atlantic coast of the United States tiger sharks are found from Cape Cod, Massachusetts, to the Gulf of Mexico and Caribbean Sea. Off the Pacific coast tiger sharks are found from southern California southward.In the western central Pacific, tiger sharks are found in the Hawaiian, Solomon, and Marshall Islands.istribution: Off the Atlantic coast of the United States tiger sharks are found from Cape Cod, Massachusetts, to the Gulf of Mexico and Caribbean Sea. Off the Pacific coast tiger sharks are found from southern California southward.\nIt is a nomadic animal which is often found close to the coast, guided by warmer currents in deep waters. In the past, tiger sharks have been found across the western Pacific Ocean, from Japan to New Zealand, as well as the Caribbean Sea, the Gulf of Mexico and South America.It has also been spotted off the coast of Africa, China, India and Indonesia.he tiger shark is one of the largest shark species which has been known to reach lengths of around 18 feet(six metres) in the past. This, however, is a rare occurrence and the more common sizes are ten to 14ft, with the female tiger shark larger than the male.\nThe tiger shark (Galeocerdo cuvier) is a species of requiem shark and the only extant member of the genus Galeocerdo. Commonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft).It is found in many tropical and temperate waters, and it is especially common around central Pacific islands.ommonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft).\nThere are about 40 species of sharks found in the Hawaiian waters ranging from 8 inches to over 50 feet long. The most common sharks seen around Hawaii are Blacktip Sharks, Reef Blacktip Sharks, Reef Whitetip Sharks, Tiger Sharks, Sandbar Sharks, Galapagos Sharks, Scalloped Hammerhead Sharks, and Gray Reef Sharks.here are about 40 species of sharks found in the Hawaiian waters ranging from 8 inches to over 50 feet long. The most common sharks seen around Hawaii are Blacktip Sharks, Reef Blacktip Sharks, Reef Whitetip Sharks, Tiger Sharks, Sandbar Sharks, Galapagos Sharks, Scalloped Hammerhead Sharks, and Gray Reef Sharks.\nThe tiger shark is a solitary, mostly nocturnal hunter, and is notable for having the widest food spectrum of all sharks, consuming a variety of prey ranging from crustaceans, fish, seals, birds, squid, turtles, and sea snakes to dolphins and even other smaller sharks.ommonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft).\nTiger Shark â\u0080\u0093 Galeocerdo cuvier. Tiger sharks are very large and so they require a considerable amount of wide open space. They enjoy warm water so they are found in the tropic areas of the world as well as some sub tropic locations.ating Habits of Tiger Sharks. A tiger shark will eat any type of fish, shark, animal, and small entity it can find in the water. They are very curious by nature and will taste anything that comes their way. The stomachs of tiger sharks have been found with some very unique items inside of them.\nEating Habits of Tiger Sharks. A tiger shark will eat any type of fish, shark, animal, and small entity it can find in the water. They are very curious by nature and will taste anything that comes their way. The stomachs of tiger sharks have been found with some very unique items inside of them.ating Habits of Tiger Sharks. A tiger shark will eat any type of fish, shark, animal, and small entity it can find in the water. They are very curious by nature and will taste anything that comes their way. The stomachs of tiger sharks have been found with some very unique items inside of them.\nHow fast can a tiger shark swim? Tiger sharks have a maximum speed of about 32 km per hour, which equates to around 20 miles per hour. How fast can a hammerhead shark swim? 8 kilometres per hour (5.0 mph) but when feeding or attacking, the average shark can reach speeds upwards of 19 kilometres per hour (12 mph).\nSome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.Like with other species, tiger sharks in captivity do not live as lengthy as in wildlife reaching only 17 to 20 years.hark lifespan vary by kind. Although the majority of types live 20 to 30 years in the wild, there are some kinds that live much longer than others. For example, the spiny dogfish has one of the longest lifespan at more than 100 years, while the blue shark in the wild has an average lifespan of 15-16 years.\nThe tiger shark is a solitary, mostly nocturnal hunter, and is notable for having the widest food spectrum of all sharks, consuming a variety of prey ranging from crustaceans, fish, seals, birds, squid, turtles, and sea snakes to dolphins and even other smaller sharks.ommonly known as the Sea Tiger, the tiger shark is a relatively large macropredator, capable of attaining a length over 5 m (16 ft). It is found in many tropical and temperate waters, and it is especially common around central Pacific islands.\nTiger Sharks: Another large shark, capable of growing to a length of over 16 feet, or 5 meters, the Tiger Shark can be found in the Caribbean and other warm waters around the world.iger Sharks: Another large shark, capable of growing to a length of over 16 feet, or 5 meters, the Tiger Shark can be found in the Caribbean and other warm waters around the world.\nSharks found in the Caribbean are the tiger shark, sand tiger shark, and the thresher shark!!ots of sharks can be found near Barbados. There have been alot of recorded attacks. I would suggest not venturing to far out at sea. here are a few types of sharks Great whit â\u0080¦ e shark Bull shark Tiger shark Carrabean reef shark Smooth hammerhead sharks and many more.\nOnly a few types of sharks are dangerous to humans. Out of more than 480 shark species, only three are responsible for two-digit numbers of fatal unprovoked attacks on humans: the great white, tiger and bull; however, the oceanic whitetip has probably killed many more castaways, not recorded in the statistics.\nThe life-span of tiger sharks in the wild is considered to be 27 years in average, even though some may live up to 50 years of age. As with other species, tiger sharks in captivity do not live as extensive as in wildlife reaching only 17 to 20 years. Some experts presume that the lifespan of the Great White Sharks is approximately 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The typical life expectancy in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Whale sharks (Rhincodon typus) are also believed to live above 100 years, suggesting that the time to reach maturity is longer and young will take longer to born, making this type of shark more vulnerable.\nTiger Sharks (Galeocerdo cuvier) in Captivity. Thanks to Andy Dehart, Paul Groves, Alan Henningsen, Raul Marin-Osorno, Mark Smith, Alejandro Zepeda, and Filipe Pereira for much of the information on this page. Crow and Hewitt (1988) reported on Longevity records for captive tiger sharks with notes on behaviour and management in Int. Zoo Yearbook 27, 237-240. Dehart (1996) presented a tiger shark summary Henry Doorly Zoo 30-10-1996. New website for tiger sharks in captivity by Raul Marin-Osorno.\nTiger sharks have darker stripe on their sides, especially in younger sharks. These are large sharks that may grow over 18 feet in length and weigh up to 2,000 pounds. Although diving with tiger sharks is an activity some engage in, these are another shark that is one of the top species reported in shark attacks. More Â».\nTiger Shark Habits and Habitat. The tiger shark loves warm waters and is found in most tropical and temperate regions. Other than a ready supply of food, tiger sharks don't have a lot of other requirements for their abode.\nTiger shark is one of the largest species of sharks on the planet. This animal can be found in the warm, tropical and subtropical waters all over the world. Largest population of tiger sharks lives in Melanesia, Micronesia and Polynesia. Tiger sharks normally spends majority of their time in the deep water.\nTiger shark Facts. Tiger shark is one of the largest species of sharks on the planet. This animal can be found in the warm, tropical and subtropical waters all over the world. Largest population of tiger sharks lives in Melanesia, Micronesia and Polynesia.\na bull shark can swim at speeds of around 25mph which is about 40 2km h the body of a bull shark is around 2 1 3 5 meters long which is about 6 9 11 5 feet longas for weight a bull shark will weigh around 90 230kg which is about 198 507 poundsbull sharks have the ability to live in both fresh water and salt waterhe body of a tiger shark can be around 3 5 meters long which is about 9 8 16 4 feet long some can get even bigger than that for instance one tiger shark was found to be 55 meters long which is about 18 feet long as for weight a tiger shark will usually weigh around 385 635kg which is about 849 1400 pounds\nthe body of a tiger shark can be around 3 5 meters long which is about 9 8 16 4 feet long some can get even bigger than that for instance one tiger shark was found to be 55 meters long which is about 18 feet long as for weight a tiger shark will usually weigh around 385 635kg which is about 849 1400 poundshe body of a tiger shark can be around 3 5 meters long which is about 9 8 16 4 feet long some can get even bigger than that for instance one tiger shark was found to be 55 meters long which is about 18 feet long as for weight a tiger shark will usually weigh around 385 635kg which is about 849 1400 pounds\nCARNIVORES. Almost all sharks are carnivores or meat eaters. They live on a diet of fish and sea mammals (like dolphins and seals) and even such prey as turtles and seagulls.Sharks even eat other sharks.For example, a tiger shark might eat a bull shark, a bull shark might eat a blacktip shark and a blacktip shark might eat a dogfish shark! The teeth of the carnivores are sharp and pointy.hey live on a diet of fish and sea mammals (like dolphins and seals) and even such prey as turtles and seagulls. Sharks even eat other sharks. For example, a tiger shark might eat a bull shark, a bull shark might eat a blacktip shark and a blacktip shark might eat a dogfish shark!\nTiger sharks are one of the largest carnivores in the ocean. Juveniles have tiger-like stripes, which fade as they grow older. Tiger sharks are blue or green in color with a light yellow or white under-belly.This speices has a large blunt nose on the end of a wedge-shaped head.iger sharks are some of the largest predators in the ocean and have few species feed on them. Some juvenile tiger sharks, however, fall prey to other sharks. Female tiger sharks gives birth in a nursery, which provides protection during the birthing process and to pups in the absence of parents.\nGeographic Range. Tiger sharks are found in many subtropical and tropical waters, primarily from 45Â°N to 32Â°S. Tiger sharks have been sighted from the eastern coast of North America to the eastern coast of Brazil. This includes the coasts of southern North America, Mexico, and Latin America along the Gulf of Mexico.iger sharks are some of the largest predators in the ocean and have few species feed on them. Some juvenile tiger sharks, however, fall prey to other sharks. Female tiger sharks gives birth in a nursery, which provides protection during the birthing process and to pups in the absence of parents.\nTiger shark is known as voracious carnivore (meat-eater). Regular prey of tiger shark includes dolphins, fish, turtles, dugongs, sea birds, stingrays, sea snakes â\u0080¦. Tiger sharks are definitely not picky eaters.iger sharks are the second most dangerous species of sharks for humans. Unlike great white sharks (which are the most dangerous), tiger sharks will often eat victim after attack. Luckily, encounters between tiger sharks and humans are rare.\nTiger shark Facts. Tiger shark is one of the largest species of sharks on the planet. This animal can be found in the warm, tropical and subtropical waters all over the world. Largest population of tiger sharks lives in Melanesia, Micronesia and Polynesia.Tiger sharks normally spends majority of their time in the deep water.iger sharks are the second most dangerous species of sharks for humans. Unlike great white sharks (which are the most dangerous), tiger sharks will often eat victim after attack. Luckily, encounters between tiger sharks and humans are rare.\nTiger sharks are all of the above, according to Dr. Erich K. Ritter. Tiger sharks are noted for having the widest food spectrum of all sharks. They can eat almost anything, from turtles to birds, as well as other sharks and fish.Besides normal prey they even eat garbage like tires, nails or car license plates, as sometimes documented by examinations of their stomach contents.iger sharks are noted for having the widest food spectrum of all sharks. They can eat almost anything, from turtles to birds, as well as other sharks and fish.\nTiger sharks are some of the largest predators in the ocean and have few species feed on them. Some juvenile tiger sharks, however, fall prey to other sharks. Female tiger sharks gives birth in a nursery, which provides protection during the birthing process and to pups in the absence of parents.iger sharks are some of the largest predators in the ocean and have few species feed on them. Some juvenile tiger sharks, however, fall prey to other sharks. Female tiger sharks gives birth in a nursery, which provides protection during the birthing process and to pups in the absence of parents.\nSometimes; all sharks are predators after all. Most shark species (about 80 percent) have never been known to attack humans. There are four shark species that have always been considered dangerous to humans: great white shark, tiger shark, bull shark and oceanic whitetip shark.17 other species of sharks have also attacked humans. They are considered less dangerous, but can be aggressive if threatened or disturbed.here are four shark species that have always been considered dangerous to humans: great white shark, tiger shark, bull shark and oceanic whitetip shark. 17 other species of sharks have also attacked humans.\nShark Information, Anatomy, Habitat, Feeding, Reproduction and Types of Sharks. Facts about Great White Sharks, Tiger Sharks, Bull Sharks, Whale Sharks, Bull Shark, Hammerhead Shark, Mako Shark and more. Sharks are a large group of fish that have inhabited the oceans for over 400 million years, even before dinosaurs populated our planet. They belong to the superorder Selachimorpha, and modern sharks have specific characteristics like a cartilaginous skeleton, five or six pairs of gills and several rows of teeth.\nThe most fearsome predator of sharks is Homo sapiens sapiens! But sharks have many other predators in the world oceans: - Other sharks, specially the tiger shark (Galeocer â\u0080¦ do cuvier).[Many shark species practice cannibalism.] - The killer whale (Orcinus orca). There are many types of small sharks that are no doubt part of the diet of other predatory animals in the ocean. 2  Also sharks have been observed eating other sharks. 3  The Sharks predators are Dolphins, other sharks and people! 4  But people are the worst.\nTiger sharks have also been known to eat other tiger sharks, but they're not the only ones -- a tiger shark's fins are a hot culinary commodity in Asian culture. Shark fins provide the spaghetti-like noodles in shark-fin soup. In Hong Kong, a tureen of shark-fin soup costs $100 [source: McRae ].ea snakes were found 60 percent of the time, and sea turtles were found in 27 percent of the sharks, although only in larger sharks [source: Heithaus ]. But what gets people's attention is the wackier things that have shown up in a tiger shark's stomach.\nHowever, not everyone is out to get the tiger sharks. Scientists say that predators such as the tiger shark keep the ocean's ecosystem in balance, and in Native Hawaiian belief, tiger sharks are aumakua, or sacred guardian spirits.If you'd like to learn more about tiger sharks, swim over to the links on the next page.ea snakes were found 60 percent of the time, and sea turtles were found in 27 percent of the sharks, although only in larger sharks [source: Heithaus ]. But what gets people's attention is the wackier things that have shown up in a tiger shark's stomach.\nTiger Shark Prey and Predators. As we've mentioned, one of the most interesting things about tiger sharks is its diet. The tiger shark's diet changes as it ages.ea snakes were found 60 percent of the time, and sea turtles were found in 27 percent of the sharks, although only in larger sharks [source: Heithaus ]. But what gets people's attention is the wackier things that have shown up in a tiger shark's stomach.\nDepending on the species, sharks can have different sizes. The  largest is the whale shark that can reach up to 41 feet in length.  The great white shark can be about 20 fee â\u0080¦ t long. Smaller sharks are  the bull and tiger sharks that can have an average length of 11  feet.1  6 Amazing Fish Facts Fish are amazing creatures.he  largest is the whale shark that can reach up to 41 feet in length.  The great white shark can be about 20 fee â\u0080¦ t long. Smaller sharks are  the bull and tiger sharks that can have an average length of 11  feet. 1  6 Amazing Fish Facts Fish are amazing creatures.\nSome scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age.Like with other species, tiger sharks in captivity do not live as lengthy as in wildlife reaching only 17 to 20 years.andbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 20 years of age.", "key": "32_3", "timestamp": "2020-06-23 21:18:58.979172", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}