{"input_text": "In 1995, Reppert cloned and characterized the  Mel  melatonin receptor. He and colleagues found that the receptor was predominantly expressed in the  retina , where it is believed to modify light-dependent retinal functions. They identified outbred populations of  Siberian hamsters  that lacked functional Mel but maintained circadian and reproductive responses to melatonin; these data indicate that Mel is not necessary for the circadian and reproductive actions of melatonin, which instead depend on Mel.\nAt the turn of the century it was discovered that  human eye s contain a non- imaging  photosensor that is the primary regulator of the human circadian rhythm.  This photosensor is particularly affected by  blue  light, and when it observes light the  pineal gland  stops the secretion of  melatonin .  The presence of light at night in human dwellings (or for shift workers) makes going to sleep more difficult and reduces the overall level of melatonin in the  bloodstream , and exposure to a low-level incandescent bulb for 39 minutes is sufficient to suppress melatonin levels to 50%. Because melatonin is a powerful  anti-oxidant , it is hypothesized that this reduction can result in an increased risk of  breast  and  prostate cancer .\nMelatonin receptor agonists are analogues of  melatonin  that bind to and activate the  melatonin receptor .   Agonist s of the melatonin receptor have a number of therapeutic applications including treatment of sleep disorders and depression. The discovery and development of melatonin receptor agonists was motivated by the need for more potent analogues than  melatonin , with better  pharmacokinetics  and longer  half-life .  Melatonin receptor agonists were developed with the melatonin structure as a model.\n In 1917 McCord and Allen discovered melatonin itself.  In 1958,  Aaron B. Lerner  and his colleagues isolated the substance  N-acetyl-5-methoxytryptamine  and named it melatonin. High-affinity melatonin binding sites were pharmacologically characterized in the  bovine  brain in 1979. The first melatonergic receptor was cloned from  melanophores  of  Xenopus laevis  in the 1990s. In 1994 the melatonin receptors were characterized and cloned in the human being.\nIn 1974, I.M. Kvetnoy, with his scientific supervisor N.T. Reichlin, opened extra pineal product  melatonin . During the long research, he found that intestinal cells have the ability to synthesize melatonin. Then, it was found that melatonin is produced in other parts of gastrointestinal tract, as well as in cells of many organs - for example, in the liver, kidney, adrenals, gall bladder, ovary, endometrium, placenta, thymus, leukocytes, platelets and vascular endothelium.\nThe discovery that melatonin is an antioxidant was made in 1993.The first  patent  for its use as a low-dose sleep aid was granted to  Richard Wurtman  at  MIT  in 1995. Around the same time, the hormone got a lot of press as a possible treatment for many illnesses. The New England Journal of Medicine editorialized in 2000:  \"With these recent careful and precise observations in blind persons, the true potential of melatonin is becoming evident, and the importance of the timing of treatment is becoming clear.\"\nCzeisler has examined the effects of  sleep deprivation  on the sleep-wake cycle and circadian rhythms, and how this impacts attention performance.  He found that bright light duration impacts the circadian pacemaker,  melatonin  suppression, and sleepiness. He has also discovered that even room lighting can suppress melatonin production and its duration. Currently (2012), Czeisler is examining the effects of light timing, duration, intensity, and wavelength on resetting the pacemaker through ipRGCs, which contain the photopigment  melanopsin .\nIn 1958, dermatology professor  Aaron B. Lerner  and colleagues at Yale University, in the hope that a substance from the pineal might be useful in treating skin diseases, isolated the hormone from bovine pineal gland extracts and named it melatonin. In the mid-70s Lynch et al. demonstrated that the production of melatonin exhibits a circadian rhythm in human pineal glands.\nMelatonin was first discovered in connection to the mechanism by which some  amphibians  and  reptiles  change the color of their skin. As early as 1917, Carey Pratt McCord and Floyd P. Allen discovered that feeding extract of the pineal glands of cows lightened tadpole skin by contracting the dark  epidermal   melanophores .\nThe discovery that melatonin is an antioxidant was made in 1993. The first patent for its use as a low dose sleep aid was granted to Richard Wurtman at MIT in 1995. Around the same time, the hormone got a lot of press as a possible treatment for many illnesses.\nMelatonin is one of the hormones produced by the pineal gland in all vertebrates. It is also produced in extrapineal organs, such as the eye, GI tract, bone, skin, lymphocytes, platelets, and thymus. 1 Early animal studies in the mid-1960s revealed its ability to affect sexual function, skin color, and other mammalian functions.\nMelatonin is a hormone produced naturally by the pineal gland in response to darkness. Levels remain high during sleep until the pineal gland tapers off production in response to light.elatonin's effects on sleep, other hormones and cancer are the reason it has been studied ever since its discovery in the 1950s. In the mid-1990s, synthetic melatonin became available as a nutritional supplement.\nMelatonin is meant to reset the body's internal clock -- for example, it's appropriate to use the supplement to counter the effects of jet lag, or help someone sleep if they have an unusual work schedule or suffer from a circadian rhythm disorder. It should not be used for general insomnia. The proper dosage, according to a seminal 2001 study from the Massachusetts Institute of Technology, is 0.3 milligrams. The research was conducted by Richard Wurtman, who pioneered the pharmaceutical use of melatonin as a sleep aid in 1994.", "key": "69_3", "timestamp": "2020-06-23 21:18:59.280906", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}