{"input_text": "Freeman advocated for the use of two treatments for pediatric epilepsy that had gone unused for decades: the  ketogenic diet  and the  hemispherectomy . The  ketogenic diet  is a very carefully controlled diet regimen that is high in fat and low in carbohydrates and has been shown to reduce epilepsy symptoms in children. It was developed in 1921 but fell into disuse when anticonvulsant drugs came into widespread use in the 1940s and -50s. When Freeman returned to Hopkins in 1969, the diet was being used on only a few patients. Freeman revived the diet for wider use on children for whom multiple medicines were ineffective. According to Guy McKhann, the founding director of the Hopkins Department of Neurology, Freeman effected the \"resurrection\" of the diet \"virtually all by himself, against great skepticism and opposition.\" In 1994, Freeman was contacted by  Jim Abrahams , a movie director whose son, Charlie, was suffering from epilepsy that had not responded to anticonvulsants. Charlie's epilepsy was cured on the ketogenic diet, and the story of his cure was the inspiration for the film  ...First Do No Harm . Abrahams founded The Charlie Foundation To Help Cure Pediatric Epilepsy, which is now known as The Charlie Foundation for Ketogenic Therapies.\nThe original therapeutic diet for  paediatric epilepsy  provides just enough protein for body growth and repair, and sufficient  calories  to maintain the correct weight for age and height. This classic ketogenic diet contains a 4:1  ratio by weight of fat to combined protein and carbohydrate. This is achieved by excluding high-carbohydrate foods such as starchy fruits and vegetables, bread, pasta, grains and sugar, while increasing the consumption of foods high in fat such as nuts, cream and butter. Most dietary fat is made of molecules called long-chain triglycerides (LCTs). However,  medium-chain triglyceride s (MCTs)—made from fatty acids with shorter  carbon chain s than LCTs—are more ketogenic. A variant of the classic diet known as the MCT ketogenic diet uses a form of  coconut oil , which is rich in MCTs, to provide around half the calories. As less overall fat is needed in this variant of the diet, a greater proportion of carbohydrate and protein can be consumed, allowing a greater variety of food choices.\nThough it was originally developed to treat patients with epilepsy, interest in the ketogenic diet has taken off in recent years as we've learned more about its therapeutic and health benefits. Hereâ\u0080\u0099s what you need to know about â\u0080\u0098ketoâ\u0080\u0099 and why some health experts believe it's good for your body â\u0080\u0094 especially your brain. Fasting and other ketogenic-like diets have been used to treat conditions like epilepsy for thousands of years. And in fact, a version of the keto diet has been traced back to 500 BC.\nKeto is a very low-carbohydrates, high-fat, adequate protein diet. The Ketogenic diet is almost 100 yeard old, it was use as a treatment for the epileptic patients in the 1920 and 1930s: http://en.wikipedia.org/wiki/Ketogenic_diet.f it's your first time doing a Ketogenic diet, it will take your body between 10 to 30 days to fully adapt to a Ketogenic metabolism. The reason why most people can't follow this diet is because of the adaptation phase.\nNo one knows why the ketogenic diet -- which was developed in the 1920's -- works so well. But we do know something about how it affects the body. By reducing the number of carbohydrates a person eats, the body is forced to burn fat for energy, a process called ketosis.ow ketosis helps with epilepsy isn't known, but it does. Researchers at Johns Hopkins University studied 150 children with epilepsy in one important study. After a year on the ketogenic diet, half of children had 50% fewer seizures. One fourth of the children reduced their seizures by 90%.\nA ketogenic diet was developed early in the 20th century to successfully treat children with drug refractory epilepsy (7). A direct comparison showed that saturated fat is undesirable even when a high-fat ketogenic diet is required, as in special treatments of refractory epilepsy (8).\nWHAT IS THE KETOGENIC DIET? The ketogenic diet was designed in 1924 by Dr. Russell Wilder at the Mayo Clinic. Despite being highly effective in treating epilepsy, it fell out of fashion due to the surge in new anti-seizure medications in the 1940s.\nGluten-free Ketogenic Diet with MCTs Reverses Autism and Eliminates Seizures. Coconut Oil and Olive Oil mayonnaise â\u0080\u0093 good for ketogenic diets. Recipe here. The ketogenic diet was developed at John Hopkins hospital in the 1920s as a natural cure for epilepsy, when drugs failed. Today, the diet therapy is coming back into favor, as much research has been published about the long-term safety of the diet, as well as researching debunking the â\u0080\u009csaturated-fat-is-badâ\u0080\u009d dogma.\nThe ketogenic diet is a mainstream therapy that does not use pharmaceutical drugs, which was developed to reproduce the success and remove the limitations of the non-mainstream use of fasting to treat epilepsy. Although popular in the 1920s and 30s, it was largely abandoned in favour of new anticonvulsant drugs.\nThe ketogenic diet, which has reportedly been used by celebs like Kim Kardashian and NBA player Lebron James, is a high-fat, low-protein, low-carbohydrate diet that was originally developed to treat epilepsy in children (experts can't say for sure why it reduces the frequency of seizures, but it does seem to work).\nSpecial diets in type 2 diabetes often focus on weight loss, so it might seem crazy that a high-fat diet can be one answer to diabetes. But the ketogenic (keto) diet, high in fat and low in carbs, can potentially change the way your body stores and uses energy, easing diabetes symptoms. With the keto diet, your body converts fat, instead of sugar, into energy. The diet was created in 1924 as a treatment for epilepsy, but the effects of this eating pattern are also being studied for potential usefulness with type 2 diabetes.\nAs noted, the ketogenic diet was originally meant for the treatment of epilepsy â\u0080\u0094 and it works startlingly well. Research has shown that, for children will refractory epilepsy, a keto treatment lasting for six to 24 months can result in a 90% decrease or elimination of seizures.\nHereâ\u0080\u0099s what you need to know about â\u0080\u0098ketoâ\u0080\u0099 and why some health experts believe it's good for your body â\u0080\u0094 especially your brain. Fasting and other ketogenic-like diets have been used to treat conditions like epilepsy for thousands of years. And in fact, a version of the keto diet has been traced back to 500 BC.\nBut the ketogenic (keto) diet, high in fat and low in carbs, can potentially change the way your body stores and uses energy, easing diabetes symptoms. With the keto diet, your body converts fat, instead of sugar, into energy. The diet was created in 1924 as a treatment for epilepsy, but the effects of this eating pattern are also being studied for type 2 diabetes. The ketogenic diet may improve blood glucose (sugar) levels while also reducing the need for insulin.\nThe Ketogenic Diet is a high fat diet which appears to benefit some people with epilepsy, especially children. It is not a magic cure but one alternative to the various anti-epileptic. medications currently available. The ketogenic diet offers the advantage of improved seizure. control for some children, and in some cases, improved mental alertness with fewer medications. The ketogenic diet is often regarded as a difficult regimen to follow, however, with practice, and.\nThe classic therapeutic ketogenic diet was developed for treatment of paediatric epilepsy in the 1920s and was widely used into the next decade, but its popularity waned with the introduction of effective anticonvulsant medications. This classic ketogenic diet contains a 4:1 ratio by weight of fat to combined protein and carbohydrate.", "key": "78_2", "timestamp": "2020-06-23 21:18:59.330861", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}