{"input_text": "When Darwin wrote  On the Origin of Species by Means of Natural Selection, or the Preservation of Favoured Races in the Struggle for Life , the oldest animal fossils were those from the  Cambrian  Period, now known to be about 540 million years old. He worried about the absence of older fossils because of the implications on the validity of his theories, but he expressed hope that such fossils would be found, noting that: \"only a small portion of the world is known with accuracy.\" Darwin also pondered the sudden appearance of many groups (i.e.  phyla ) in the oldest known Cambrian fossiliferous strata.\nThe most significant evolutionary theory before Darwin's was that of  Jean-Baptiste Lamarck ; based on the  inheritance of acquired characteristics  (an inheritance mechanism that was widely accepted until the 20th century), it described a chain of development stretching from the lowliest microbe to humans. The British naturalist  Charles Darwin , combining the biogeographical approach of Humboldt, the uniformitarian geology of Lyell,  Thomas Malthus 's writings on population growth, and his own morphological expertise, created a more successful evolutionary theory based on  natural selection ; similar evidence led  Alfred Russel Wallace  to independently reach the same conclusions.  Charles Darwin 's early interest in nature led him on a  five-year voyage  on  which established him as an eminent  geologist  whose observations and theories supported  Charles Lyell 's  uniformitarian  ideas, and publication of his  journal of the voyage  made him famous as a popular author. Puzzled by the geographical distribution of wildlife and  fossil s he collected on the voyage, Darwin investigated the  transmutation of species  and conceived his theory of natural selection in 1838. Although he discussed his ideas with several naturalists, he needed time for extensive research and his geological work had priority. He was writing up his theory in 1858 when  Alfred Russel Wallace  sent him an essay which described the same idea, prompting immediate joint publication of  both of their theories .Darwin's  On the Origin of Species , published on 24 November 1859, a seminal work of scientific literature, was to be the foundation of evolutionary biology.\nFossils from the genus Lufengpithecus from the late Miocene is crucial in understanding hominoid evolution in Asia. The fossil being studied may be a member of the Homininae and study wants to show estimate age of molars in Lufengpithecus lufengensis at time of death. The results of the paper will help understand “Life History” in Miocene and Plio-Pleistocene hominids and great apes and humans. “Life history refers to the timing or scheduling of events from conception to death” (Zhao & Qingwu & Wending 2007).  The author uses fossil PA868 as baseline and the fossil is thought to be a juvenile. They use the right mandibular of the fossil which has right four premolar and permanent first molar (M1)and also has five right permanent tooth crown germs which are I1, I2, C, P3, and P4 and the author concludes that  PA868 was most likely a female. Age at time of death of PA868 was estimated using the number of perikymata on the surface of the cusp to the developing cervix. Age was 2.4-4.5 years based on the central incisor germ and 2.5-4.7 years based on the canine germ. The author discovers that first molar emergence was younger than the age of death due to the emergence of symptoms resembling gingivitis. The age of molars in the PA868 was estimated 3.2-3.3 years. The age of the crown formation took about .25-.75 years for PA868. Cuspal enamel formed within .4–1 years. Lateral enamel formed in 686–1078 days .The age of first molar emergence for PA868 resembles that of extant great apes and is less in relation to modern humans. Lufengpithecus lufengensis is more similar to great apes and the hominoids and less related to monkeys and modern humans.\nIn this book Pember attempted to reconcile the  Genesis  account of the world's creation with the emerging fossil evidence in geological science about the age of the earth.  Pember argued a position known as \"The  Gap Theory \", and which had been previously proposed by the Scottish theologian  Thomas Chalmers  (1780–1847).  In this theory, God originally created the universe but due to the rebellion of some angels led by  Lucifer  (or  Satan ) the earth descended into chaos and life was destroyed. Pember's position was that the first chapter of Genesis gave an account of God restoring or recreating the world after the collapse of the original creation. So proponents of the Gap Theory like Pember propose that a \"gap\" exists between the first two verses in Genesis chapter one which allows for all the extra time needed to include the ancient fossil and geological evidences. The geological fossils were creatures that lived in the original creation and were destroyed when Lucifer fell into  sin .  The biblical story of  Adam  and  Eve  is about a later recreation of the world.  Pember's argument for the \"Gap Theory\" is an example of how some evangelical Christians in the nineteenth century tried to reconcile geological evidence for an old earth with the book of Genesis and without embracing  Charles Darwin 's theory about the  evolution  of the species.\nDubois' 1891 find was the first fossil of a Homo-species (or any hominin species) found as result of a directed expedition and search—and which was inspired by Darwin's radical theory that humans, like all other species, evolved from ancestral species, see  human evolution . (The first found and recognized human fossil was the accidental discovery of  Homo Neanderthalensis  in 1856, see  List of human evolution fossils .) The Java fossil from  Indonesia  aroused much public interest. It was dubbed by the popular press as  Java Man ; but few scientists accepted Dubois' argument that his fossil was the  transitional form —the so-called  \"missing link\" —between apes and humans. Java Man is now classified as Homo erectus.\nDarwin's contemporaries eventually came to accept the transmutation of species based upon  fossil  evidence, and the  X Club  was formed to defend evolution against the church and wealthy amateurs. However, the specific evolutionary mechanism which Darwin provided—natural selection—was actively disputed by scientists in favour of alternative theories such as  Lamarckism  and  orthogenesis . Darwin's  gradualistic  account was also opposed by  saltationism  and  catastrophism .  Lord Kelvin  led scientific opposition to gradualism on the basis of his thermodynamic calculations that the  Earth  was  between 24 and 400 million years old , an estimate disputed by geologists. These figures were corrected in 1907 when radioactive dating of rocks showed that the Earth was billions of years old. Kelvin's own views favoured a version of theistic evolution accelerated by divine guidance. The specific  hereditary  mechanism Darwin provided,  pangenesis , lacked any supporting evidence. Although evolution was unchallenged, uncertainties about the mechanism in  the eclipse of Darwinism  persisted from the 1880s until the 1930s  inclusion of  Mendelian inheritance  and the rise of the  modern evolutionary synthesis . The modern synthesis rose to universal acceptance among biologists with the help of new evidence, such as  genetics , which confirmed Darwin's predictions and refuted the competing theories.\nPrior to 1950 there was no widely accepted fossil evidence of life before the Cambrian period. When  Charles Darwin  wrote The Origin of Species he acknowledged that the lack of any fossil evidence of life prior to the relatively complex animals of the Cambrian was a potential argument against the theory of evolution, but expressed the hope that such fossils would be found in the future. In the 1860s there were claims of the discovery of  pre-Cambrian  fossils, but these would later be shown not to have an organic origin. In the late 19th century Charles Doolittle Walcott would discover  stromatolites  and other fossil evidence of pre-Cambrian life, but at the time the organic origin of those fossils was also disputed. This would start to change in the 1950s with the discovery of more stromatolites along with  microfossils  of the bacteria that built them, and the publication of a series of papers by the  Soviet  scientist Boris Vasil'evich Timofeev announcing the discovery of microscopic fossil spores in pre-Cambrian sediments. A key breakthrough would come when  Martin Glaessner  would show that fossils of soft bodied animals discovered by  Reginald Sprigg  during the late 1940s in the Ediacaran hills of Australia were in fact pre-Cambrian not early Cambrian as Sprigg had originally believed, making the  Ediacaran biota  the oldest animals known. By the end of the 20th century,  paleobiology  had established that the history of life extended back at least 3.5 billion years.\nChapter X examines whether patterns in the fossil record are better explained by common descent and branching evolution through natural selection, than by the individual creation of fixed species. Darwin expected species to change slowly, but not at  the same rate  – some organisms such as  Lingula  were unchanged since the earliest fossils. The pace of natural selection would depend on variability and change in the environment. This distanced his theory from  Lamarckian  laws of inevitable progress. It has been argued that this anticipated the  punctuated equilibrium  hypothesis, but other scholars have preferred to emphasise Darwin's commitment to gradualism. He cited  Richard Owen 's findings that the earliest members of a class were a few simple and generalised species with characteristics intermediate between modern forms, and were followed by increasingly diverse and specialised forms, matching the branching of common descent from an ancestor. Patterns of extinction matched his theory, with related groups of species having a continued existence until extinction, then not reappearing. Recently extinct species were more similar to living species than those from earlier eras, and as he had seen in South America, and  William Clift  had shown in Australia, fossils from recent geological periods resembled species still living in the same area.\nVertebrate fossil finds, especially of marine reptiles, made Anning's reputation, but she made numerous other contributions to early palaeontology. In 1826 she discovered what appeared to be a chamber containing dried ink inside a  belemnite  fossil. She showed it to her friend Elizabeth Philpot who was able to revivify the ink and use it to illustrate some of her own ichthyosaur fossils. Soon other local artists were doing the same, as more such fossilised ink chambers were discovered. Anning noted how closely the fossilised chambers resembled the ink sacs of modern  squid  and  cuttlefish , which she had dissected to understand the anatomy of fossil  cephalopod s, and this led William Buckland to publish the conclusion that Jurassic belemnites had used ink for defence just as many modern cephalopods do.<ref>\nThe idea that there had been a series of episodes of divine creation of new species with many thousands of years in between them, serving to prepare the world for the eventual arrival of humanity, was popular with  Anglican   geologist s like  William Buckland  in the early 19th century; they proposed it as an explanation for the patterns of  faunal succession  in the fossil record that showed that the types of organisms that lived on the earth had changed over time. Buckland explained the idea in detail in his book Geology and Mineralogy considered with reference to Natural Theology (1836), which was one of the eight  Bridgewater Treatises . Buckland presented this idea in part to counter pre-Darwin theories on the  transmutation of species . The Scottish geologist and evangelical Christian  Hugh Miller  also argued for many separate creation events brought about by divine interventions, and explained his ideas in his book The testimony of the rocks; or, Geology in its bearings on the two theologies, natural and revealed in 1857.\nCharles Darwin  had argued that  humanity evolved in Africa , because this is where  great ape s like  gorillas  and  chimpanzees  lived. Though Darwin's claims have since been vindicated by the  fossil  record, they were proposed without any fossil evidence. Other scientific authorities disagreed with him, like  Charles Lyell , a  geologist , and  Alfred Russel Wallace , who had thought of the  theory of evolution  around the same time as Darwin. Because both Lyell and Wallace believed that humans were more closely related to  gibbon s and  orangutan s, they identified  Southeast Asia  as the cradle of humanity because this is where these great apes lived. Dutch anatomist  Eugène Dubois  favored the latter theory, and sought to confirm it.\nSoon after these discoveries, Ichthyornis was recognized for its significance to the theory of evolution recently published by Charles Darwin. Darwin himself told Marsh in an 1880 letter that Ichthyornis and  Hesperornis  offered \"the best support for the theory of evolution\" since he had first published  On the Origin of Species  in 1859. (While  Archaeopteryx  was the first known Mesozoic avialan and is now known to have also had teeth, the first specimen with a skull was not described until 1884). Others at the time also recognized the implications of a nearly modern bird with reptilian teeth, and feared the controversy it caused. One Yale student described various men and women urging Marsh to conceal Ichthyornis from the public because it lent too much support to evolutionary theory. Many accused Marsh of having tampered with the fossils or intentionally created a hoax by associating reptilian jaws with the body of a bird, accusations that continued to surface even as late as 1967. However, an overwhelming majority of researchers have demonstrated that Marsh's interpretation of the fossils was correct, and he was fully vindicated by later finds.\nIn 1859, when  Charles Darwin 's  On the Origin of Species  was first published, the fossil record was poorly known. Darwin described the perceived lack of transitional fossils as, \"...the most obvious and gravest objection which can be urged against my theory,\" but explained it by relating it to the extreme imperfection of the geological record. He noted the limited collections available at that time, but described the available information as showing patterns that followed from his theory of  descent with modification  through  natural selection . Indeed,  Archaeopteryx  was discovered just two years later, in 1861, and represents a classic transitional form between  dinosaur s and  bird s.  Many more transitional fossils  have been discovered since then, and there is now abundant evidence of how all  classes  of  vertebrate s are related, much of it in the form of transitional fossils. Specific examples include  humans and other primates ,  tetrapod s and  fish , and  birds and dinosaurs .\nEvolutionary biology is partly based on  paleontology , which uses the  fossil  record to answer questions about the mode and tempo of evolution, and partly on the developments in areas such as  population genetics  and evolutionary theory. Following the development of  DNA fingerprinting  techniques in the late 20th century, the application of these techniques in zoology has increased the understanding of animal populations.  In the 1980s,  developmental biology  re-entered evolutionary biology from its initial exclusion from the  modern synthesis  through the study of  evolutionary developmental biology . Related fields often considered part of evolutionary biology are  phylogenetics ,  systematics , and  taxonomy .\nSeveral groups of extinct gymnosperms, particularly  seed fern s, have been proposed as the ancestors of flowering plants but there is no continuous fossil evidence showing exactly how flowers evolved. The apparently sudden appearance of relatively modern flowers in the fossil record posed such a problem for the theory of evolution that it was called an \"abominable mystery\" by  Charles Darwin . Recently discovered angiosperm fossils such as Archaefructus, along with further discoveries of fossil gymnosperms, suggest how angiosperm characteristics may have been acquired in a series of steps.\nThe apparently sudden appearance of nearly modern flowers in the fossil record initially posed such a problem for the theory of  evolution  that  Charles Darwin  called it an \"abominable mystery\". However, the fossil record has considerably grown since the time of Darwin, and recently discovered angiosperm fossils such as  Archaefructus , along with further discoveries of fossil gymnosperms, suggest how angiosperm characteristics may have been acquired in a series of steps. Several groups of extinct gymnosperms, in particular  seed fern s, have been proposed as the  ancestors  of flowering plants, but there is no continuous fossil evidence showing exactly how flowers evolved. Some older fossils, such as the upper  Triassic   Sanmiguelia , have been suggested. Based on current evidence, some propose that the ancestors of the angiosperms diverged from an unknown group of gymnosperms in the  Triassic  period (245–202 million years ago). Fossil angiosperm-like pollen from the Middle Triassic (247.2–242.0 Ma) suggests an older date for their origin.  A close relationship between angiosperms and  gnetophyte s, proposed on the basis of  morphological  evidence, has more recently been disputed on the basis of  molecular evidence  that suggest gnetophytes are instead more closely related to other  gymnosperm s.\nApuntes Toggraficos, published in 1847 by Muñiz, contained his  topographical  notes that discussed the study of fossils in the relative ages of  sedimentary strata  in areas south of the  Buenos Aires Province  by  naturalist s, including  Charles Darwin . Darwin began corresponding with Muñiz after reading his work on ñata cattle, indicative of the reputation that he was gaining as a naturalist.  Domingo Sarmiento , who researched Muñiz's papers, commented on his influence to Darwin's theory of the origin of species.\nHis other amateur scientific interests included  botany ,  geology  and the study of  X ray s; his study of  fossil s caused him to disbelieve  Darwin 's theory of  evolution .\nHays was among those Philadelphians who stubbornly advocated for an incremental theory of evolution, describing fossil vertebrates in the 1830s and '40s as supporting the  theory of natural selection  that eventually was elaborated by  Charles Darwin  in Origin of Species (1859).\nDarwin discusses  morphology , including the importance of  homologous structures . He says, \"What can be more curious than that the hand of a man, formed for grasping, that of a mole for digging, the leg of the horse, the paddle of the porpoise, and the wing of the bat, should all be constructed on the same pattern, and should include the same bones, in the same relative positions?\" This made no sense under doctrines of independent creation of species, as even  Richard Owen  had admitted, but the \"explanation is manifest on the theory of the natural selection of successive slight modifications\" showing  common descent . He notes that animals of the same class often have extremely similar  embryos . Darwin discusses rudimentary organs, such as the wings of flightless birds and the rudiments of pelvis and leg bones found in some snakes. He remarks that some rudimentary organs, such as teeth in  baleen whales , are found only in embryonic stages. These factors also supported his theory of descent with modification.\nTransitional fossils provide rich evidence for evolution.  Charles Darwin  predicted such fossils in 1859, and those later identified as such include:\nWith Darwin's theory, a general acceptance that classification should reflect the Darwinian principle of  common descent  quickly appeared.  Tree of Life  representations became popular in scientific works, with known fossil groups incorporated. One of the first modern groups tied to fossil ancestors was  birds . Using the then newly discovered fossils of  Archaeopteryx  and  Hesperornis ,  Thomas Henry Huxley  pronounced that they had evolved from dinosaurs, a group formally named by  Richard Owen  in 1842. The resulting description, that of dinosaurs \"giving rise to\" or being \"the ancestors of\" birds, is the essential hallmark of  evolutionary taxonomic  thinking. As more and more fossil groups were found and recognized in the late 19th and early 20th centuries,  palaeontologists  worked to understand the history of animals through the ages by linking together known groups. With the  modern evolutionary synthesis  of the early 1940s, an essentially modern understanding of the evolution of the major groups was in place. As evolutionary taxonomy is based on Linnaean taxonomic ranks, the two terms are largely interchangeable in modern use.\nIn the 1920s and 1930s a modern evolutionary synthesis connected natural selection, mutation theory, and Mendelian inheritance into a unified theory that applied generally to any branch of biology. The modern synthesis was able to explain patterns observed across species in populations, through  fossil transitions  in palaeontology, and even complex cellular mechanisms in  developmental biology . The publication of the structure of  DNA  by  James Watson  and  Francis Crick  in 1953 demonstrated a physical mechanism for inheritance.  Molecular biology  improved our understanding of the relationship between  genotype  and  phenotype . Advancements were also made in  phylogenetic   systematics , mapping the transition of traits into a comparative and testable framework through the publication and use of  evolutionary trees . In 1973, evolutionary biologist  Theodosius Dobzhansky  penned that \" nothing in biology makes sense except in the light of evolution ,\" because it has brought to light the relations of what first seemed disjointed facts in natural history into a coherent  explanatory  body of knowledge that describes and predicts many observable facts about life on this planet.\nIn October 1836  Charles Darwin  returned from the  Beagle voyage  with fossil collections which the anatomist  Richard Owen  described, contributing to the  inception of Darwin's theory  of  natural selection . Darwin outlined his theory in an Essay of 1844, and discussed transmutation with his friend  Joseph Dalton Hooker . He did not tell Owen, who as the up-and-coming \"English  Cuvier \" held the conventional belief that every species was uniquely created perfectly adapted. Owen's brilliance and political skills made him a leading figure in the scientific establishment, developing ideas of divine  archetype s produced by vague secondary laws similar to a form of  theistic evolution , while emphasising the differences separating man from ape. At the end of 1844 the anonymous book  Vestiges of the Natural History of Creation  brought wide public interest in  transmutation of species  and the idea that humans were descended from apes, and after a slow initial response, strong condemnation from the scientific establishment.\nThe measure is most useful in  palaeontology , where  macroevolutionary  changes in the dimensions of  fossil s can be compared.  Where this is used it is an indirect measure as it relies on  phenotypic  rather than  genotypic  data.  Several data are required to overcome natural variation within a population.  The darwin only measures the evolution of a particular  trait  rather than a  lineage ; different traits may evolve at different rates within a lineage.  The evolution of traits can however be used to infer as a  proxy  the evolution of lineages.\nOne of the first and most important naturalists to be convinced by Origin of the reality of evolution was the British anatomist Thomas Henry Huxley. Huxley recognized that unlike the earlier transmutational ideas of Jean-Baptiste Lamarck and Vestiges of the Natural History of Creation, Darwin's theory provided a mechanism for evolution without supernatural involvement, even if Huxley himself was not completely convinced that natural selection was the key evolutionary mechanism. Huxley would make advocacy of evolution a cornerstone of the program of the  X Club  to reform and professionalise science by displacing natural theology with  naturalism  and to end the domination of British  natural science  by the clergy. By the early 1870s in English-speaking countries, thanks partly to these efforts, evolution had become the mainstream scientific explanation for the origin of species. In his campaign for public and scientific acceptance of Darwin's theory, Huxley made extensive use of new evidence for evolution from paleontology. This included evidence that birds had evolved from reptiles, including the discovery of  Archaeopteryx  in Europe, and a number of fossils of primitive birds with teeth found in  North America . Another important line of evidence was the finding of fossils that helped trace the  evolution of the horse  from its small five-toed ancestors. However, acceptance of evolution among scientists in non-English speaking nations such as  France , and the countries of southern Europe and  Latin America  was slower. An exception to this was  Germany , where both  August Weismann  and  Ernst Haeckel  championed this idea: Haeckel used evolution to challenge the established tradition of metaphysical idealism in German biology, much as Huxley used it to challenge natural theology in Britain. Haeckel and other German scientists would take the lead in launching an ambitious programme to reconstruct the evolutionary history of life based on morphology and embryology.\nThus, transitional fossils like Archaeopteryx came to be seen as not only corroborating Darwin's theory, but as icons of evolution in their own right. For example, the Swedish  encyclopedic dictionary  Nordisk familjebok of 1904 showed an inaccurate Archaeopteryx reconstruction (see illustration) of the fossil, \"ett af de betydelsefullaste paleontologiska fynd, som någonsin gjorts\" (\"one of the most significant paleontological discoveries ever made\").\nThe first discovered Cambrian fossils were  trilobites , described by  Edward Lhuyd , the curator of  Oxford Museum , in 1698. Although their evolutionary importance was not known, on the basis of their old age,  William Buckland  (1784–1856) realised that a dramatic step-change in the fossil record occurred around the base of what we now call the Cambrian. Nineteenth-century geologists such as  Adam Sedgwick  and  Roderick Murchison  used the fossils for dating rock strata, specifically for establishing the  Cambrian  and  Silurian  periods. By 1859, leading geologists including Roderick Murchison, were convinced that what was then called the lowest Silurian stratum showed the origin of life on Earth, though others, including  Charles Lyell , differed. In  On the Origin of Species ,  Charles Darwin  considered this sudden appearance of a solitary group of trilobites, with no apparent antecedents, and absence of other fossils, to be \"undoubtedly of the gravest nature\" among the difficulties in his theory of natural selection. He reasoned that earlier seas had swarmed with living creatures, but that their fossils had not been found due to the imperfections of the fossil record. In the sixth edition of his book, he stressed his problem further as:\nSaussure had a thorough knowledge of the chemistry of the day and applied it to the study of minerals, water and air. His geological observations made him a firm believer in the  Neptunian theory : He regarded all rocks and minerals as deposited from aqueous solution or suspension, and attached much importance to the study of meteorological conditions. His work with rocks, erosion, and fossils also led him to believe that the earth was much older than generally thought and formed part of the basis of  Darwin 's  Theory of Evolution .\nCharles Darwin 's publication of the  On the Origin of Species  in 1859 was a watershed event in all the life sciences, especially paleontology. Fossils had played a role in the development of Darwin's theory. In particular he had been impressed by fossils he had collected in  South America  during the  voyage of the Beagle  of  giant armadillo s,  giant sloth s, and what at the time he thought were  giant llama s that seemed to be related to species still living on the continent in modern times. The scientific debate that started immediately after the publication of Origin led to a concerted effort to look for  transitional fossils  and other evidence of evolution in the fossil record. There were two areas where early success attracted considerable public attention, the transition between reptiles and birds, and the evolution of the modern single-toed horse. In 1861 the first specimen of  Archaeopteryx , an animal with both teeth and feathers and a mix of other reptilian and avian features, was discovered in a limestone quarry in Bavaria and described by  Richard Owen . Another would be found in the late 1870s and put on display at a Museum in Berlin in 1881. Other primitive toothed birds were found by  Othniel Marsh  in Kansas in 1872. Marsh also discovered fossils of several primitive horses in the Western United States that helped trace the  evolution of the horse  from the small 5-toed  Hyracotherium  of the  Eocene  to the much larger single-toed modern horses of the genus Equus.  Thomas Huxley  would make extensive use of both the horse and bird fossils in his advocacy of evolution. Acceptance of evolution occurred rapidly in scientific circles, but acceptance of Darwin's proposed mechanism of  natural selection  as the driving force behind it was much less universal. In particular some paleontologists such as  Edward Drinker Cope  and  Henry Fairfield Osborn  preferred alternatives such as neo- Lamarckism , the inheritance of characteristics acquired during life, and  orthogenesis , an innate drive to change in a particular direction, to explain what they perceived as linear trends in evolution.\nBdelloidea  ( Greek  βδελλα, bdella, \"leech-like\") is a  class  of  rotifer s found in  freshwater  habitats all over the world.  There are over 450 described  species  of bdelloid rotifers (or 'bdelloids'), distinguished from each other mainly on the basis of  morphology . The main characteristics that distinguish bdelloids from  related groups of rotifers  are exclusively  parthenogenetic reproduction  and the ability to survive in dry, harsh environments by entering a state of desiccation-induced  dormancy  ( anhydrobiosis ) at any life stage. They are often referred to as \"ancient asexuals\" due to their unique asexual history that spans back to over 25 million years ago through fossil evidence. Bdelloid rotifers are microscopic organisms, typically between 150 and 700 µm in length.  Most are slightly too small to be seen with the naked eye, but appear as tiny white dots through even a weak  hand lens , especially in bright light.\nNiklas was curator for the  New York Botanical Garden . He joined the faculty at Cornell in 1978. In 1985 he was named full professor and appointed to his current chair as a Liberty Hyde Bailey Professor in 2000. He is the author of over 320 peer-reviewed scientific papers and five major books, all published by the  University of Chicago Press . Niklas has received numerous awards, including awards for teaching (e.g., he received the SUNY Chancellor's Award for teaching in 1995). He is a member of the  Botanical Society of America  and served as its President (2008 – 2009) and Editor-in-Chief of the  American Journal of Botany  (1995 – 2004).Niklas was the first botanist to tabulate the temporal distributions of plant species in the fossil record to quantify land plant diversification patterns throughout the Phanerozoic, and he was among the first to use factor analysis to identify major floristic changes and turnover patterns in the fossil record.  Niklas is also the only person to construct a computer generated morphospace for early land plants to quantify how each simulated plant intercepts sunlight, copes with mechanical forces, conducts fluids, and sheds reproductive propagules.  Using a search algorithm, he was able to simulate patterns of morphological change that mimicked in all respects patterns observed in the fossil record.  Another facet of his work was the use of fluid mechanics to understand how wind pollinated plants trap airborne pollen grains.  Niklas’ more recent work has continued to focus on using physics, chemistry, and mathematics to quantify how physical factors dictate the spatial and temporal distributions of extant plants.  His books on biomechanics and plant allometry have stimulated a renaissance in the use of engineering and scaling principles to understand diverse phenomena, ranging from the relationship between plant growth rates and body mass and the effects of wind on the mechanical stability of trees to the distributions of above- and below-ground biomass in forested communities.  Niklas is also a celebrated and dedicated teacher and mentor.\nRichard Dawkins  has explained evolution as \"a theory of gradual, incremental change over millions of years, which starts with something very simple and works up along slow, gradual gradients to greater complexity,\" and described the existing fossil record as entirely consistent with that process. Biologists emphasize that transitional gaps between those fossils recovered are to be expected, that the existence of any such gaps cannot be invoked to disprove evolution, and that instead the fossil evidence that could be used to disprove the theory would be those fossils which are found and which are entirely inconsistent with what can be predicted or anticipated by the evolutionary model. One example given by Dawkins was, \"If there were a single  hippo  or  rabbit in the Precambrian , that would completely blow evolution out of the water. None have ever been found.\"\nIn 1972, paleontologists  Niles Eldredge  and  Stephen Jay Gould  published a landmark paper developing their theory and called it punctuated equilibria. Their paper built upon  Ernst Mayr 's model of  geographic speciation ,  I. Michael Lerner 's theories of developmental and genetic homeostasis, as well as their own  empirical research . Eldredge and Gould proposed that the degree of gradualism commonly attributed to  Charles Darwin  is virtually nonexistent in the fossil record, and that stasis dominates the history of most  fossil  species.\nDarwin's  On the Origin of Species , which made a powerful impression on Haeckel when he read it in 1864, was very cautious about the possibility of ever reconstructing the history of life, but did include a section reinterpreting von Baer's embryology and revolutionising the field of study, concluding that \"Embryology rises greatly in interest, when we thus look at the embryo as a picture, more or less obscured, of the common parent-form of each great class of animals.\" It mentioned von Baer's 1828 anecdote (misattributing it to  Louis Agassiz ) that at an early stage embryos were so similar that it could be impossible to tell whether an unlabelled specimen was of a mammal, a bird, or of a reptile, and Darwin's own research using embryonic stages of  barnacle s to show that they are  crustacean s, while cautioning against the idea that one organism or embryonic stage is \"higher\" or \"lower\", or more or less evolved. Haeckel disregarded such caution, and in a year wrote his massive and ambitious Generelle Morphologie, published in 1866, presenting a revolutionary new synthesis of Darwin's ideas with the German tradition of  Naturphilosophie  going back to  Goethe  and with the progressive evolutionism of  Lamarck  in what he called Darwinismus. He used  morphology  to reconstruct the  evolutionary history of life , in the absence of fossil evidence using embryology as evidence of ancestral relationships. He invented new terms, including  ontogeny  and  phylogeny , to present his evolutionised recapitulation theory that \"ontogeny recapitulated phylogeny\". The two massive volumes sold poorly, and were heavy going: with his limited understanding of German, Darwin found them impossible to read. Haeckel's publisher turned down a proposal for a \"strictly scholarly and objective\" second edition.\nThe Darwin fish is an ichthys symbol with \"evolved\" legs and feet attached, and often with the word \" Darwin \" inside (like the ΙΧΘΥΣ or Jesus found in some Christian versions). It symbolizes the  scientific theory  of  evolution , for which Charles Darwin laid the foundation, in contrast with  creationism , which is often associated with some variations of Christianity. The Darwin fish bears a stylized resemblance to  Tiktaalik  or  Ichthyostega , which are major examples of a  transitional fossil  of the first  tetrapod  that moved from sea to dry land during the  Late Devonian  period.\nMost of these eleven fossils include impressions of feathers. Because these feathers are of an advanced form ( flight feather s), these fossils are evidence that the evolution of feathers began before the Late Jurassic. The  type specimen  of Archaeopteryx was discovered just two years after  Charles Darwin  published  On the Origin of Species . Archaeopteryx seemed to confirm Darwin's theories and has since become a key piece of evidence for the origin of birds, the transitional fossils debate, and confirmation of  evolution .\nKoinophilia provides simple explanations for the almost universal canalization of sexual creatures into species, the rarity of transitional forms between species (between both extant and fossil species),  evolutionary stasis ,  punctuated equilibria , and the evolution of  cooperation .  Koinophilia might also contribute to the maintenance of  sexual reproduction , preventing its reversion to the much simpler and inherently more advantageous  asexual form of reproduction .\nJean Baptiste Lamarck  used fossils in his arguments for his theory of the transmutation of species in the early 19th century. Fossil finds, and the emerging evidence that life had changed over time, fueled speculation on this topic during the next few decades.  Robert Chambers  used fossil evidence in his 1844 popular science book  Vestiges of the Natural History of Creation , which advocated an evolutionary origin for the cosmos as well as for life on earth. Like Lamarck's theory it maintained that life had progressed from the simple to the complex. These early evolutionary ideas were widely discussed in scientific circles but were not accepted into the scientific mainstream. Many of the critics of transmutational ideas used fossil evidence in their arguments. In the same paper that coined the term dinosaur Richard Owen pointed out that dinosaurs were at least as sophisticated and complex as modern reptiles, which he claimed contradicted transmutational theories.  Hugh Miller  would make a similar argument, pointing out that the fossil fish found in the  Old Red Sandstone  formation were fully as complex as any later fish, and not the primitive forms alleged by Vestiges. While these early evolutionary theories failed to become accepted as mainstream science, the debates over them would help pave the way for the acceptance of Darwin's theory of evolution by natural selection a few years later.\nThe modern evolutionary synthesis is the outcome of a merger of several different scientific fields to produce a more cohesive understanding of evolutionary theory. In the 1920s,  Ronald Fisher ,  J.B.S. Haldane  and  Sewall Wright  combined Darwin's theory of natural selection with statistical models of  Mendelian genetics , founding the discipline of population genetics. In the 1930s and 1940s, efforts were made to merge population genetics, the observations of field naturalists on the distribution of species and sub species, and analysis of the fossil record into a unified explanatory model. The application of the principles of genetics to naturally occurring populations, by scientists such as  Theodosius Dobzhansky  and  Ernst Mayr , advanced the understanding of the processes of evolution. Dobzhansky's 1937 work  Genetics and the Origin of Species  helped bridge the gap between genetics and field  biology  by presenting the mathematical work of the population geneticists in a form more useful to field biologists, and by showing that wild populations had much more genetic variability with geographically isolated subspecies and reservoirs of genetic diversity in recessive genes than the models of the early population geneticists had allowed for. Mayr, on the basis of an understanding of genes and direct observations of evolutionary processes from field research, introduced the biological species concept, which defined a species as a group of interbreeding or potentially interbreeding populations that are reproductively isolated from all other populations. Both Dobzhansky and Mayr emphasised the importance of subspecies reproductively isolated by geographical barriers in the emergence of new species. The paleontologist  George Gaylord Simpson  helped to incorporate  paleontology  with a statistical analysis of the fossil record that showed a pattern consistent with the branching and non-directional pathway of evolution of organisms predicted by the modern synthesis.\nD.E. Nilsson has independently put forth four theorized general stages in the evolution of a vertebrate eye from a patch of photoreceptors. Nilsson and S. Pelger published a classical paper theorizing how many generations are needed to evolve a complex eye in vertebrates. Another researcher, G.C. Young, has used fossil evidence to infer evolutionary conclusions, based on the structure of eye orbits and openings in fossilized skulls for blood vessels and nerves to go through. All this evidence adds to the growing amount of evidence that supports Darwin's theory.\nAdditionally, past macroevolution can be inferred from historical traces. Transitional fossils, for example, provide plausible links between several different groups of organisms, such as  Archaeopteryx  linking  bird s and  dinosaur s, or the  Tiktaalik  linking fish and limbed amphibians. Creationists dispute such examples, from asserting that such fossils are hoaxes or that they belong exclusively to one group or the other, to asserting that there should be far more evidence of obvious transitional species. Darwin himself found the paucity of transitional species to be one of the greatest weaknesses of his theory:\nFollowing Darwin's publication,  Thomas Henry Huxley  used the fossils of  Archaeopteryx  and  Hesperornis  to argue that the  bird s are descendants of the dinosaurs. Thus, a group of  extant  animals could be tied to a fossil group. The resulting description, that of dinosaurs \"giving rise to\" or being \"the ancestors of\" birds, exhibits the essential hallmark of evolutionary taxonomic thinking.\nThe Cambrian explosion has caused much scientific debate. The seemingly rapid appearance of fossils in the 'primordial  strata ' was noted as early as the mid 19th century, and Charles Darwin saw it as one of the main objections that could be made against his theory of evolution by natural selection.\nThe orthogenesis hypothesis had a significant following in the 19th century when a number of evolutionary mechanisms, such as  Lamarckism , were being proposed.   Jean-Baptiste Lamarck  himself accepted the idea, and it had a central role in his theory of inheritance of acquired characteristics, the hypothesized mechanism of which resembled the \"mysterious inner force\" of orthogenesis. Orthogenesis was particularly accepted by paleontologists who saw in their fossils a directional change, and in  invertebrate paleontology  thought there was a gradual and constant directional change.  Those who accepted orthogenesis in this way, however, did not necessarily accept that the mechanism that drove orthogenesis was teleological. In fact,  Darwin  himself rarely used the term \"evolution\" now so commonly used to describe his theory, because in Darwin's time, evolution usually was associated with some sort of progressive process like orthogenesis, and this had been common usage since at least 1647.\nThe modern understanding of evolution began with the 1859 publication of  Charles Darwin 's  On the Origin of Species . In addition,  Gregor Mendel 's work with plants helped to explain the hereditary patterns of  genetics . Fossil discoveries in  paleontology , advances in  population genetics  and a global network of scientific research have provided further details into the mechanisms of evolution. Scientists now have a good understanding of the origin of new species ( speciation ) and have observed the speciation process in the laboratory and in the wild. Evolution is the principal  scientific theory  that  biologist s use to understand life and is used in many disciplines, including  medicine ,  psychology ,  conservation biology ,  anthropology ,  forensics ,  agriculture  and other  social-cultural  applications.\nRecords of fossils discovered so far contain a set of examples of people's understanding of the process of  biological evolution  and help us to answer some questions about evolutionary progression and gives us a unique view into the history of life on earth;  Hoatzin  chicks, for instance, have claws on their wings, and provide evidence that the  ancestors  of birds had  clawed  digits. Moreover, animals like frogs, rabbits, and  lizards  have different forelimbs and in spite of the differences, they have the same set of bones with the same arrangement. These bones have the same organisation in the fossil of their common ancestor (Eusthenopteron). Fossils provide us with evidence about processes that happened on our planet, such as the process of transition from one environment to another. For instance scientists in 1988 discovered a special 370 million year-old fossil which is a transitional form from sea to land animals animals (tetrapods). Transitional forms from one species to another exist, such as one reptile group (Cynodonts) which appeared 260 million years ago as reptiles but quickly changed in time to mammaliforms some 245 million years ago. Evolution and the transition process are very clear in the bone structure of the ear, so all fossils that are recorded up to today provide us with sufficient clarity to understand more about evolutionary history.\nIn Embryos and Ancestors (1930) de Beer stressed the importance of  heterochrony , and especially  paedomorphosis  in evolution. According to his theories, paedomorphosis (the retention of juvenile features in the adult form) is more important in evolution that gerontomorphosis, since juvenile tissues are relatively undifferentiated and capable of further evolution, whereas highly specialised tissues are less able to change. He also conceived the idea of clandestine evolution, which helped to explain the sudden changes in the  fossil record  which were apparently at odds with Darwin's  gradualist  theory of evolution. If a novelty were to evolve gradually in an animal's juvenile form, then its development would not appear in the fossil record at all, but if the species were then to undergo  neoteny  (a form of paedomorphosis in which  sexual maturity  is reached while in an otherwise juvenile form), then the feature would appear suddenly in the fossil record, despite having evolved gradually.\nBy studying the fossil record, paleontologists can tell what forms of life existed during the past at a certain place. They can tell how an extinct organism lived and track how life-forms evolved, or changed, through time. Fossils can also be used to compare the ages of rocks in different areas.\nThe theory of evolution is a scientific theory that can be tested by observations and application of the scientific method. Support for the theory of evolution is based on fossil evidence that has accumulated throughout the geologic history of the Earth. The emergence of antibiotic-resistant bacteria is a contemporary example of the adaptation of life-forms in response to their environment. Darwin cartoon.\nThanks to fossils, there is hard evidence for the theory of plate tectonics (that continents drift slowly over time). We can learn things about a specific organism, too. For example, the teeth of an animal can tell us what it probably ate, the bones from limbs tell us how it moved and even how quickly. Fossils also can show us how organisms evolved over time.\nExplain how fossils can be used to determine the history of changes in environments and organisms. You can look at a fossil to see how they evolved. You can look at the rock layers to see how the environment has changed over time.\nWhat other types of evidence can be used to elucidate the evolutionary relationship of organisms? (i.e. how do we get around some of the problems discussed above?) 1. Examine paleontological (fossil) evidence of ancestors Primitive characteristics should be more common in older fossils\nCuvier established extinctions as a fact that any future scientific theory of life had to explain. In Darwin's theory, species that did not adapt to changing environments or withstand the competition of other species faced annihilation.Darwin did not, however, accept all of Cuvier's ideas on extinctions.y the 1700s, fossils had been inducted into the living world. Instead of being produced by rocks themselves, fossils were recognized as the remains of animals or plants.\nMore fossil evidence has also been found since Darwin's time, although there are still many gaps in the fossil record. The Theory of Evolution Controversy: Today, the Theory of Evolution is often portrayed in the media as a controversial subject.\nIt is in the realm of molecular genetics where we see the most compelling evidence of design on earth â\u0080\u0093 evolution fails Darwinâ\u0080\u0099s test B. The fossil record â\u0080\u0093 testing Darwinâ\u0080\u0099s statement that if one canâ\u0080\u0099t find all of the fine, graduated evolutionary steps in the fossil record, then one can rightly reject the theory 1.\nAnswer: Evolution explains the diversity of life that we see. Explanation: Darwin's Theory of Evolution by Natural Selection is by far the best explanation for the great diversity of life that we see. Before Darwin's time, science knew that life evolved, since they saw the fossils (fossils were a popular spectacle back then) and their resemblance to extant life.\nCORRECTION: It is true that we have learned a lot about evolution since Darwin's time. Today, we understand the genetic basis for the inheritance of traits, we can date many events in the fossil record to within a few hundred thousand years, and we can study how evolution has shaped development at a molecular level.\nEvidence for Evolution. Fossils provide solid evidence that organisms from the past are not the same as those found today; fossils show a progression of evolution. Fossils, along with the comparative anatomy of present-day organisms, constitute the morphological, or anatomical, record.\nFurther important evidence from the fossil record is the absence of transitional forms between species. Darwin was concerned that the thousands of intermediate stages between creatures needed to prove his theory were not in evidence, but he expected they would eventually be found.\nHooke had grasped the cardinal principle of paleontology -- that fossils are not sports of Nature, but remains of once-living organisms that can be used to help us understand the history of life.\nOther relationships can be more controversial. Scientists can use the relationships between fossils of different periods to support the theory of evolution. For example, a paleontologist might study the fossilized remains of prehistoric horses to determine how they relate to modern horses.\nWhy do scientists study dinosaur fossils? Paleontologists are interested in how dinosaurs live for two reasons. First it says something about how the earth has changed and what that change means to life, and secondly â\u0080¦ it helps in the understanding of evolution.\nLet's suppose that we found a primate fossil sample. The sample has 2 legs and arms and some similarities with the humans. Then we make a test to determine its age and after that we must compare our current knowledge with our previous knowledge to understand that primate fossil's group. For example, which groups it's entering into or does it look like more human or monkey? Then if we have a question in our mind about our missing ring of our heritage, we compare tha fossil sample with our knowledge about human species according to some scientific information and complete that missing ring. It's the same process in the plant or animals. We have to compare current information with the fossils like vascular structure or shape of the plants or body shape, reproduction or digestive system,skull structure of the animals etc. These all about that species physical structure. But we can also determine that with DNA material.\nDarwin's theory of evolution by natural selection underlies all modern biology. It enables us to decipher our genes and fight viruses, and to understand Earth's fossil record and rich biodiversity. Simple yet at times controversial, misunderstood and misused for social goals, the theory remains unchallenged as the central concept of biology. Charles Darwin, reluctant revolutionary, profoundly altered our view of the natural world and our place in it. Charles Darwin looked closely at life. The vast and marvelous diversity of life on Earth, from barnacles to butterflies, ostriches to orchids, made him curious.\nHe read the works of Lamarck, his grandfather Erasmus Darwin, Chambers, and others. Darwin did not come up with the theory of evolution.It predates him by centuries. He did propose the theory of natural selection (based on his observations in the Galapagos and his experience breeding pigeons) and compiled enough evidence for evolution to convince nearly the entire scientific community.elevance. Rating Newest Oldest. Best Answer: The inception of Darwin's theory occurred during an intensively busy period which began when Charles Darwin returned from the survey voyage of the Beagle, with his reputation as a fossil collector and geologist already established.\nRelevance. Rating Newest Oldest. Best Answer: The inception of Darwin's theory occurred during an intensively busy period which began when Charles Darwin returned from the survey voyage of the Beagle, with his reputation as a fossil collector and geologist already established.elevance. Rating Newest Oldest. Best Answer: The inception of Darwin's theory occurred during an intensively busy period which began when Charles Darwin returned from the survey voyage of the Beagle, with his reputation as a fossil collector and geologist already established.\nc) how natural selection leads to adaptations; d) emergence of new species; and . e) scientific evidence and explanations for biological evolution. Related SOL. BIO.6 The student will investigate and understand bases for modern classification systems. Key concepts include . a) structural similarities among organisms; b) fossil record interpretation;\nAdaptation and Evolution Strands Life at the Systems and Organisms Level; Interaction of Life forms . Topic. Investigating comparative anatomy, adaptations, and evolution . Primary SOL. BIO.7 The student will investigate and understand how populations change through time. Key concepts include . a) evidence found in fossil records;\nExplanation: Darwin's Theory of Evolution by Natural Selection is by far the best explanation for the great diversity of life that we see. Before Darwin's time, science knew that life evolved, since they saw the fossils (fossils were a popular spectacle back then) and their resemblance to extant life.\nUnderstanding the process of fossilization, and the different means through which it can occur, is used by taphonomists, paleontologists, and geologists to understand the lives of past organisms and the ancient environments in which they lived. Thus, fossilization is much more common in marine environments, which are characterized preferentially by sediment deposition rather than erosion. 2  In continental environments, fossils are most common in fluvial sediments, and rare in soils.\nWhen most people think of fossils they think of dinosaur skeletons and large bones, but there are many different types of fossils to be found. Palaeontologists, people who study fossils, divide them into two major types-body fossils and trace fossils.Body fossils show us what a plant or animal looked like. The first type, body fossils, are the fossilised remains of an animal or plant, like bones, shells and leaves.he second type of fossil records the activity of an animal. Known as trace fossils, these include footprints, trackways, and coprolites (fossil poo!). Footprints and coprolites are trace fossils-they show us how an animal lived. There are lots of different types of fossil.", "key": "56_4", "timestamp": "2020-06-23 21:18:59.143610", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}