{"input_text": "The National Museum of Natural History is a  natural history   museum  administered by the  Smithsonian Institution , located on the  National Mall  in  Washington, D.C. ,  United States . With free admission and open doors 364 days a year, it is the third most visited museum in the world, the most visited natural history museum in the world, and the most visited museum (of any type) in North America. Opened in 1910, the museum on the National Mall was one of the first Smithsonian buildings constructed exclusively to hold the national collections and research facilities. The main building has an overall area of  with  of exhibition and public space and houses over 1,000 employees.\nThe slippers in the MGM auction (size 5C) were bought for $15,000 by a lawyer acting for an unidentified client. This is believed to be the pair on permanent exhibition in the Popular Culture wing of the  National Museum of American History  at the  Smithsonian Institution  in  Washington, D.C. , though the donor insisted on anonymity. Dr.  Brent Glass , the director of the museum, appeared on the January 23, 2008  The Oprah Winfrey Show  with the slippers and informed  Oprah Winfrey  that \"they were worn by Judy Garland during her dance routines on the Yellow Brick Road because there's felt on the bottom of these slippers\". However, according to Rhys Thomas, all but one pair had orange felt on the soles. The Smithsonian pair is undergoing a rapid deterioration from aging and the museum is raising money to fund research on preservation.\nSignificant events from the early 20th century included the  1916  transfer of the fossil collection curated by the  Goucher College  museum to the  US National Museum  at the Smithsonian. Less than a decade later, in  1923 , renowned paleontologist  Charles W. Gilmore  became curator of the museum. In  1942 , near the end of Gilmore's career, a sizable thigh bone belonging to  Astrodon  was discovered during construction at the  McMillan Water Filtration Plant . Just three years later, in  1945 , Gilmore's time as curator of the US National Museum ended. On September 30, 1998 was recognized as the  official dinosaur  of Washington, D.C. On January 28, 2000, the  102nd anniversary of the discovery of and donation to the Smithsonian of Capitalsaurus the site of its discovery was formally named Capitalsaurus Court. On the next anniversary of the discovery mayor  Anthony A. Williams  declared it a local holiday, \"Capitalsaurus Day\".\nMineral collecting  is also a recreational study and collection  hobby , with clubs and societies representing the field. Museums, such as the  Smithsonian   National Museum of Natural History Hall of Geology, Gems, and Minerals , the  Natural History Museum of Los Angeles County , the  Natural History Museum, London , and the private Mim Mineral Museum in  Beirut ,  Lebanon , have popular collections of mineral specimens on permanent display.\nThe National Portrait Gallery is a historic  art museum  located between 7th, 9th, F, and G Streets NW in  Washington, D.C. , in the United States.  Founded in 1962 and opened to the public in 1968, it is part of the  Smithsonian Institution . Its collections focus on images of famous Americans. The museum is housed in the historic  Old Patent Office Building , as is the  Smithsonian American Art Museum . The two museums are the  eponym  for the  Gallery Place   Washington Metro  station, located at the corner of F and 7th Streets NW.\nThe Smithsonian American Art Museum (commonly known as SAAM, and formerly the National Museum of American Art) is a museum in  Washington, D.C. . It has one of the world's largest and most inclusive collections of art, from the colonial period to the present, made in the  United States . The museum has more than 7,000 artists represented in the collection, which contains the largest collection of  New Deal  art; a collection of contemporary craft, American impressionist paintings, and masterpieces from the  Gilded Age ; photography, modern folk art, works by  African American  and  Latino  artists, images of western expansion, and realist art from the first half of the twentieth century. Most exhibitions take place in the museum's main building, the  old Patent Office Building  (shared with the  National Portrait Gallery ),  while craft-focused exhibitions are shown in the museum's  Renwick Gallery .\nThe  Smithsonian Institution  is an educational foundation chartered by Congress in 1846 that maintains most of the nation's official museums and galleries in Washington, D.C. The U.S. government partially funds the Smithsonian and its collections open to the public free of charge. The Smithsonian's locations had a combined total of 30 million visits in 2013. The most visited museum is the  National Museum of Natural History  on the National Mall. Other Smithsonian Institution museums and galleries on the mall are: the  National Air and Space Museum ; the  National Museum of African Art ; the  National Museum of American History ; the  National Museum of the American Indian ; the  Sackler  and  Freer  galleries, which both focus on Asian art and culture; the  Hirshhorn Museum and Sculpture Garden ; the  Arts and Industries Building ; the  S. Dillon Ripley Center ; and the  Smithsonian Institution Building  (also known as \"The Castle\"), which serves as the institution's headquarters.\nFrom 1991 to 2012, Johnson worked at the  Denver Museum of Nature and Science , first as a lead scientist, then the chief curator and vice president of research and collections. In 2010, he led a nine-month excavation of thousands of  Ice Age  animal bones, including  mammoths  and mastodons, in  Snowmass Village, Colorado . In 2012 he was selected to lead the  National Museum of Natural History  in Washington, D.C., one of the  Smithsonian Institution ’s most popular museums on the National Mall.\nThe opening of the zoo marked the first time the Smithsonian enlisted a sponsor for a permanent exhibit in any of their museums. The Smithsonian's popular insect zoo, which annually draws more than one million visitors, is the museum's only exhibit where living creatures can be seen in their natural environments. The insect zoo, located on the second floor of the museum, focuses not only on strange and beautiful insects, but also on the relationships insects have with plants, other animals and humans.\nEstablished in 1912, the First Ladies Collection has been one of the most popular attractions at the  Smithsonian Institution . The original exhibition opened in 1914 and was one of the first at the Smithsonian to prominently feature women. Originally focused largely on fashion, the exhibition now delves deeper into the contributions of first ladies to the presidency and American society. In 2008, \"First Ladies at the Smithsonian\" opened at the  National Museum of American History  as part of its reopening year celebration. That exhibition served as a bridge to the museum's expanded exhibition on first ladies' history that opened on November 19, 2011. \"The First Ladies\" explores the unofficial but important position of first lady and the ways that different women have shaped the role to make their own contributions to the presidential administrations and the nation. The exhibition features 26 dresses and more than 160 other objects, ranging from those of  Martha Washington  to  Michelle Obama , and includes  White House china , personal possessions and other objects from the Smithsonian's unique collection of first ladies' materials.\nThe Freer Gallery of Art and the  Arthur M. Sackler Gallery  form the  Smithsonian Institution 's national museums of  Asian  art in the United States. The Freer and Sackler galleries house the largest Asian art research library in the country and contain  art  from  East Asia ,  South Asia ,  Southeast Asia , the  Islamic world , the  ancient Near East , and  ancient Egypt , as well as a significant collection of  American art . The gallery is located on the south side of the  National Mall  in  Washington, D.C. , contiguous with the Sackler Gallery. The museum is open 364 days a year (being closed on  Christmas ), and is administered by a single staff with the Sackler Gallery. The galleries are among the  most visited art museums in the world .\nAlso located along the Mall is the  Smithsonian Institution , an educational foundation chartered by Congress in 1846 that maintains most of the nation's official museums and galleries in Washington, D.C. The U.S. government partially funds the Smithsonian, thus making its collections open to the public free of charge. The most visited of the Smithsonian museums in 2009 was the  National Museum of Natural History  located on the National Mall. Some of the other Smithsonian Institution museums and galleries located on the mall are: the  National Air and Space Museum  and  Smithsonian Institution Building  (also known as \"The Castle\"), which serves as the institution's headquarters.\nOne of the most respected collections of museums in the world, the Smithsonian Institute is an inspiring attraction for kids, teens and adults. Comprised of 19 different museums, art galleries and research centers, the Smithsonian collection is centered around the National Mall - and admission is always free. The most popular Smithsonian museums include the National Archives, National Zoo, National Museum of Natural History and the National Air and Space Museum.\n1 United Statesâ\u0080º. 2  District of Columbia (DC)â\u0080º. 3  Washington DCâ\u0080º. 4  Washington DC Hotelsâ\u0080º.  Hotels near Smithsonian National Museum of Natural History. 10th Street and Constitution Ave, Washington DC, DC 20560. Read Reviews of Smithsonian National Museum of Natural History. Check In Check Out.\nThe three most popular museums in the area are the Air and Space Museum, the National Museum of American History, and the National Museum of Natural History.\nMore than 65 million years after they went extinct, dinosaurs are about to disappear again â\u0080\u0094 at least from public view in Washington. The Smithsonianâ\u0080\u0099s National Museum of Natural History said Friday that its high-traffic dinosaur hall will close April 28 for a previously announced $48 million makeover. Most of the popular specimens wonâ\u0080\u0099t reappear until 2019, when the Fossil Hall at the worldâ\u0080\u0099s second-most-visited museum is reopened.\nHoused inside a building with symbolic ties to Africans and African-Americans, the Smithsonian National Museum of African American History & Culture is one of the city's newest and most popular museums.\nThe National Mall, Washington D.C. No one can deny this is one of the most popular destinations among all the state landmarks. The National Mall is centered in the United States capitol and hosts museums, monuments and federal buildings.\nVisiting the Smithsonian National Air & Space Museum. Blast off at one of the nationâ\u0080\u0099s most popular museums. Glimpse the 1903 Wright Flyer, run your hands over moon rock and experience the larger-than-life world of aviation and space travel at the National Air and Space Museum.\nPhotograph: ShutterstockNational Air and Space Museum. Washington, DCâ\u0080\u0099s museums rank among the countryâ\u0080\u0099s most prestigious, and include some of the best art museums in Americaâ\u0080\u0094think the National Gallery of Art and the National Museum of African Art.\nWashington, DC's most popular museum - Smithsonian National Air and Space Museum. â\u0080\u009cWashington, DC's most popular museumâ\u0080\u009d Review of Smithsonian National Air and Space Museum. Owner description: The most popular of the Smithsonian museums features the Wright Brothers' 1903 Flyer and Lindbergh's Spirit of St. Louis. One can easily understand why so many people come to the museum. Countless pieces of aviation history are displayed here.\nMost popular Smithsonian museum with 7.4MM visitors/yr. Inside is 45.5 carat Hope Diamond & 65MM yr old Triceratops named â\u0080\u009cHatcherâ\u0080\u009d (for paleontologist who discovered him).\nThe Museum is the largest of the Smithsonian's 19 museums and its Center for Earth and Planetary studies is one of the Institution's nine research centers. More than eight million people a year visit the Museum's two locations, making it the most visited museum in the country.\nThe Newseum is located at 555 Pennsylvania Avenue NW. NATIONAL PORTRAIT GALLERY AND AMERICAN ART MUSEUM: Although it's a Smithsonian Museum, I'm including it on this list for two reasons: A) it stands apart from the cluster of National Mall museums, and B) It's quietly one of the best curated art museums in D.C.\nThe best and most popular exhibit at the National Museum of Natural History is the Fossil Hall. Unfortunately, it is closed for renovations until 2019. (Yikes!) This museum is still a must-visit though thanks to a variety of different artifacts....\nThe Best Museums In D.C. That Aren't On The National Mall. There's no question that D.C. is a museum town. Situated just off the National Mall, dozens of free Smithsonian Museumsâ\u0080\u0094such as the National Air & Space Museum, the Museum of Natural History, and othersâ\u0080\u0094attract millions of visitors to D.C. every year.\nVisit our Museum and other popular Smithsonian destinations on the National Mall in Washington, DC, or visit our Udvar-Hazy Center in nearby Chantilly, VA.\nToday, Lindbergh's Spirit of St. Louis is housed in the Smithsonian National Air and Space Museum in Washington, D.C. It is one of the museum's most popular attractions. The Spirit of St. Louis was designed by Donald Hall under the direct supervision of Charles Lindbergh.", "key": "54_2", "timestamp": "2020-06-23 21:18:59.118309", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}