{"input_text": "Mundus started what he called \"Monster Fishing\" with boats leaving the port at  Lake Montauk .  Mundus with his colorful character became immediately popular.  He further helped his reputation by catching a 4,500 pound  white shark  by harpoon (the figure of 4,500 pounds was estimated without the shark having been weighed).  In 1986 he and Donnie Braddick caught a 3,427-pound great white about 28 miles off Montauk, and only 18 miles from Block Island, which still holds the record, not only for the largest shark, but for the largest fish of any kind ever caught by rod and reel.  The capture of the shark was controversial at the time with some saying the shark was feeding on a whale when caught (which would have negated the so-called \"Official Record\").  The  International Game Fishing Association  ruled that the catch was legitimate based on photographs.\nIn August 2004, a record  mako shark  was caught off the coast of Yarmouth during the Yarmouth Shark Scramble. It weighed  and set a new Canadian record. It is considered one of the largest mako sharks ever caught.\n'Biggest shark caught on camera' nicknamed Deep Blue flashes her razor-sharp teeth in new awe-inspiring video. New footage has emerged of a 20-foot-long great white shark named 'Deep Blue' which is believed to be the largest of its kind in the world. The footage was captured by shark researcher Mauricio Hoyos Padilla off Mexico's Guadalupe Island in 2013, but wasn't released until now because he had only recently found the recording on his computer.\nITS enormous bulk could mean it is mistaken for a prehistoric megalodon, but this is possibly the world's biggest ever great white shark caught on camera. The more than 20 feet (nearly 7m) long sea beast was filmed by cage divers in Mexico. The sheer scale of the monster fish is jaw dropping when seen next to the divers.\nA monster male named Apache hauled up off Mexico is the biggest great white shark yet caught, an expedition team reports. A monster male named Apache hauled up off Mexico is the biggest great white shark yet caught, an expedition team reports.\nA diver has filmed what experts believe is the biggest great white shark ever caught on camera - and she's HUGE. The seven metre-long female, known as Deep Blue, stunned the world last year a video was unveiled showing her dwarfing cage divers. It was filmed off the coast of Guadalupe Island, Mexico.\nQuick Answer. According to Discovery Communications, the biggest great white shark ever reported was 23 feet long. It was caught off the coast of Malta by Alfredo Cutajar in 1987, however there is still some debate as to if the measurement was accurate or not. Continue Reading.\nThe smallest shark, the dwarf shark, is only 25 cm (10 inches) long. The basking shark is the largest shark in Atlantic Canada, routinely reaching lengths of 8-9 metres. The largest confirmed great white shark caught in Canada was more than 5 metres long. It was caught off of PEI in 1983.\nWorldâ\u0080\u0099s Biggest Bull Shark Caught way Inland. Share. Bull sharks, aka Zambezi sharks, are some of the most aggressive of our grey-suited friends and are common in tropical waters all over the world. However, according to South African surf site Wavescape.co.za, the largest ever recorded was recently caught in the temperate Western Cape area of SA.\nThe largest fish ever caught were Sharks, this is because the species can grow to large sizes when compared to other species. So we have created this list excluding the Shark species keeping in mind that not many sport fishing anglers will be targeting sharks for their amusement.\nThe Biggest Fish Ever Caught. This is all about big fish. Many of these big fish are sharks and billfish as well as some other species best released. Many of these records are decades old, during a time when a different awareness and sensibility about releasing fish prevailed.\nThe biggest ever tiger shark is believed to have measured 7.3 metres and weighed 6,860lbs. The shark was caught off the China-Indonesia coast. Worldwide, 1.5bn BCE. The biggest shark ever to have lived is the Carcharodon megalodon.\nUnseen footage of what experts believe is the biggest great white shark ever caught on camera has been released (Photo: Barcroft) â\u0080\u009cAll of a sudden out of the deep blue, there she came. We realised almost immediately that she was very big. â\u0080\u009cShe was very calm and not at all nervous and was circling us.\nAustralia, 1984. According to National Geographic, the biggest great white ever caught was 5.9m long. The female shark was caught at Ledge Point, Australia, just around the peninsula where Joan of Shark was found. Prince Edward Island 1988.\nWe bring you the list of some of the biggest sharks ever caught by man. Check out the full list of 8 specimens below. You also might like to check out some amazing shark jumps pictures. 08. Kevin James Clapson caught this huge 1,785 lb tiger shark off the coast of Ulladulla, Australia on March 28, 2004.\nAnd it would be a shame to let those big sharks caught since 2011, and the people who caught them, go unrecognized. So enjoy two bonus entries in this list of the nine biggest sharks ever caught. Sadly, Shark Week 2011 is drawing to a close. Now, the good news is that we wonâ\u0080\u0099t have to see any more of those dumb commercials with Andy Samberg. (Hey, I love the guy, but the commercials are not funny).\nThree of the Biggest Great Whites Ever Caught (and Reliably Measured) According to shark expert J. E. Randall, the largest white shark reliably measured was 6.0 m (19.7 ft), found near Ledge Point, Western Australia in 1987.\n9 Biggest Sharks Ever Caught. by: Esteban On Saturday, May 31, 2014. Tags: Catch Fish Shark Week Sharks. UPDATE: As sea creatures go, sharks are probably the most famous. One of them starred in Jaws, they have a week named after them, and theyâ\u0080\u0099re just generally the badasses of the ocean.\nBiggest Sharks Ever Caught (8 photos) The list of some of the biggest sharks ever caught by man. Kevin James Clapson caught this huge 1,785 lb tiger shark off the coast of Ulladulla, Australia on March 28, 2004.\n5 of the WORLD'S BIGGEST GREAT WHITE SHARKS ever caught! The video features 5 of the biggest sharks in the world ever caught -- including the biggest shark ever! Great White Shark 5th largest. Date: 1992. Location: South Australia. Caught by: Dion Gilmore. Length: 5.2m (17ft). Weight: 1520kg (3351lb). Additional info: Shark caught during a Daiwa tackle promotion.\nHow big can sharks grow? Sharks come in a range of sizes. The largest shark known is the whale shark, which reaches lengths of 12 metres (almost 40 feet) or more. The smallest shark, the dwarf shark, is only 25 cm (10 inches) long. The basking shark is the largest shark in Atlantic Canada, routinely reaching lengths of 8-9 metres. The largest confirmed great white shark caught in Canada was more than 5 metres long.\nCourtesy IGFA / igfa.org. The biggest fish ever caught and approved as an IGFA world record was a white shark. The giant fish weighed 2,664 pounds! Alfred Dean caught the beastly shark off Ceduna, Australia, on April 21,1959 using a porpoise as bait. Sign up for Sport Fishingâ\u0080\u0099s weekly email and never miss another story.\nNo. 3: 1,708-Pound Greenland Shark. On October 18, 1987, Terje Nordvedt caught the largest Greenland shark ever off Trondheimsfjord, Norway. The shark weighed 1,708 pounds, 9 ounces, taken while using a herring as bait.\nNo. 1: 2,664-Pound White Shark. The biggest fish ever caught and approved as an IGFA world record was a white shark. The giant fish weighed 2,664 pounds! Alfred Dean caught the beastly shark off Ceduna, Australia, on April 21,1959 using a porpoise as bait. Sign up for Sport Fishingâ\u0080\u0099s weekly email and never miss another story.\nSee newly released footage of the biggest shark ever caught on film. This is Deep Blue, a 20-foot-long, 50-year-old Great White shark that experts say is the largest shark ever caught on film. Filmed by Mauricio Hoyos Padilla, the shark was believed to be pregnant when the footage was shot, meaning Deep Blue has created babies that are probably hungry for you. Yes, you specifically.\nThe second biggest fish ever caught on a rod and reel. Before Mundus & Braddickâ\u0080\u0099s huge Great White catch, the previous record for the biggest fish ever caught on a rod and reel happened on April 21, 1959. Thatâ\u0080\u0099s when Alfred Dean caught a 2,664-pound great white shark off the coast of south Australia. Amazingly, it only took Dean 50 minutes to reel in this monster.\nCourtesy IGFA / igfa.org. The biggest fish ever caught and approved as an IGFA world record was a white shark. The giant fish weighed 2,664 pounds! Alfred Dean caught the beastly shark off Ceduna, Australia, on April 21,1959 using a porpoise as bait.\nNo. 1: 2,664-Pound White Shark. The biggest fish ever caught and approved as an IGFA world record was a white shark. The giant fish weighed 2,664 pounds! Alfred Dean caught the beastly shark off Ceduna, Australia, on April 21,1959 using a porpoise as bait.\nThis Could Be The Biggest Shark Ever Caught On Camera. Her name is Deep Blue. She's estimated to be 20 feet long, 5,000 pounds, 50 years old and, in the video above, she's likely pregnant. While your first thought upon viewing this clip might be Ahhh! or Get back in the cage, anonymous diver, Padilla says he had a different reaction.\nA marine scientist is dwarfed by what is being called the biggest shark ever caught on camera in a recent video taken near Mexico's Guadalupe Island. How did this 20-foot-long (6 meters) great white Internet sensation become such a behemoth?\nBy Hideaki Tailor on June 7, 2013. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever. Two videographers from an Outdoor Channel reality show were filming on a boat where fisherman reeled in whatâ\u0080\u0099s believed to be the largest mako shark in recorded history.\nAnswers.comÂ® is making the world better one answer at a time. The biggest shark that was ever caught was the great white shark go to total pro sports.com/9 biggest sharks ever caught.\nWORLDâ\u0080\u0099S BIGGEST SHARK. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever. Two videographers from an Outdoor Channel reality show were filming on a boat where fisherman reeled in whatâ\u0080\u0099s believed to be the largest mako shark in recorded history.\nThe largest weight of a whale shark registered is 47,000 pounds or 21.5 tonnes. From there, weights are smaller and change according with the species. Male bull sharks weight around 200 pounds while female bull sharks can reach up to 290 pounds. The largest tiger shark captured weight was 1,450 pounds. The great white shark weight ranges from 1,500 lb. to 2,500 lb. Links to other pages in this site. Why Do The Great White Sharks Attack Humans? Where Does A Whale Shark Live? What Is A Whale Shark? How Much Do Sharks Weight? How Do Sharks Know When Something Is Food Or Not?\n'Biggest shark caught on camera' nicknamed Deep Blue flashes her razor-sharp teeth in new awe-inspiring video. New footage has emerged of a 20-foot-long great white shark named 'Deep Blue' which is believed to be the largest of its kind in the world.\nThree of the Biggest Great Whites Ever Caught (and Reliably Measured) According to shark expert J. E. Randall, the largest white shark reliably measured was 6.0 m (19.7 ft), found near Ledge Point, Western Australia in 1987. In 1988, David McKendrick of Alberton, Prince Edward Island, caught a female of similar length: 6.1 m (20 ft) long.\nBiologist Mauricio Hoyos Padilla posted a Facebook video of what he claims is the biggest great white shark ever filmed: An approximately 20-foot (6-meter) long female dubbed Deep Blue. According to the California Department of Fish and Game, great white sharks can grow up to 21 feet (6 meters) long. However, most great whites are around 12 to 14 feet (3.6 to 4 meters) long, says Christopher Lowe, a shark biologist at California State University in Long Beach. A 17.9-foot-long (5.5-meter-long) male great white was caught off Guadalupe in fall 2009. (Related: Biggest Great White Shark Caught, Released.) Deep Blue is clearly a very large shark, he says.\nWORLDâ\u0080\u0099S BIGGEST SHARK. By Hideaki Tailor on June 7, 2013. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever.\nWORLDâ\u0080\u0099S BIGGEST SHARK. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever. The catch set the record for the biggest mako shark and is one of the biggest of any catch ever. Two videographers from an Outdoor Channel reality show were filming on a boat where fisherman reeled in whatâ\u0080\u0099s believed to be the largest mako shark in recorded history. The 1,323-pound shark was caught off Californiaâ\u0080\u0099s Huntington Beach on a boat captained by Matt Potter, who has the apt nickname Mako Matt.\n9 Biggest Sharks Ever Caught. UPDATE: As sea creatures go, sharks are probably the most famous. One of them starred in Jaws, they have a week named after them, and theyâ\u0080\u0099re just generally the badasses of the ocean. So catching an especially big one is pretty much the highest honor for a fisherman. And it would be a shame to let those big sharks caught since 2011, and the people who caught them, go unrecognized. So enjoy two bonus entries in this list of the nine biggest sharks ever caught. Sadly, Shark Week 2011 is drawing to a close. Now, the good news is that we wonâ\u0080\u0099t have to see any more of those dumb commercials with Andy Samberg.\nWhat's the largest ever great white shark to be recorded? On average, female great whites are 4.6 to 4.9m long, although the male sharks don't grow as big, measuring up at around 3.4 to 4.0m. Alf Dean caught the largest great white recorded by the International Game Fish Association in the south Australian waters in 1959. The sea predator weighed a staggering 1,208 kg (2,663 lb). It's believed that anglers have since caught bigger sharks, but these have not been officially confirmed.\nThe biggest man-eating shark in the world was caught fairly recently off Mexico's Guadalupe Island and is said to be the biggest great white shark ever caught. This giant shark was measured at 17.9 feet long and broke the previous record of 16.8 set several years ago.\nAnd it would be a shame to let those big sharks caught since 2011, and the people who caught them, go unrecognized. So enjoy two bonus entries in this list of the nine biggest sharks ever caught. Sadly, Shark Week 2011 is drawing to a close.", "key": "32_5", "timestamp": "2020-06-23 21:18:58.986046", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}