{"input_text": "Cervical spine trauma is most common in sports and activities involving contact and collision, particularly American football,  rugby ,  ice hockey ,  gymnastics ,  skiing ,  wrestling , and  diving . A 2005 report by the National Center for Catastrophic Sport Injury Research in the United States stated that sports requiring attention for potential catastrophic injuries are American football, ice hockey,  baseball , wrestling, gymnastics, and  track and field .\nTrauma  is the most frequent cause of peripheral nerve lesions. There are two classifications of trauma which include civilian trauma and military trauma. Civilian trauma is most commonly caused by  motor vehicle accidents  but also by lacerations caused by glass, knives, fans, saw blades or fractures and occasionally  sports injuries . Of the civilian injuries, stretch injuries are the most common types and are considered to be a closed injury, where the tissue is unexposed. Stretch injures are commonly the result of  dislocation , such as a  shoulder dislocation  that stretches nerves. Opposite of civilian trauma, there is military trauma which most commonly results in open injuries from blasts often by bombs or  improvised explosive devices . Other mechanisms of injury are less common but include  ischemia ,  thermal ,  electric shock ,  radiation ,  adverse reactions to certain chemotherapy medications , percussion and vibration.\nHamish and Andy decided to compete in 24 events throughout the weekend of 6 & 7 March. They set rules that they can complete no less than 51 percent of a sport before moving on to the next, in order to have a chance at influence the outcome of the game and only compete in official sanctioned leagues or competitions of the relevant sports. The Bi-Bi-Tri-Bi-athlon was held throughout the country. Originally planned for the weekend of 6 and 7 March 2010, on 2 March Hamish and Andy were training with coach  Shane Warne  when Andy split his chin and knocked his two front teeth out whilst playing ice hockey, after which it was announced that the event would move to the weekend of 13 & 14 March due to the injury. To prepare for the event, Hamish had a full body wax and added a new Olympic rings tattoo to his arm. They completed the event on Sunday evening the 14th with a final tally of nine wins, one draw and fourteen losses.\nFootball is a full-contact sport, and injuries are relatively common. Most injuries occur during training sessions, particularly ones that involve contact between players. To try to prevent injuries, players are required to wear a set of equipment. At a minimum players must wear a  football helmet  and a set of  shoulder pads , but individual leagues may require additional padding such as thigh pads and guards, knee pads, chest protectors, and  mouthguard s. Most injuries occur in the lower extremities, particularly in the knee, but a significant number also affect the upper extremities. The most common types of injuries are  strains ,  sprain s,  bruise s, fractures,  dislocations , and  concussions . Repeated concussions can increase a person's risk in later life for  chronic traumatic encephalopathy  and mental health issues such as  dementia ,  Parkinson's disease , and  depression . Concussions are often caused by helmet-to-helmet or upper-body contact between opposing players, although helmets have prevented more serious injuries such as  skull fracture s. Various programs are aiming to reduce concussions by reducing the frequency of helmet-to-helmet hits;  USA Football 's \"Heads Up Football\" program is aiming to reduce concussions in youth football by teaching coaches and players about the signs of a concussion, the proper way to wear football equipment and ensure it fits, and proper tackling methods that avoid helmet-to-helmet contact. However, a study in the Orthopaedic Journal of Sports Medicine found that Heads Up Football was ineffective.\nIn addition to sports injury management, the center also provides a comprehensive Sports Performance Program that is individualized to each athlete, concentrating on achieving optimal athletic performance while preventing injury. The program usually begins with advanced neuro-musculoskeletal assessment in the center’s Neuromuscular Research Laboratory. Specific components of the program may include strengthening and conditioning, improving speed, agility and joint stability, identifying and managing any potential areas of weakness, injury prevention, sports massage therapy and nutrition counseling as well as sport-specific skills training. The Sports Performance Program serves a  daily clientele with individualized goals for personal fitness and athletic performance ranging from world-famous elite and professional athletes to nationally known college athletes to local high school and recreational athletes. The Center also provides all of its services to many non-athletes with other types of musculoskeletal injuries related to physical activity.\nHead injuries  in sports of any level (junior, amateur, professional) are the most dangerous and sickening kind of injuries that can occur in sport, and are becoming more common in  Australian sport .  Concussion s are the most common side effect of a head injury and are defined as \"temporary unconsciousness or confusion and other symptoms caused by a blow to the head.\" A concussion also falls under the category of Traumatic Brain Injury (TBI). Especially in contact sports like  Australian rules football  and  Rugby  issues with concussions are prevalent, and methods to deal with, prevent and treat concussions are continuously being updated and researched to deal with the issue. Concussions pose a serious threat to the patients mental and physical health, as well as their playing career, and can result in lasting brain damage especially if left untreated. The signs that a player may have a concussion are: loss of consciousness or non-responsive, balance problems (unsteady on feet, poor co-ordination), a dazed, blank or vacant look and/or confused and not aware of their surroundings. Of course the signs are only relevant after the player experiences a blow to the head.\nBlunt injuries to the kidney from helmets, shoulder pads, and knees are described in football, and in soccer, martial arts, and all-terrain vehicle crashes. A literature review of peer-reviewed articles in May 2009 demonstrated that urogenital injuries are uncommon in team and individual sports, and that most of them are low-grade injuries, cycling being the most commonly associated, followed by winter sports, horse riding and contact/collision sports.\nHorseback riding is one of the most dangerous sports, especially in relation to head injury.  Statistics from the United States, for example, indicate that about 30 million people ride horses annually. On average, about 67,000 people are admitted to the hospital each year from injuries sustained while working with horses.  15,000 of those admittances are from traumatic brain injuries.  Of those, about 60 die each year from their brain injuries.  Studies have found horseback riding to be more dangerous than several sports, including skiing, auto racing, and football.  Horseback riding has a higher hospital admittance rate per hours of riding than motorcycle racing, at 0.49 per thousand hours of riding and 0.14 accidents per thousand hours, respectively.\nTraumatic injuries  account for most injuries in contact sports such as  ice hockey ,  association football ,  rugby league ,  rugby union ,  Australian rules football ,  Gaelic football  and  American  and  Canadian football  because of the dynamic and high collision nature of these sports.  Collisions with the ground, objects, and other players are common, and unexpected dynamic forces on limbs and joints can cause injury.\nSports injuries  are often the result of overuse or trauma to a part of the body.  An issue unique to youth athletics is that the participants’ bones are still growing, making them especially at risk for injury. Around 8,000 children are rushed to the emergency room daily because of sports injuries. High school athletes suffer approximately 715,000 injuries annually. In  American football , for instance, five times as many  catastrophic injuries  happen in high school as in  college-level competition . Injuries include heat illness and dehydration, concussions, and trauma-related deaths.  Heat illnesses are a rising concern in youth athletics. These illnesses include  heat syncope ,  muscle cramps ,  heat exhaustion ,  heat stroke  and  exertional hyponatremia .  Each year, high school athletes sustain 300,000 head injuries, of which 90% are concussions. By the start of high school, 53% of athletes will have already suffered a concussion, but fewer than 50% of them say anything because they are concerned they will be removed from play. Ice hockey, soccer, lacrosse, wrestling and basketball have a high risk of concussion, with football carrying the most risk. A history of concussion in a football player can contribute to sports-related sudden death.\nThe rate of injury to paintball participants has been estimated as 45 injuries per 100,000 participants per year.Research published by the Minnesota Paintball Association has argued that paintball is one of the statistically safest sports to participate in, with 20 injuries per 100,000 players annually, and these injuries tend to be incidental to outdoor physical activity (e.g. trip-and-fall). A 2003 study of the 24 patients with modern sports eye injuries presenting to the eye emergency department of Porto São João Hospital between April 1992 and March 2002 included five paintball eye injuries. Furthermore, a one-year study undertaken by the Eye Emergency Department, Massachusetts Eye and Ear Infirmary in  Boston  has shown that most sports eye injuries are caused by  basketball ,  baseball ,  hockey , and  racquetball . Another analysis concluded that eye injuries incurred from paintball were in settings where protective equipment such as masks were not enforced, or were removed by the player.Eye injuries can occur when protective equipment is not properly used and such injuries often cause devastating  visual loss . For safety, most regulated paintball fields strictly enforce a 'masks-on' policy, and most eject players who consistently disobey.\nAlso contraindicated are activities with a high likelihood of trauma, such as  motorcycling  and  skateboarding . Popular sports with very high rates of physical contact and injuries such as  American football ,  hockey ,  boxing ,  wrestling , and  rugby  should be avoided by people with haemophilia. Other active sports like  soccer ,  baseball , and  basketball  also have a high rate of injuries, but have overall less contact and should be undertaken cautiously and only in consultation with a doctor.\nFootball and ice hockey were the organized sports with the most concussion injuries, and snow skiing, bicycling, and playground injuries accounted for the most concussions occurring from non-team-related activities.\nShoulder injuries, including dislocations, sprains and strains, make up 20% of all sports injuries. Shoulder injuries are caused by overuse. Sports that require overhead movement, like tennis, swimming, weightlifting, baseball, basketball and volleyball, are the most common culprits. Shoulder injuries should be treated with rest, ice, and anti-inflammatory medication.\nNumber 2: Shoulder Injury. About 20% of sports injuries involve the shoulder, including dislocations, sprains and strains. Shoulder injuries are most common in tennis, swimming, weightlifting, baseball, and volleyball â\u0080\u0094 basically, any sport that involves a lot of overhead movement.\nBy far, the most common injuries are sprains and strains. Obviously, some sports are more dangerous than others. For example, contact sports such as football can be expected to result in a higher number of injuries than a noncontact sport such as swimming.\nAfter a sedentary work week, end-zone catches and 36-hole weekends can take their toll in common sports injuries. The seven most common sports injuries are: Ankle sprain; Groin pull; Hamstring strain; Shin splints; Knee injury: ACL tear\nA strain is an injury of a muscle and/or tendon. Tendons (fibrous cords of tissue that attach muscles to bone). Sprains and strains are among the most common injuries in sports, professional, amateur athletes and the general public. A strain is when a muscle becomes overstretched and tears. 2  This painful injury, also called a pulled muscle, can be caused by an accident, improper use of a muscle, or overuse of a muscle. 3  Frequently occur in racquet, throwing, and contact sports. 4  Shoulder strain.\nResolving Groin Injuries. Groin injuries are a common athletic injury in both contact and non-contact sports. Injuries to the groin can occur from direct trauma in sports such ice hockey, basketball, football, rugby, and in non-contact sports such as gymnastics. In hockey, 10% of the injuries that occur each year are groin injuries.\nThe Most Dangerous Sports. While other sports, such as ice hockey and lacrosse have spectacular body-to-body contact and collisions during play, football still has the highest injury rate with 36 injuries per 1,000 male athletes. In addition to the high number of collisions in football, it also has the highest number of knee and ankle injuries.\nHamstring injuries are one of the most common strains to affect athletes and the most common type of strain to affect the lower extremity. Hamstring strains can also be one of the most disabling injuries to the lower extremity.These strains are most common amongst athletes that participate in sports that involve a lot of acceleration, deceleration, kicking, jumping, cutting, and pivoting. - sports such as soccer, rugby, football, and raquet sports.amstring strains can also be one of the most disabling injuries to the lower extremity. These strains are most common amongst athletes that participate in sports that involve a lot of acceleration, deceleration, kicking, jumping, cutting, and pivoting. - sports such as soccer, rugby, football, and raquet sports.\nCauses. Dislocated joints are caused by injury to the joints. The most common type of injuries responsible for dislocated joints are sports-related injuries. Contact sports, such as football and hockey, commonly cause joint dislocations, as do sports that involve potential falls, such as gymnastics and volleyball.he most common type of injuries responsible for dislocated joints are sports-related injuries. Contact sports, such as football and hockey, commonly cause joint dislocations, as do sports that involve potential falls, such as gymnastics and volleyball.\nSports and recreational activities can be classified as either team activities or individual activities. 1  Team Activities. Basketball has the highest percentage of disabling injuries among team sports. 2  Individual Activities. Swimming, boating and gun handling have the highest potential for fatal injury.\nPlayground, sports, and bicycle-related injuries occur most often among children between ages 5 and 14 years old. The highest rates of injury occur in sports that involve contact and collisions. More severe injuries occur during individual sports and recreational activities. Most organized sports-related injuries (62 percent) occur during practice. Types of sports and recreational activities. Consider these estimated injury statistics for 2009 from the Consumer Product Safety Commission: Basketball.\nSports and recreational activities can be classified as either team activities or individual activities. Team Activities. Basketball has the highest percentage of disabling injuries among team sports.\nEach year, hospital emergency rooms see more than 95,000 baseball-related injuries. Many consist of minor sprains or muscle strain, but the most serious injuries come from getting hit with a baseball or a baseball bat, particularly on the head, eyes or chest.Baseball leads the way in sports injuries to the eyes.any consist of minor sprains or muscle strain, but the most serious injuries come from getting hit with a baseball or a baseball bat, particularly on the head, eyes or chest. Baseball leads the way in sports injuries to the eyes.\nBy far, the most common injuries are sprains and strains. Obviously, some sports are more dangerous than others. For example, contact sports such as football can be expected to result in a higher number of injuries than a noncontact sport such as swimming.However, all types of sports have a potential for injury, whether from the trauma of contact with other players or from overuse or misuse of a body part.he highest rates of injury occur in sports that involve contact and collisions. More severe injuries occur during individual sports and recreational activities. Most organized sports-related injuries (62 percent) occur during practice.\nInjuries can also occur when a person is not properly conditioned to play the sport, such as not warming up or stretching muscles beforehand. 5 of the most common sports related injuries are: 1) Strains and Sprains.) Fractures. Commonly referred to as a broken bone, fractures are a fairly common sports injury caused by a one-time injury to the bone (an acute fracture). Repeated stress on a bone over time (a stress fracture) can also occur. Small cracks a complete break will occur with an acute fracture.\nShoulder injuries, including dislocations, sprains and strains, make up 20% of all sports injuries. Shoulder injuries are caused by overuse. Sports that require overhead movement, like tennis, swimming, weightlifting, baseball, basketball and volleyball, are the most common culprits. Shoulder injuries should be treated with rest, ice, and anti-inflammatory medication. You can prevent shoulder injuries by doing strength-building exercises in the off-season.\nGroin injuries are a common athletic injury in both contact and non-contact sports. Injuries to the groin can occur from direct trauma in sports such ice hockey, basketball, football, rugby, and in non-contact sports such as gymnastics. In hockey, 10% of the injuries that occur each year are groin injuries.ince a groin injury can cover such a large anatomical region it can involve muscles, tendons, ligaments, joints, connective tissue (fascia), neurological, circulatory structures and even internal organs in the lower abdomen.\nMost Hazardous Sports The numbers show, surprisingly, that of all the activities you might participate in this summer, or throughout the rest of the year, basketball had the highest estimated number of injuries, with more than 529,000 during 2006, followed by bicycling, at over 490,000 and football, at over 460,000.\nOne type of injury that can occur in any sport or physical activity is concussion. This injury represents the most common type of acute brain injury in sports and is most often associated with boxing, football, ice hockey, and martial arts.\nSports Head and Neck Injury Statistics. Not surprisingly, football had the most head and neck injuries of any team sport during the period: The statistics, however, are somewhat misleading. Some sports, like cheerleading, are experiencing more head and neck injuries as stunts have gotten more dangerous. Football, on the other hand, is experiencing fewer serious head injuries: fatalities at all levels peaked at 36 in 1968 (at a time when coaches still taught players to block and tackle leading with their heads, leaving 25-30 players a year paralyzed).\nShoulder injuries, including dislocations, sprains and strains, make up 20% of all sports injuries. Shoulder injuries are caused by overuse. Sports that require overhead movement, like tennis, swimming, weightlifting, baseball, basketball and volleyball, are the most common culprits.\nAchilles tendon tears are the most common ankle tendon injuries, and are most commonly seen secondary to sports-related injury, especially squash and basketball.chilles tendon tears are the most common ankle tendon injuries, and are most commonly seen secondary to sports-related injury, especially squash and basketball.", "key": "59_1", "timestamp": "2020-06-23 21:18:59.176298", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}