{"input_text": "Social conflict  is the struggle between segments of society over valued resources. From the perspective of social conflict theory, in the West, by the nineteenth century, a small population had become capitalists. Capitalists are people who own and operate factories and other businesses in pursuit of profits. In other words, they own virtually all large-scale means of production. However, capitalism turned most other people into industrial workers, whom Marx called proletarians. Proletarians are people who, because of the structure of capitalist economy, must sell their labor for wages. Conflict theories draw attention to power differentials, such as class, gender and race conflict, and contrast historically dominant ideologies. It is therefore a macro level analysis of society that sees society as an arena of inequality that generates conflict and social change. Karl Marx is the father of the  social conflict theory , which is a component of the four major paradigms of sociology. Other important sociologists associated with this theory include Harriet Martineau, Jane Addams and W.E.B. Du Bois. This sociological approach doesn't look at how social structures help society to operate, but instead looks at how \"social patterns\" can cause some people in society to be dominant, and others to be oppressed. However, some criticisms to this theory are that it disregards how shared values and the way in which people rely on each other help to unify the society.\nWhile at Berkeley, Collins encountered many influential sociologists of his day. He worked with  Joseph Ben-David, an Israeli sociologist visiting from Hebrew University, on the sociology of science, which ultimately lead to Collins' publication The Sociology of Philosophies decades later. Collins was introduced to Weberian conflict theory through  Reinhard Bendix , a leading Max Weber scholar. Of his early career, Collins would later say \"I was part of the generation of young sociologists who broke with functionalist theory and moved toward conflict theory.\" He later wrote a chapter for Bendix's work State and Society. This work enabled Collins to later combine this theory with  Erving Goffman 's microsociology, which resulted in Collins' publication Conflict Sociology in 1975 and later, Interaction Ritual Chains in 2004. Goffman was also one of Collins' professors during his time at Berkely. Collins' dissertation advisor was organizational and industrial sociologist  Harold Wilensky . It was titled Education and Employment: Some Determinants of Requirements for Hiring in Various Types of Organizations, and it was later published in 1979 as The Credential society: a historical sociology of education and stratification. While at Berkeley Collins also worked with  Herbert Blumer ,  Philip Selznick , and  Leo Lowenthal .\nSocial conflict theory views society as a constant struggle for power and resources. Many people view substance abuse as a problem of socioeconomic inequality and class conflict. Many people also believe that minorities are charged higher penalties for drug possession. The power struggle is evident in which powder cocaine is a lesser charge then being caught with having street cocaine. In this situation the higher class would be able to buy the powder cocaine and if caught would not get as harsh of a punishment. In cases like this the minority or poor social class would receive the harsher punishment. Since many jails are privately owned the state has to arrest a certain amount of individuals and fill in beds in the prisons. This perceptive illustrates the power struggle individuals face with social economic inequality and how minorities do not have the same power and economic stability that those of the higher class have. The symbolic interaction perceptive views society as the sum of all personal interactions based on their interpretation of meaning. Native Americans use  psilocybin mushrooms , which are commonly known as magic mushrooms. Native Americans use them for religious and spiritual purposes. In this case the drug has religious and therapeutic meaning. The Native American meaning to this drug differs to those of other drugs like marijuana because the drug has spiritual meaning to them. Many countries use drugs like these for purposes that is important to their culture and religion. Symbolic interaction is evident in labeling theory and how individuals subconsciously notice how others see or label them, and their reactions to those labels, and over time this forms the basis of their self-identity and it is through the social process of labeling that we create deviance by assigning shared meanings to other acts. To show the process of becoming deviant a study was taken by Howard Beck called \"Becoming a Marihuanna User\" and began his study with a simple question: are marijuana users different from nonusers? Becker argues that chronic marijuana use results from a process of social learning and before people light up, they must first learn how to smoke. For some, smoking marijuana is fun and enjoyable. The shared meaning is different for everyone. The structural functionalist theory views society as a machine whose parts must be working together. In this case the way the criminal system works with the privately owned jail system. The state has to arrest and incarcerate a certain amount of people in order to fill the space in prisons.\nIn developing his conflict theory, Dahrendorf recognised consensus theory was also necessary to fully reflect society. Consensus theory focuses on the value integration into society, while conflict theory focuses on conflicts of interest and the force that holds society together despite these stresses. In the past, structural functionalism was the commanding theory in sociology, until the conflict theory came along as its major challenger. However, both structural functionalism and the conflict theory have received major criticisms. In fact, Dahrendorf asserted that there has to be consensus to have conflict, as he said that the two were prerequisites for each other. The opposite is also true, he believed –– conflict can result in cohesion and consensus. However, Dahrendorf did not believe the two theories could be combined into one cohesive and comprehensive theory. Instead, Dahrendorf's thesis was \"the differential distribution of authority invariably becomes the determining factor of systematic social conflicts\".\nAs a sociologist, Dahrendorf developed, cultivated, and advanced conflict theory. This new theory is said to have taken place in reaction to structural functionalism and in many ways represents antithesis.  The conflict theory attempts to bring together  structural functionalism  and Marxism. According to Dahrendorf, functionalism is beneficial while trying to understand consensus while the conflict theory is used to understand conflict and coercion. In order to understand structural functionalism, we study three bodies of work: Davis and Moore, Parsons, and Merton. Dahrendorf states that capitalism has undergone major changes since Marx initially developed his theory on  class conflict . This new system of capitalism, which he identifies as postcapitalism, is characterised by diverse class structure and a fluid system of power relations. Thus, it involves a much more complex system of inequality than Marx originally outlined. Dahrendorf contends that postcapitalist society has institutionalised class conflict into state and economic spheres. For example, class conflict has been habituated through unions, collective bargaining, the court system, and legislative debate. In effect, the severe class strife typical of Marx's time is not longer relevant. Dahrendorf's theory often took the opposite view of functionalists.\nThis interaction has been researched by many  psychologist s and linked to many theories related to  group conflict  and  prejudice . The phenomenon is primarily viewed from a  social psychology  standpoint. Two prominent theoretical approaches to the phenomenon of in-group favoritism are  realistic conflict theory  and  social identity theory . Realistic conflict theory proposes that intergroup competition, and sometimes intergroup conflict, arises when two groups have opposing claims to scarce resources. In contrast, social identity theory posits a psychological drive for  positively distinct  social identities as the general root cause of in-group favoring behavior.\nAlthough II theory has been a productive concept for research on communication and social cognition, there is an underlying and yet untested assumption within II theory that the eight attributes are related to all six functions and that II functions can be compared and contrasted in terms of II attributes.  Bodie, Honeycutt, and Vickery (2013) conducted two studies exploring the multidimensional nature of functions and attributes.  The first study revealed both corroborative and counter evidence for II theory.  In line with the internal structure of II theory, it was  found that conflict linkage and catharsis IIs are more negatively valenced than those used for compensation and relational maintenance.  Rehearsal IIs are more likely to be discrepant than all functions except relational maintenance and are the most proactive.  When compared to all other functions, compensatory IIs contain references to more people and were more frequent.  It also appears that compensatory and relational maintenance functions are similar insofar as each is equally directed to others and highly specific, providing support for the role of each in close interpersonal relationships (Honeycutt 2003).  Relational maintenance and conflict IIs were used just as frequently as those for catharsis, and relational maintenance IIs were directed toward others in an equivalent manner as those used for conflict.\nWhile Dahrendorf sought to blend the ideas of structural functionalism and Marxism, conflict theory did little to improve the theory. Conflict theory has many of the same problems of structural functionalism. Conflict theory is also linked to structural functionalism by its ideas about systems, positions, and roles. \"We discuss the criticisms that structural functionalism is ahistorical, unable to deal with conflict and change, highly conservative, preoccupied with societal constraints on actors, accepting of elite legitimations, teleological, and tautological\". In order to respond to the many critiques of structural functionalism, the development of an orientation known as neofunctionalism began to rise. \"Neofunctionalism sought to buttress structural functionalism by synthesizing it with a wide array of other theoretical perspectives.\" Overall, the theory has few similarities with Marxism. Dahrendorf was criticized for being satisfied with having two alternative theories of order and conflict, rather than trying to find a theory that combined the two. In addition the theory takes only a macrosociological perspective. The theory fails to address much of social life.\nHis academic work involved the  analysis of conflict  as a key problem of both society and sociological theory. His 1961 book, Key Problems of Sociological Theory, was his first major work where  conflict  was claimed to be more realistic than the past British  functionalist theories  of social order and system-stability.  He is also known for his studies of  race and ethnic relations . He analyzed the classic tradition of sociology, including  Karl Marx ,  Max Weber ,  Georg Simmel  and  Émile Durkheim  in his book Discovering Sociology (1973).\nSociologists have studied immigration closely in twenty-first century. Compared to the majority of European immigrants entering the Unites States during the early twentieth century, the twenty-first century witnessed the arrival of immigrants predominately from Asia, the Middle East, and Latin America. From 2000 to 2001, sociologists have paid particular attention to the costs and benefits of the new diversified immigration population on American institutions, culture, economic functions, and national security. After the attacks on the World Trade Center on September 11, 2001, sociologists closely analyzed the symbolism of increased anti-immigration rhetoric, directed at Middle Eastern immigrants, stemming from Americans. Structural functionalists theorists have also studied the effects of mass migration—resulting from wars, economic insecurity, and terrorism—on the  social institutions  of host nations, international law, and assimilation rates. Additionally, sociologists exercising  social conflict theory  have analyzed, in particular, labor market conflicts resulting from increased marketplace competition due to the rise in competition between immigrants and native workers for jobs and  social mobility . Because rates of global immigration are continuing to increase, the field of sociology has a particular interest in monitoring twenty-first century immigration as it relates to the foundational theories of symbolic interactionism, social conflict, and structural functionalism.\nSome functionalists actually regard themselves as proponents of  structural functionalism . Structural functionalism is close to humanistic sociology in its understanding of society as shared norms and values. Structural functionalism arose from functionalism in the attempt to explain the dominance of some social groups over others, known as  conflict theory . Conflict theory contradicts functionalism. Structural functionalism is usually associated with the work of  Talcott Parsons . Again humanistic sociology had a role in the decline of structural functionalism. In the humanistic model, there exist dynamical systems of values obtained from social actions in an evolutionary sense.\nA broad historical paradigm in both sociology and  anthropology , functionalism addresses the  social structure  as a whole and in terms of the necessary function of its constituent elements. A common analogy (popularized by  Herbert Spencer ) is to regard  norm s and  institution s as 'organs' that work toward the proper-functioning of the entire 'body' of society. The perspective was implicit in the original sociological positivism of Comte, but was theorized in full by Durkheim, again with respect to observable, structural laws. Functionalism also has an anthropological basis in the work of theorists such as  Marcel Mauss ,  Bronisław Malinowski  and  Alfred Radcliffe-Brown . It is in Radcliffe-Brown's specific usage that the prefix 'structural' emerged. Classical functionalist theory is generally united by its tendency towards biological analogy and notions of  social evolutionism . As  Giddens  states: \"Functionalist thought, from Comte onwards, has looked particularly towards biology as the science providing the closest and most compatible model for social science. Biology has been taken to provide a guide to conceptualizing the structure and the function of social systems and to analyzing processes of evolution via mechanisms of adaptation ... functionalism strongly emphasizes the pre-eminence of the social world over its individual parts (i.e. its constituent actors, human subjects).\"\nThree broad sociological classes exist that describe deviant behavior: namely,  structural functionalism ,  symbolic interaction  and  conflict theory .\nThe contemporary discipline of sociology is theoretically multi-paradigmatic as a result of the contentions of classical social theory. In  Randall Collins ' well-cited survey of sociological theory he retroactively labels various theorists as belonging to four theoretical traditions: Functionalism, Conflict, Symbolic Interactionism, and Utilitarianism. Modern sociological theory descends predominately from functionalist (Durkheim) and conflict-centred (Marx and Weber) accounts of social structure, as well as the symbolic interactionist tradition consisting of micro-scale structural ( Simmel ) and  pragmatist  ( Mead ,  Cooley ) theories of social interaction.  Utilitarianism , also known as Rational Choice or Social Exchange, although often associated with  economics , is an established tradition within sociological theory. Lastly, as argued by  Raewyn Connell , a tradition that is often forgotten is that of  Social Darwinism , which brings the logic of Darwinian biological evolution and applies it to people and societies. This tradition often aligns with classical functionalism. It was the dominant theoretical stance in American sociology from around 1881 to 1915 and is associated with several founders of sociology, primarily  Herbert Spencer ,  Lester F. Ward  and  William Graham Sumner . Contemporary sociological theory retains traces of each of these traditions and they are by no means mutually exclusive.\nThe contemporary discipline of sociology is theoretically multi-paradigmatic. In  Randall Collins ' well-cited survey of sociological theory he retroactively labels various theorists as belonging to four theoretical traditions: Functionalism, Conflict, Symbolic Interactionism, and Utilitarianism. Modern sociological theory descends predominately from functionalist (Durkheim) and conflict-centered (Marx and Weber) accounts of social structure, as well as the symbolic interactionist tradition consisting of micro-scale structural ( Simmel ) and  pragmatist  ( Mead ,  Cooley ) theories of social interaction.  Utilitarianism , also known as Rational Choice or Social Exchange, although often associated with  economics , is an established tradition within sociological theory. Lastly, as argued by  Raewyn Connell , a tradition that is often forgotten is that of  Social Darwinism , which brings the logic of Darwinian biological evolution and applies it to people and societies. This tradition often aligns with classical functionalism and is associated with several founders of sociology, primarily  Herbert Spencer ,  Lester F. Ward  and  William Graham Sumner . Contemporary sociological theory retains traces of each these traditions and they are by no means mutually exclusive.\nConflict theorists, and therefore Dahrendorf, often took the exact opposite view of functionalists.  Whereas functionalists believe that society was oscillating very slightly, if not completely static, conflict theorists said that every society at every point is subject to process of change\". He believes that there is \"dissension and conflict at every point in the social system\" and \"many societal elements as contributing to disintegration and change\". They believe order comes from coercion from those at the top. They believe that power is an important factor in social order. Dahrendorf believes that both conflict theory and consensus theory are necessary because they reflect the two parts of society.\nKarl Marx  rejected Comte's positivism but nevertheless aimed to establish a science of society based on  historical materialism , becoming recognized as a founding figure of sociology posthumously as the term gained broader meaning. Around the start of the 20th century, the first wave of German sociologists, including  Max Weber  and  Georg Simmel , developed sociological  antipositivism . The field may be broadly recognized as an amalgam of three modes of social thought in particular: Durkheimian  positivism  and  structural functionalism ; Marxist  historical materialism  and  conflict theory ; and Weberian  antipositivism  and  verstehen  analysis. American sociology broadly arose on a separate trajectory, with little Marxist influence, an emphasis on rigorous experimental methodology, and a closer association with  pragmatism  and  social psychology . In the 1920s, the  Chicago school  developed  symbolic interactionism . Meanwhile, in the 1930s, the  Frankfurt School  pioneered the idea of  critical theory , an interdisciplinary form of  Marxist sociology  drawing upon thinkers as diverse as  Sigmund Freud  and  Friedrich Nietzsche . Critical theory would take on something of a life of its own after  World War II , influencing  literary criticism  and the  Birmingham School  establishment of  cultural studies .\nIt is simplistic to equate the perspective directly with political  conservatism . The tendency to emphasize \"cohesive systems\", however, leads functionalist theories to be contrasted with \" conflict theories \" which instead emphasize social problems and inequalities.\nFunctionalist theories emphasize \"cohesive systems\" and are often contrasted with \"conflict theories\", which critique the overarching socio-political system or emphasize the inequality between particular groups. The following quotes from Durkheim and Marx epitomize the political, as well as theoretical, disparities, between functionalist and conflict thought respectively:\nFurther criticisms have been levelled at functionalism by proponents of other social theories, particularly  conflict theorists ,  Marxists ,  feminists  and  postmodernists . Conflict theorists criticized functionalism's concept of systems as giving far too much weight to integration and consensus, and neglecting independence and conflict [Holmwood, 2005:100]. Lockwood [in Holmwood, 2005:101], in line with conflict theory, suggested that Parsons' theory missed the concept of system contradiction. He did not account for those parts of the system that might have tendencies to Mal-integration. According to Lockwood, it was these tendencies that come to the surface as opposition and conflict among actors. However Parsons thought that the issues of conflict and cooperation were very much intertwined and sought to account for both in his model [Holmwood, 2005:103]. In this however he was limited by his analysis of an ‘ideal type' of society which was characterized by consensus. Merton, through his critique of functional unity, introduced into functionalism an explicit analysis of tension and conflict. Yet Merton's functionalist explanations of social phenomena continued to rest on the idea that society is primarily co-operative rather than conflicted, which differentiates Merton from conflict theorists.\nConflict theories are perspectives in  sociology  and  social psychology  that emphasize the social, political, or material inequality of a  social group , that critique the broad socio-political system, or that otherwise detract from  structural functionalism  and  ideological   conservatism . Conflict theories draw attention to power differentials, such as  class conflict , and generally contrast historically dominant ideologies. It is therefore a macro level analysis of society.  Karl Marx  is the father of the  social conflict theory , which is a component of the four paradigms of sociology. Certain conflict theories set out to highlight the ideological aspects inherent in traditional thought. Whilst many of these perspectives hold parallels, conflict theory does not refer to a unified school of thought, and should not be confused with, for instance,  peace and conflict studies , or any other specific theory of  social conflict .\nThe dispute of the findings, and subsequently the naming of the discovery, started with the publication of Magendie's paper in the Journal de physiologie expérimentale et de pathologie.  The conflict lasted until Bell's death in 1842.  Some science historians have better resolved to name it after both physicians, giving Bell the honorary first mention, although others have claimed that these are essentially two overlapping discoveries.  Because of the independent findings of both scientists (Bell's claim over the motor function and Magendie's over the sensory function) and the existing conflict between England and France on the political arena of the 19th century (and prior to that), the debate on the Bell–Magendie law became a matter of national pride.  The English medicine professors, especially Bell, and even English politicians rebuked the \"crude methods\" of the French vivisectionist.  English medical staff and faculty were more tuned into seeking anatomical and structural explanations through  dissection s – taking a sort of medical  functionalist  approach. The dispute between the two happened in an era of a more secular approach to scientific discovery;  positivism  had become popular in many sciences. That was at about the same time as the works and theories of  Auguste Comte  were published.<br>On the other hand, Magendie was considering himself in his own words \"a mere scavenger of science trying to do science by collecting bits and pieces of nature's truths\"; he was not after the grand scheme but after the \"inventory of the nuts and bolts of the system\".  The French were also proud with Magendie's many discoveries and the extension of human knowledge in the areas of pathology, physiology and  pharmacology  and stood firmly behind his claim on the matter.  Nevertheless, many Frenchmen (and most of our contemporaries) would have agreed with the English that the vivisections were not for the faint of heart. Until his death in 1842, Bell would write against the methods of Magendie and in his letters and books he would disapprove of the \"protracted cruelty of the dissection experiments\".\nTheories of Education. Historically, American education served both political and economic needs, which dictated the function of education. Today, sociologists and educators debate the function of education. Three main theories represent their views: the functionalist theory, the conflict theory, and the symbolic interactionist theory.\nConflict theories draw attention to power differentials, such as class conflict, and generally contrast historically dominant ideologies. It is therefore a macro level analysis of society. Karl Marx is the father of the social conflict theory, which is a component of the 4 paradigms of sociology.Certain conflict theories set out to highlight the ideological aspects inherent in traditional thought.t is therefore a macro level analysis of society. Karl Marx is the father of the social conflict theory, which is a component of the 4 paradigms of sociology. Certain conflict theories set out to highlight the ideological aspects inherent in traditional thought.\nA third important sociological framework is the conflict theory. Unlike the structural functional theory, which views society as a peaceful unit, conflict theory interprets society as a struggle for power between groups engaging in conflict for limited resources. Karl Marx is the founder of conflict theory.\nConflict theories. Conflict theories are perspectives in sociology that emphasize the social, political, or material inequality of a social group, that critique the broad socio-political system, or that otherwise detract from structural functionalism and ideological conservativism.onflict theories. Conflict theories are perspectives in sociology that emphasize the social, political, or material inequality of a social group, that critique the broad socio-political system, or that otherwise detract from structural functionalism and ideological conservativism.\nConflict theories draw attention to power differentials, such as class conflict, and generally contrast historically dominant ideologies. It is therefore a macro level analysis of society.Karl Marx is the father of the social conflict theory, which is a component of the 4 paradigms of sociology.onflict theory is most commonly associated with Marxism, but as a reaction to functionalism and the positivist method may also be associated with number of other perspectives, including:\nAccording to conflict theory, those with wealth and power try to hold on to it by any means possible, chiefly by suppressing the poor and powerless.onflict theory holds that social order is maintained by domination and power, rather than consensus and conformity.\nCritics also argue that conflict theory does little to explain the causes of deviance. Proponents counter, however, by asserting that the theory does not attempt to delve into etiologies. Instead, the theory does what it claims to do: It discusses the relationships between socialization, social controls, and behavior.\nConflict theory, functionalism and symbolic interactionism are the typical perspectives studied in sociology but postmodern perspectives are challenging this tradition. Postmodernism challenges the basic assumption of positivism, which is that society is ordered and can be empirically understood and measured.\nIn some respects conflict analysis is similar to functionalism [click here to read a short synopis of Durkheim's functionalist theory]. As in the functional perspective, the social world is viewed as a system of parts.\n1 While conflict theory originated from the work of Karl Marx (1818â\u0080\u00931883), there is not singular conflict theory but rather conflict theories. 2  The basic assumption of conflict theory is an individual or group will dominate others and actively avoid being dominated.  Conflict theory grew out of critique of functionalism.\nIn the 1970s, political scientists Gabriel Almond and Bingham Powell introduced a structural-functionalist approach to comparing political systems. They argued that, in order to understand a political system, it is necessary to understand not only its institutions (or structures) but also their respective functions.n the 1960s, functionalism was criticized for being unable to account for social change, or for structural contradictions and conflict (and thus was often called  consensus theory ). Also, it ignores inequalities including race, gender, class, which causes tension and conflict.\nThe Conflict Theory is a macro theory. A Macro theory is a sociological theory designed to study the larger social, global, and societal level of sociological phenomena. This theory was founded by a German philosopher, economist, sociologist, and revolutionary (1818-1883).he next grand theory is called Functionalism or Structural Functionalism. Functionalist theory claims that society is in a state of balance and kept that way through the function of society's component parts. This theory has underpinnings in biological and ecological concepts (see diagram below).\nCONFLICT THEORY is a concept in sociology that emphasizes the political, material or standing of a social group and the socially accepted, perceived norms ascribed to them. Conflict theories highlight contrasting social structures and stratification within historically dominant ideologies.ultural differences such as ethnicity, gender, age, politics and religion are a major components of social structure. Here in America, we live in a pluralistic nation where diversity is prevalent. Every society is built on the bases of what is important for them and the survival of it's members.\nCompare and Contrast the Main Tenet of the Functionalist and Conflict Perspectives. Topic: The conflict perspective views society less as a cohesive system and more as an arena of conflict and power struggles. Compare and... contrast the main tenet of the Functionalist and Conflict Perspectives.\nQuestion 5: Theory Explains. Explain in your own words how either the Structural Functionalist perspective or the Conflict perspective would view the cause of war (any war). Remember that Functionalism focuses on the harmonious operations of all parts of a society in order to assure stability and order. Conflict theory focuses on inequality within a society (principally economic, but also gender and race or ethnic inequality) as the driving force behind social change.\nConflict theory is the second major school of thought in sociology. Like functionalism, it is a macro-level theory, but unlike functionalism, it is centrally concerned with social inequality. Conflict theory emerged from the writings of Karl Marx, and sees social conflict as the basis of society and social change.\nBoth Functionalism and Conflict theory are macro perspectives. They focus on very large aspects of society. The functionalists might explore institutions. The conflict perspective, on the other hand is interested in the relationships that occur between social classes (like the working class and the owning class).\nWe will consider the institution of the family according to the functionalist theory, the conflict theory, and the Interactionist theory. Each of the three sociological theories takes a different view of the social institution of family.\nQuick Answer. The different branches or schools of thought in sociology include functionalism, conflict theory, symbolic interactionism, social exchange theory and formalism. Of these, the three main branches are functionalism, symbolic interactionism and conflict theory. Keep Learning.\nStructural Functionalism Theory. Structural-Functionalism Theory. The structural functional theory sees the family as a social institution that performs certain essential function for society. If these functions are not carried out then the family is said to be dysfunctional.\nThose without resources want to secure them. In some respects conflict analysis is similar to functionalism [click here to read a short synopis of Durkheim's functionalist theory]. As in the functional perspective, the social world is viewed as a system of parts.\nThe three theories of sociology are symbolic interaction theory, conflict theory and functionalist theory. Sociologists analyze social phenomena at different levels and from different perspectives.\nThere are three major sociology theories known as functionalism, conflict theory, and interactionist perspective. Symbolic interactionism is the use of symbols and is face-to-face interaction. Functionalism has to do with relationships between the parts of society and how the aspects of society are adaptive. The last, conflict theory is the competition of scarce resources and how the elite control the poor and week.\nThis theory of groups is opposed to functionalism in which each of these groups would play a specific, set role in society. In functionalism, these groups cooperate to benefit society whereas in conflict theory the groups are in opposition to one another as they seek to better their masters.\nThree theoretical perspectives guide sociological thinking on social problems: functionalist theory, conflict theory, and symbolic interactionist theory. These perspectives look at the same social problems, but they do so in different ways.\nSummarize the most important beliefs and assumptions of functionalism and conflict theory. Summarize the most important beliefs and assumptions of symbolic interactionism and exchange theory. We have talked repeatedly about a sociological perspective, as if all sociologists share the same beliefs on how society works.This implication is misleading.onflict theory. Society is characterized by pervasive inequality based on social class, gender, and other factors. Far-reaching social change is needed to reduce or eliminate social inequality and to create an egalitarian society. Conflict theory is a macro theory.\nIn this regard, conflict theory may be considered a progressive perspective. Whereas the functionalist and conflict perspectives are macro approaches, symbolic interactionism is a micro approach that focuses on the interaction of individuals and on how they interpret their interaction.onflict theory. Society is characterized by pervasive inequality based on social class, gender, and other factors. Far-reaching social change is needed to reduce or eliminate social inequality and to create an egalitarian society. Conflict theory is a macro theory.\nWhat is the 'Conflict Theory'. Conflict theory is a theory propounded by Karl Marx that claims society is in a state of perpetual conflict due to competition for limited resources. It holds that social order is maintained by domination and power, rather than consensus and conformity.\nConflict Theory [edit]. A prominent sociological theory that is often contrasted with structural-functionalism is conflict theory. Conflict theory argues that society is not best understood as a complex system striving for equilibrium but rather as a competition.", "key": "79_8", "timestamp": "2020-06-23 21:18:59.364012", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}