{"input_text": "Thomas Diez (born 2 February 1970) is Professor of Political Science and International Relations at the Institute for Political Science,  University of Tübingen . He was formerly Professor of International Relations Theory in the Department of Political Science and International Studies at the  University of Birmingham , where he was Head of Department from 2005-2008. Diez earned his PhD at the  University of Mannheim . He was formerly a Research Fellow at the  Copenhagen Peace Research Institute  where he worked with  Barry Buzan  and  Ole Waever . He studies  international relations theory ,  European integration  and  conflict transformation  and is best known for his contributions to the debate on the  European Union 's  normative   power . Books he has edited or co-edited include The EU and the Cyprus Conflict: Modern Conflict, Postmodern Union (Manchester University Press, 2002), European Integration Theory (Oxford University Press, 2004, 2009) and The European Union and Border Conflicts (Cambridge University Press, 2008), Cyprus: A Conflict at the Crossroads (Manchester University Press, 2009) and An Introduction to International Relations Theory: Perspectives and Themes (Pearson, 2010).\nMarxist sociology is the study of  sociology  from a  Marxist  perspective. Marxism itself can be recognized as both a  political philosophy  and a  sociology , particularly so far as it attempts to remain  scientific, systematic  and objective rather than purely  normative  and  prescriptive . Marxist sociology is \"a form of  conflict theory  associated with ... Marxism's objective of developing a  positive  ( empirical ) science of  capitalist   society  as part of the mobilization of a revolutionary  working class .\" The  American Sociological Association  has a section dedicated to the issues of Marxist sociology that is \"interested in examining how insights from Marxist  methodology  and Marxist analysis can help explain the complex dynamics of modern society\". Marxist sociology would come to facilitate the developments of  critical theory  and  cultural studies  as loosely distinct disciplines.\nWhile at Berkeley, Collins encountered many influential sociologists of his day. He worked with  Joseph Ben-David, an Israeli sociologist visiting from Hebrew University, on the sociology of science, which ultimately lead to Collins' publication The Sociology of Philosophies decades later. Collins was introduced to Weberian conflict theory through  Reinhard Bendix , a leading Max Weber scholar. Of his early career, Collins would later say \"I was part of the generation of young sociologists who broke with functionalist theory and moved toward conflict theory.\" He later wrote a chapter for Bendix's work State and Society. This work enabled Collins to later combine this theory with  Erving Goffman 's microsociology, which resulted in Collins' publication Conflict Sociology in 1975 and later, Interaction Ritual Chains in 2004. Goffman was also one of Collins' professors during his time at Berkely. Collins' dissertation advisor was organizational and industrial sociologist  Harold Wilensky . It was titled Education and Employment: Some Determinants of Requirements for Hiring in Various Types of Organizations, and it was later published in 1979 as The Credential society: a historical sociology of education and stratification. While at Berkeley Collins also worked with  Herbert Blumer ,  Philip Selznick , and  Leo Lowenthal .\nCulture conflict theory, derived from the pioneering work of sociologist  Thorsten Sellin , emphasizes the role of culturally accepted norms of conduct in the formation of cultural groups and the conflicts which arise through their interaction. Culture conflict theory argues that the group with the most power in any society ensures that their values, traditions and behaviors, which Sellin referred to as \"conduct norms\", are those to which all other members of society are forced to conform, and any actions which conflict with the interests of the dominant group are identified as deviant and/or criminal in nature. Sellin's original ideas continued to be developed throughout the 20th century, most notably by George Vold in the 1950s and Austin Turk in the 1960s, and continue to influence the contemporary debate. The recent work of Gregory J. Howard, Joshua D. Freilich and Graeme R. Newman applies culture conflict theory to the issue of immigrant and minority crime around the world. According to their research, while culturally homogeneous groups experience little to no cultural conflict, as all the members share the same set of \"conduct norms\", culturally heterogeneous groups, such as modern industrial nations with large immigrant populations, display heightened competition between sets of cultural norms which, in turn, leads to an increase in violence and crime. Societies which have high levels of cultural diversity in their population, it is claimed, are more likely to have higher rates of violent crime.\nSeveral theories explain different aspects of the relationship between the work and family life. Boundary theory and border theory are the two fundamental theories that researchers have used to study these role conflicts. Other theories are built on the foundations of these two theories.\nIn ''The Behavior of Law, published in 1976,  Donald Black  introduced the first example of pure sociology—a general theory of law, or governmental social control.  This theory seeks to explain variation in law, and one aspect of  legal variation  is the amount of law attracted to a case of conflict.  A conflict is a situation where one person has a grievance against another, such as where an assault has occurred or a contract has been broken, and the offended parties may or may not appeal to the police or to the civil courts to resolve it.  Cases may attract law or not, then, and when they do attract law, there may be more or less of it.  When the police make an arrest in an assault case, for instance, there is more law when there is merely a call to the police, and when someone is convicted and sentenced there is more law than when there is merely an arrest.  The pure sociology of law explains this variation by identifying a number of sociological variables that are associated with variation in the quantity of law.  These include various forms of social status (such as wealth, integration, culture, conventionality, organization, and respectability) as well as various forms of social distance (such as relational distance and cultural distance).  These are aspects of the social structures of cases, then, and so cases where the disputants are both high in status have different social structures—and are handled differently—than cases involving low-status disputants.  Whether the disputants are socially close to or distant from one another also determines the amount of law the case attracts.  For example, one of the theory’s predictions is that within a society, law varies directly with relational distance.  Relational distance refers to the amount and intensity of interaction between the parties, so the theory predicts that there is more law in conflicts between strangers than in those between intimates.  This aspect of the theory explains numerous facts, such as why those who kill strangers are punished more severely than those who kill intimates and why women who are raped by strangers are more likely to report it to the police.\nIn developing his conflict theory, Dahrendorf recognised consensus theory was also necessary to fully reflect society. Consensus theory focuses on the value integration into society, while conflict theory focuses on conflicts of interest and the force that holds society together despite these stresses. In the past, structural functionalism was the commanding theory in sociology, until the conflict theory came along as its major challenger. However, both structural functionalism and the conflict theory have received major criticisms. In fact, Dahrendorf asserted that there has to be consensus to have conflict, as he said that the two were prerequisites for each other. The opposite is also true, he believed –– conflict can result in cohesion and consensus. However, Dahrendorf did not believe the two theories could be combined into one cohesive and comprehensive theory. Instead, Dahrendorf's thesis was \"the differential distribution of authority invariably becomes the determining factor of systematic social conflicts\".\nAs a sociologist, Dahrendorf developed, cultivated, and advanced conflict theory. This new theory is said to have taken place in reaction to structural functionalism and in many ways represents antithesis.  The conflict theory attempts to bring together  structural functionalism  and Marxism. According to Dahrendorf, functionalism is beneficial while trying to understand consensus while the conflict theory is used to understand conflict and coercion. In order to understand structural functionalism, we study three bodies of work: Davis and Moore, Parsons, and Merton. Dahrendorf states that capitalism has undergone major changes since Marx initially developed his theory on  class conflict . This new system of capitalism, which he identifies as postcapitalism, is characterised by diverse class structure and a fluid system of power relations. Thus, it involves a much more complex system of inequality than Marx originally outlined. Dahrendorf contends that postcapitalist society has institutionalised class conflict into state and economic spheres. For example, class conflict has been habituated through unions, collective bargaining, the court system, and legislative debate. In effect, the severe class strife typical of Marx's time is not longer relevant. Dahrendorf's theory often took the opposite view of functionalists.\nDrawing on aspects of both Marxism and structural functionalists to form his own beliefs, Dahrendorf highlighted the changes that have occurred in modern society. Dahrendorf believed in two approaches to society, Utopian and Rationalist.  Utopian being the balance of values and solidity and Rationalist being dissension and disagreement.  While he believes that both are social perspectives, the Utopian approach is most apparent in modern-day society, leaving Dahrendorf to create a balance between the two views. Dahrendorf discusses literary utopias to show that the structural-functionalists idea of the social system is utopians in itself because it possess all the necessary characteristics. Specifically, with democracy came voting for political parties, and increased social mobility. He believes that the struggle for authority creates conflict. Furthermore, he believes that traditional Marxism ignores consensus and integration in modern social structures. Dahrendorf's theory defined class not in terms of wealth like Marx, but by levels of authority. Dahrendorf combines elements from both of these perspectives to develop his own theory about class conflict in  postcapitalist  society.\nModern political science pioneer  Seymour Martin Lipset  argues that Marshall proposes a model of social science based on the  middle range analysis  of social structures and institutions, as opposed to grand theories of the purposes of development and modernisation, which were criticised by modern sociologists such as  Robert K. Merton  for being too speculative to provide valid results. By using such a middle range approach, Marshall and his mentor  L. T. Hobhouse  believed that rigid class distinctions could be dissolved and middle class citizenship generalised through a careful understanding of social mechanisms. He also believed this would allow sociology to become an international discipline, helping \"to increase mutual understanding between cultures\" and further international co-operation.  While employing some concepts from Marxist  conflict theory , such as social class and revolution, Marshall's analyses are based on  functionalist  concerns with phenomena such as \"consensus, the normal, and anomie; co-operation and conflict; structure and growth,\" within self-contained systems. Rather than studying \"society,\" which may include non-systemic elements, Marshall argues that the task of sociology is:\nMosca defined modern elites in term of their superior organizational skills.  These organizational skills were especially useful in gaining political power in modern  bureaucratic  society. Nevertheless, Mosca's theory was more liberal than the elitist theory of, for example,  Pareto , since in Mosca's conception, elites are not hereditary in nature and peoples from all classes of society can theoretically become elite: when this happens, the reproduction of power is defined as democratic; whereas, when the member's recycle remains inside the elite, the reproduction of power is defined as aristocratic. He also adhered to the concept of the circulation of elites, which is a dialectical theory of constant competition between elites, with one elite group replacing another repeatedly over time. That concept came from his materialist idea of history as a conflict between classes ( Marx ), from the conflicted nature of politic considered as a fight for acquisition and department of power ( Machiavelli ) and finally from the non-egalitarian and hierarchical structure of society. Unlike Marx, Mosca has not a linear concept of time, but a circular one, as in classical political theory, which consists in a perpetual condition of conflict and recycle of the elite. For Mosca, the dichotomous structure of society wouldn't be solved by the revolution.\nWilliams and O’Reilly (1998), separates task and emotional conflict by discussing the commonly used information and decision-making theory and social categorization theory. The information and decision-making theory predicts that availability of information due to diverse backgrounds will increase task conflict and produce new perspectives and ideas. The social categorization theory predicts that emotional conflict will stem from in-group/out-group effects due to diversity separating a team into smaller groups of similar people. Group members will attempt to make their in-group look better at the expense of the out-group, and similar group members will tend to like each other whereas dissimilar group members will tend not to like each other. Job stress that is likely to come from emotional conflict also had a detrimental on performance.\nIn sociology, conflict theory states that society or an organization functions so that each individual participant and its groups struggle to maximize their benefits, which inevitably contributes to social change such as political changes and revolutions. Deviant behaviors are actions that do not go along with the social institutions as what cause deviance. The institution's ability to change norms, wealth or status comes into conflict with the individual. The legal rights of poor folks might be ignored, middle class are also accept; they side with the elites rather than the poor, thinking they might rise to the top by supporting the status quo. Conflict theory is based upon the view that the fundamental causes of crime are the social and economic forces operating within society. However, it explains white-collar crime less well.\nMany Marxist writers have  the theory of the capitalist state in their arguments. For example,  Steven Spitzer  utilized the theory of bourgeois control over social junk and social dynamite;  George Rusche  was known to present analysis of different punishments correlated to the social capacity and infrastructure for labor. He theorized that throughout history, when more labor is needed, the severity of punishments decreases and the tolerance for deviant behavior increases.  Jock Young , another Marxist writer, presented the idea that the modern world did not approve of diversity, but was not afraid of social conflict. The late modern world, however, is very tolerant of diversity. But is extremely afraid of social conflicts, which is an explanation given for the political correctness movement. The late modern society easily accepts difference, but it labels those that it does not want as deviant and relentlessly punishes and persecutes.\nBaumeister wrote a paper on the  need to belong  theory with  Mark Leary  in 1995. This theory seeks to  show that humans have a natural need to belong with others. Baumeister and Leary suggest that it is in our nature, as human beings, to push to form relationships. This push is what helps to distinguish it as a need instead of a desire. In addition to the drive for attachment, people also struggle to avoid the disintegration of these relationships. As part of this theory, a lack of belonging would have a long term, negative impact on mood and health, and those who do not meet their belonging needs may suffer from behavioral and psychological issues.Need to belong theory has two necessary parts.  The first is that there is frequent contact between the people involved in the attachment that is typically conflict free. Additionally, the notion of an ongoing and continued relationship between them is essential.\nThere are many works that rebut the idea of greed vs. grievance. Authors set up alternative ideas that need to be introduced and explored. Even the staunchest proponents of the Greed vs. Grievance theory believe that other outside forces (beyond the greed and/or grievance) can have an effect on conflict, which makes the critiques all the more vital in understanding the theory itself. One of the most prevalent authors in rebutting greed vs. grievance is author David Keen, in his book Complex Emergencies. David Keen, a professor at the Development Studies Institute at the London School of Economics, has several innovative and new ideas regarding the ideas of war. His work is considered by many to be one of the leading arguments against greed vs. grievance theory. His ideas look into the specifics of complex emergencies, which is a term officially defined by the InterAgency Standing Committee (IASC) as:\"A multifaceted humanitarian crisis in a country, region or society where there is a total or considerable breakdown of authority resulting from internal or external conflict and which requires a multi-sectoral, international response that goes beyond the mandate or capacity of any single agency and/or the ongoing UN country program. Such emergencies have, in particular, a devastating effect on children and women and call for a complex range of responses.\"Keen discusses how a conflict can never be simply a greed scenario. His definition of a \"complex emergency\" demonstrates this broader term and all of its various implications. In his book, Keen goes into several different conflict scenarios, such as 'war', 'famine', and 'information', and then sets up an argument against the idea of greed. He believes that although a conflict, whether it be the 'War on Terror' or the conflict in Sierra Leone, may be centered around some concept of greed or grievance, this can never solely explain a conflict. Although seemingly obvious, Keen looks to demonstrate that, \"the aims in a war are complex\". He does not believe that greed and grievance can be examined separately, but rather that they are partner terms that must be implemented in a complementary way. For example, when Keen discusses the conflict in Sudan, he says, \" the grievances of northern pastoralists were useful for a government trying to get its hands on oil in areas that famine and militia attacks helped to depopulate; meanwhile, the 'greed' of the Arab militias themselves (for labour, cattle and land) was itself intimately linked to their grievances\". He makes it clear that it is necessary to first spend ample time defining the type of conflict at hand because the differences between genocide and a civil war are substantial, so it is necessary to diagnose the incentives and solutions for the conflict with a mix of multiple theories. Keen specifically critiques Paul Collier, a leading expert in greed vs. grievance theory, by claiming that Collier became too comfortable with \"numbers\", and needed to rely more on the actual opinions of people involved in conflicts. He spoke of Collier's work and said, \"This is where econometrics tips over into arrogance and starts closing down the possibility of a genuine understanding of conflicts or, by extension, of a political settlement that addresses underlying grievances\". He doesn't believe that it can be dismissed so easily. He was documented saying, \"It also annoys me that a lot of the 'scientific air' of the Collier work is quite bogus as the selection of proxies is so arbitrary\", which demonstrated a distinct attack on Collier's work, which emphasizes quantitative data.\nCoser was the first sociologist to try to bring together  structural functionalism  and  conflict theory ; his work was focused on finding the functions of  social conflict . Coser argued - with  Georg Simmel  - that conflict might serve to solidify a loosely structured group. In a  society  that seems to be disintegrating, conflict with another society, inter-group conflict, may restore the integrative core.  For example, the cohesiveness of  Israeli Jews  might be attributed to the long-standing conflict with the  Arab s. Conflict with one group may also serve to produce cohesion by leading to a series of alliances with other groups.\nSince the publication of ''The Behavior of Law'', Black and other pure sociologists have applied the theoretical strategy to numerous other subjects.  Most notably, Black has developed a general theory of social control that goes beyond law to explain more generally the handling of all human conflicts.  Most conflicts are handled without appealing to the legal system, and the theory thus explains not just law but  avoidance ,  gossip ,  therapy ,  feud ing, and numerous other forms of non-governmental social control.  In addition to extending the subject matter, this later work also extends the theory to focus not just on the social characteristics of the initial disputants in a conflict, but also of third parties (all those with knowledge of a conflict).  For example, Mark Cooney examines how third party behavior shapes  violence .  Whether and how third parties involve themselves in a conflict can determine not only the likelihood of violence, but also the form the violence takes.  For example, social configurations characterized by close and distant group ties are conducive to feud-like behavior where violence occurs back and forth between groups over a long period of time.  In this situation, third parties are members of groups, and they are relationally close to fellow group members but distant from others.  When conflicts between groups occur, they thus support one side and oppose the other, and they may join in retaliatory violence against members of rival groups.  Other social configurations are conducive to other forms of violence or even to peace.  For example, where there are cross-cutting ties, such as where people are relationally close to members of other groups, third parties are more likely to promote peace.\nThe concept of social stratification is often used and interpreted differently within specific theories. In  sociology , for example, proponents of  action theory  have suggested that social stratification is commonly found in  developed  societies, wherein a  dominance hierarchy  may be necessary in order to maintain  social order  and provide a stable  social structure . So-called  conflict theories , such as  Marxism , point to the inaccessibility of resources and lack of  social mobility  found in stratified societies. Many sociological theorists have criticized the extent to which the  working classes  are unlikely to advance socioeconomically while the  wealthy  tend to hold political power which they use to  exploit  the  proletariat  (laboring class).  Talcott Parsons , an American sociologist, asserted that stability and social order are regulated, in part, by  universal value s.  Such values are not identical with \"consensus\" but can as well be an impetus for ardent social conflict as it has been multiple times through history. Parsons never claimed that universal values, in and by themselves, \"satisfied\" the  functional prerequisites  of a society.  Indeed, the constitution of society is a much more complicated codification of emerging historical factors. Theorists such as  Ralf Dahrendorf  alternately note the tendency toward an enlarged middle-class in modern Western societies due to the necessity of an educated workforce in technological economies. Various social and political perspectives concerning  globalization , such as  dependency theory , suggest that these effects are due to change in the status of workers to the  third world .\nTo summarize the example, conflict theorists view the relationship between the owner and tenant as being built primarily on conflict rather than harmony. Even though the owner-tenant relationship may often appear harmonious, any visible harmony is only a product of the law and other elements of the  superstructure  which constrain the relationship and which are themselves a product of an even deeper conflict,  class conflict . A conflict theorist would say that conflict theory holds more explanatory power than consensus theory in this situation since consensus theory cannot explain lawsuits between owners and tenants nor the legal foundations of the asymmetrical power relationship between the two.\nSociologists have studied immigration closely in twenty-first century. Compared to the majority of European immigrants entering the Unites States during the early twentieth century, the twenty-first century witnessed the arrival of immigrants predominately from Asia, the Middle East, and Latin America. From 2000 to 2001, sociologists have paid particular attention to the costs and benefits of the new diversified immigration population on American institutions, culture, economic functions, and national security. After the attacks on the World Trade Center on September 11, 2001, sociologists closely analyzed the symbolism of increased anti-immigration rhetoric, directed at Middle Eastern immigrants, stemming from Americans. Structural functionalists theorists have also studied the effects of mass migration—resulting from wars, economic insecurity, and terrorism—on the  social institutions  of host nations, international law, and assimilation rates. Additionally, sociologists exercising  social conflict theory  have analyzed, in particular, labor market conflicts resulting from increased marketplace competition due to the rise in competition between immigrants and native workers for jobs and  social mobility . Because rates of global immigration are continuing to increase, the field of sociology has a particular interest in monitoring twenty-first century immigration as it relates to the foundational theories of symbolic interactionism, social conflict, and structural functionalism.\nThrough the lens of a symbolic internationalist, there are many symbols that have to do with the sociology of food. Food, in many cultures, brings people together and connects them on multiple different levels. For example, the tradition of eating with the family around the table. It represents togetherness with one and another and communication. Food itself could symbolize something greater than what it is. In America, fast food could represent the busy family that needs a quick dinner to some. To others, however, it could display the “McDonaldization Theory” which centers around the idea of, specifically American, consumption. Another example of how the sociology of food can be symbolized would be making the food from scratch. This definitely goes along with the family. With other theories of sociology, conflict theory also pertains to the sociology of food. As mentioned before, food was first and foremost used for nourishment and means of survival. Due to this, that can fall under conflict theory. The roles of the hunter and gather meant that early humans had to fight and forage to survive. The conflict could also display the survival of the fittest, because there was a conflict for getting food and nourishment, the only the ones who were to best for prevail and provide nourishment for themselves and their families. This evolved to what it is today, with people having jobs to make a living for themselves, which goes into food and nourishment.\nConflict theorists, and therefore Dahrendorf, often took the exact opposite view of functionalists.  Whereas functionalists believe that society was oscillating very slightly, if not completely static, conflict theorists said that every society at every point is subject to process of change\". He believes that there is \"dissension and conflict at every point in the social system\" and \"many societal elements as contributing to disintegration and change\". They believe order comes from coercion from those at the top. They believe that power is an important factor in social order. Dahrendorf believes that both conflict theory and consensus theory are necessary because they reflect the two parts of society.\nDuring the 19th century an interpretive model of the relationship between religion and science known today as the  conflict theory  developed, according to which interaction between religion and science almost inevitably leads to hostility and conflict. A popular example was the misconception that people from the  Middle Ages  believed that the  Earth was flat , and that only science, freed from religious dogma, had shown that it was spherical. This thesis was a popular  historiographical  approach during the late 19th and early 20th centuries, but most contemporary  historians of science  now reject it.\nKimberly has taught college Sociology and Criminal Justice classes and has a Master's Degree in Criminal Justice. Social conflict theory sees social life as a competition and focuses on the distribution of resources, power, and inequality. Conflict theorists view society as an arena of inequality that generates social conflict and social change. Karl Marx is considered the father of social conflict theory. In doing so, he offered a theory of capitalism and class conflict between dominant and minority groups.\nSubsequent thinkers have described different versions of conflict theory; a common theme is that different social groups have unequal power, though all groups struggle for the same limited resources. Conflict theory has been used to explain diverse human behavior, such as educational practices that either sustain or challenge the status quo, cultural customs regarding the elderly, and criminal behavior.\nConflict theory states that conflicts breed in society when a powerful minority rules against the interest of a less powerful majority. Conflict theory states that conflicts breed in society when a powerful minority rules against the interest of a less powerful majority.\nConflict Theory. Conflict theory suggests that human behavior in social contexts results from conflicts between competing groups. Conflict theory originated with the work of Karl Marx in the mid-1800s. Marx understood human society in terms of conflict between social classes, notably the conflict in capitalist societies between those who owned the means of economic production (factory or farm owners, for example) and those who did not (the workers).\nIn this lesson, we will explore the realistic conflict theory of prejudice, which offers possible answers for why prejudice happens and when prejudice is highest. Realistic Conflict Theory and Discrimination: Definition & Examples.\nFollowing are some of assumptions of modern conflict theory: 1  Interactions: Human interaction results in conflict. 2  Change: Conflict and change are normal and inevitable in society. 3  Competition: Competition over scarce resources (e.g., money, leisure, sexual partners, etc.) is part of all social groups.\nSociological Theory/Conflict Theory - Modern Examples. 1  As civilizations undergo change from agrarian, rural groups into industrialized, modern societies, a social hierarchy emerges that effectively creates distinct classes based on wealth, power and prestige.\nThe Arab Spring, Occupy Wall Street protests, and the Tea Party movement have the following in common: They are examples of conflict theory in action., They sought to destroy central government., They used violence as the means of achieving their goals., or They can only occur in a representative democracy.\nFor other kinds of conflict see conflict (disambiguation). Cultural conflict is a type of conflict that occurs when different cultural values and beliefs clash. It has been used to explain violence and crime.n example of cultural conflict is the debate over abortion. Ethnic cleansing is another extreme example of cultural conflict. Wars can also be a result of a cultural conflict; for example the differing views on slavery were one of the reasons for the American civil war.\nEven though the renter continues to pay an increasing amount of money to the landlord, the renter never gains any value or profit from this kind of transaction. Thus, the relationship between the landlord and the renter is unfair. This is a prime example of sociological conflict theory. Another key example of social conflict theory is the general laborer. The laborer works within a factory or other industrial building, earns a wage, and goes home with a paycheck.\nThe second major theoretical perspective in sociology is called social conflict theory. This theory views society as a system of groups that are not equal, and therefore consistently generate conflict and change. Think back to that example from the beginning of the lesson with the different groups of students in school.\nIn understanding conflict theory, competition between social classes plays a key part. The following are four primary assumptions of modern conflict theory: Competition: Competition over scarce resources (money, leisure, sexual partners, and so on) is at the heart of all social relationships.\nOthers have further identified more types of conflict, such as the following: 1  Man versus machine: A more contemporary type of conflict, this situation results from humans involved in a struggle with manmade machines. This is an external conflict. The Terminator series is an example of this type of conflict. Man versus society: In this type of conflict, a character must take on society itself, and not a single person. The character stands at odds with societal norms and realizes the necessity to work against these norms.\nA girl is distressed by the conflict between her parents. A girl is distressed by the conflict between her parents. The definition of a conflict is a fight or disagreement. An example of conflict is an argument over parenting styles. Conflict means to clash with someone or something. An example of conflict is to disagree with someone over opposite opinions.\nThis theory is applied to a variety of approaches within criminology in particular and in sociology more generally as a conflict theory or structural conflict perspective in sociology and sociology of crime.\nThe following are three primary assumptions of modern conflict theory: 1  Competition over scarce resources is at the heart of all social relationships. 2  Inequalities in power and reward are built into all social structures. 3  Change occurs as a result of conflict between competing interests rather than through adaptation.", "key": "79_9", "timestamp": "2020-06-23 21:18:59.366650", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}