{"input_text": "After the  2010 NBA All-Star Game , it was revealed in a press conference that Karl was diagnosed with treatable  neck  and  throat cancer . He was placed on leave of absence from the Nuggets while being treated. Assistant coach  Adrian Dantley  filled in as acting head coach for the rest of the season, and the team finished poorly, and went from the second to fourth seed. Although Karl was not ruled out of coaching the second round, the Nuggets were eliminated by the  Utah Jazz  in 6 games.\nDelpech died of  throat cancer  at a hospital in  Puteaux , France on 2 January 2016 at the age of 69.\nSome causes of cancer-related fatigue are treatable, and evaluation is directed towards identifying these treatable causes.  Treatable causes of cancer-related fatigue include:  anemia ,  pain ,  emotional distress ,  sleep disturbance s, nutritional disturbances, decreased  physical fitness  and activity, side effects from medications (e.g.,  sedative s),  abuse of alcohol  or other substances.  Additionally,  other medical conditions , such as  infection s,  heart disease , or  endocrine dysfunction  (e.g.,  hot flashes ), can cause fatigue, and may also need treatment.\nBabe Ruth , perhaps the most famous player of all time, also died of throat cancer. In the mid-1940s, Ruth was diagnosed with  nasopharyngeal carcinoma  (cancer of the upper throat). The top two causes of this disease are alcohol and tobacco; Ruth was a heavy user of both.\nJohn Snagge died in  Slough  from  throat cancer  in 1996, aged 91.\nMcLean died of  throat cancer  at 77 years of age.\nThroat cancers are classified according to their  histology  or cell structure, and are commonly referred to by their location in the oral cavity and neck. This is because where the cancer appears in the throat affects the prognosis - some throat cancers are more aggressive than others depending upon their location. The stage at which the cancer is diagnosed is also a critical factor in the prognosis of throat cancer.\nHicks died of throat cancer in 1974.\nWynne died of  throat cancer  at  Cromwell Hospital  in  London  on 28 February 1990, aged 70.\nPrevention is by not using tobacco or alcohol. While  screening  in the general population does not appear to be useful, screening high risk groups by examination the throat might be useful. Often head and neck cancer is curable if detected early; however, outcomes are typically poor if detected late. Treatment may include a combination of surgery,  radiation therapy ,  chemotherapy , and  targeted therapy . Following treatment of one head and neck cancer people are at higher risk of a second cancer.\nIn November 2010, Douglas's doctors put him on a special weight-gain diet due to excessive weight loss that had left him weak. On January 11, 2011, he said in an interview that the tumor was gone, though the illness and aggressive treatment had caused him to lose thirty-two pounds. He noted that he would require monthly screenings because of a high chance of recurrence within two to three years. In June 2013, Douglas told  The Guardian  that his type of cancer is caused by  HPV , transmitted by  cunnilingus , leading some media to report this as well. His spokesman denied these reports and portrayed Douglas's conversation with The Guardian as general and not referring specifically to his own diagnosis. Although Douglas described the cancer as  throat cancer , it was publicly speculated that he may actually have been diagnosed with  oropharyngeal cancer . In October 2013, Douglas said he had suffered from tongue cancer, not throat cancer. He announced it as throat cancer upon the advice of his physician, who felt it would be unwise to reveal that he had tongue cancer given its negative prognosis and potential for disfigurement, particularly because the announcement came immediately before Douglas's promotional tour for  Wall Street: Money Never Sleeps .\nFord died at Eastern Long Island Hospital in  Greenport, Suffolk County, New York  on January 27, 1970 of  lung cancer  and  throat cancer .\nTargeted  monoclonal antibody therapy  is employed to treat diseases such as  rheumatoid arthritis ,  multiple sclerosis ,  psoriasis , and many forms of  cancer  including  non-Hodgkin's lymphoma ,  colorectal cancer ,  head and neck cancer  and  breast cancer .\nMany different treatments and therapies are used in the treatment of throat cancer. The type of treatment and therapies used are largely determined by the location of the cancer in the throat area and also the extent to which the cancer has spread at time of diagnosis. Patients’ also have the right to decide whether or not they wish to consent to a particular treatment. For example, some may decide to not undergo radiation therapy which has serious side effects if it means they will be extending their lives by only a few months or so. Others may feel that the extra time is worth it and wish to pursue the treatments.\nHe mobilized the resistance against the Israeli invasion and occupation of the  West Bank . He was arrested at the end of 1975 and deported to  Jordan  in 1978. In  Jordan , he was the assistant for  Khalil al-Wazir  ( Abu Jihad ) and was responsible for  Intifada  Logistics. He returned to the  West Bank  at the end of 1998 and joined the  Preventive Security Apparatus  of the  Palestinian Authority  as a Colonel. After the beginning of the  Second Intifada  in September 2000, he was arrested and accused of responsibility for the  Hamas  cell in the  West Bank . He was given a life sentence (99 years according to Israeli Military Law).  He died, allegedly of throat cancer, while in an Israeli jail.Eight months prior to his death, Abuhamdia complained of general weakness, sore throat and pain in his joints. After examination by a doctor, according to his family, he received some shots. Abuhamdia asked again for proper examination to diagnose his illness. After four additional months, prison staff transported Abuhamdia to the hospital in  Tel-Aviv . According to Abuhamdia's wife, he said, \"They transferred me to the hospital in the prisoners bus. The steel bus seats were uncomfortable. I fell many times during the 6 hour trip. I will not go again unless they bring an ambulance.\" When he went to the hospital, the doctors took samples from his throat for tissue diagnosis, but test results were never shared with him. He remained in jail with other Palestinian prisoners, after a while, his health deteriorated without any medication such as painkillers. His voice disappeared, and his neck swelled with nodes and he became very weak. He could not change his clothes nor could he go to the toilet. Despite this, the  Israeli Prison Authority  left him in the cell. The prisoners demanded officially from the Prison Authorities to transfer Abuhamdia to hospital, but the Prison Authority said it was too late, and Abuhamdia had only days to live. A week before his death, the Israeli Authorities transferred him to Beir-Shiva Hospital. They did another  Biopsy test  and declared for the first time that he had  Throat Cancer . He received only two  Chemotherapy  sessions and died on Tuesday, April 2 at 6 am. An  Autopsy  was performed on his body, and Israel declared that  cancer  was spread throughout his body. Israel refused to release his medical records and the results of the medical tests.\nGiambra experienced throat  cancer , but later recovered. His treatment choice caused a political firestorm as he was treated at  Memorial Sloan-Kettering Cancer Center  in  New York City  instead of the  Roswell Park Cancer Institute  in  Buffalo  leading to the belief that he was deliberately insulting his constituency by seeking treatment outside Erie County at a time when Roswell Park was a highly rated cancer facility. Supporters claim that he wished to avoid media scrutiny during his treatment and recovery, something he could not do while being treated at Roswell, and that Sloan-Kettering was superior in treating his specific form of cancer.\nNinety percent  of cases of  head and neck cancer  (cancer of the mouth, nasal cavity, nasopharynx, throat and associated structures) are due to squamous cell carcinoma. Symptoms may include a poorly healing  mouth ulcer , a hoarse voice or other persistent problems in the area. Treatment is usually with  surgery  (which may be extensive) and  radiotherapy . Risk factors include  smoking ,  alcohol consumption  and  hematopoietic stem cell transplantation . In addition, recent studies show that about 25% of mouth and 35% of throat cancers are associated with HPV. The 5 year disease free survival rate for HPV positive cancer is significantly higher when appropriately treated with surgery, radiation and chemotherapy as compared to non-HPV positive cancer, substantiated by multiple studies including research conducted by Maura Gillison, et al. of Johns Hopkins Sidney Kimmel Cancer Center.\nWart s,  moles ,  skin tag s,  solar keratoses ,  Morton's neuroma  and small  skin cancer s are candidates for cryosurgical treatment. Several  internal disorders  are also treated with cryosurgery, including  liver cancer ,  prostate cancer , lung cancer, oral cancers,  cervical  disorders and, more commonly in the past,  hemorrhoids . Soft tissue conditions such as  plantar fasciitis  (jogger's heel) and  fibroma  (benign excrescence of connective tissue) can be treated with cryosurgery. Generally, all tumors that can be reached by the cryoprobes used during an operation are treatable. Although found to be effective, this method of treatment is only appropriate for use against localized disease, and solid tumors larger than 1 cm. Tiny, diffuse  metastases  that often coincide with cancers are usually not affected by cryotherapy.\nWhen Sherrin became ill with a throat infection in late 2006, later diagnosed as throat cancer,  Peter Curran  stood in as presenter of Loose Ends with  Patrick Kielty  and  Clive Anderson  as guest presenters. Sherrin died of  throat cancer  on 1 October 2007. Clive Anderson became permanent replacement host in 2007.\nGermany's progressive elements hoped that William's death, and thus Frederick's succession, would usher the country into a new era governed along liberal lines. The conservative William, however, lived a long life, dying at the age of 90 on 9 March 1888. Logically, Frederick should have taken as his regnal name either Frederick I (if the Bismarckian empire was considered a new entity) or Frederick IV (if it was considered a continuation of the old Holy Roman Empire, which had had three emperors named Frederick); he himself preferred the latter. However, on the advice of Bismarck that this would create legal problems, he opted to simply keep the same regnal name he had as king of Prussia.  By the time he ascended the throne, Frederick was 56 years old and suffering from a debilitating  cancer of the larynx . He viewed his illness with dismay, crying \"To think I should have such a horrid disgusting illness ... I had so hoped to have been of use to my country.\" He received conflicting medical advice regarding treatment. In Germany, Doctor  Ernst von Bergmann  proposed to remove the  larynx  completely, but his colleague, Doctor  Rudolf Virchow , disagreed; such an operation had never been performed without the death of the patient. The British doctor  Sir Morell Mackenzie , who had diagnosed the cancer, advised a  tracheotomy , to which Frederick and his wife agreed. On 8 February, a month before his father died, a  cannula  was fitted to allow Frederick to breathe; for the remainder of his life he was unable to speak and often communicated through writing. During the operation, Dr. Bergmann almost killed him by missing the incision in the  trachea  and forcing the cannula into the wrong place. Frederick started to cough and bleed, and Bergmann placed his forefinger into the wound to enlarge it. The bleeding subsided after two hours, but Bergmann's actions resulted in an  abscess  in Frederick's neck, producing pus which gave the new Emperor discomfort for the remaining months of his life. Later, Frederick would ask \"Why did Bergmann put his finger in my throat?\" and complain that \"Bergmann ill-treated [me]\". The diagnosis and treatment of Prince Frederick's fatal illness caused some medical controversy well into the next century.\nWeng died of  throat cancer  in  Manhattan .\nIn June 2011, Hagman said he had  stage 2  throat cancer. He commented, \"As J. R. I could get away with anything — bribery, blackmail and adultery. But I got caught by cancer. I do want everyone to know that it is a very common and treatable form of cancer. I will be receiving treatment while working on the new Dallas series. I could not think of a better place to be than working on a show I love, with people I love.\" Hagman had an acorn-sized tumor removed from his tongue in 2011. In June 2012, the cancer was said to be in remission. Then, in July 2012, doctors diagnosed Hagman with  myelodysplastic syndromes  (formerly known as preleukemia).\nRivière died of throat cancer at 40.\nHarvey is currently battling throat cancer.  On 2 September 2009 he underwent surgery to remove a cancerous growth in his throat and had his voice box removed.\nChemotherapy  in throat cancer is not generally used to cure the cancer as such. Instead, it is used to provide an inhospitable environment for metastases so that they will not establish in other parts of the body. Typical chemotherapy agents are a combination of  paclitaxel  and  carboplatin .  Cetuximab  is also used in the treatment of throat cancer.\nPerhaps the most serious oral condition that can arise is that of  oral cancer . However, smoking also increases the risk for various other oral diseases, some almost completely exclusive to tobacco users. The  National Institutes of Health , through the  National Cancer Institute , determined in 1998 that \"cigar smoking causes a variety of cancers including cancers of the  oral cavity  (lip, tongue, mouth, throat),  esophagus ,  larynx , and  lung .\"  Pipe  smoking involves significant health risks, particularly oral cancer. Roughly half of  periodontitis  or inflammation around the teeth cases are attributed to current or former smoking. Smokeless tobacco causes  gingival recession  and white mucosal  lesion s. Up to 90% of periodontitis patients who are not helped by common modes of treatment are smokers. Smokers have significantly greater loss of bone height than nonsmokers, and the trend can be extended to pipe smokers to have more bone loss than nonsmokers. Smoking has been proven to be an important factor in the staining of teeth.  Halitosis  or bad breath is common among tobacco smokers. Tooth loss has been shown to be 2 to 3 times higher in smokers than in non-smokers. In addition, complications may further include  leukoplakia , the adherent white plaques or patches on the mucous membranes of the oral cavity, including the tongue.\nRuth Hurmence Green was born into a  Methodist  family in 1915 in the small town of Sumner, Iowa. In 1935 at the age of 20 she graduated from  Texas Tech University  with a degree in journalism. She was married to Truman Green, an engineer, had three children, and eventually settled in  Jefferson City, Missouri . In 1960, after losing her only sister to breast cancer, Green underwent a radical mastectomy. She was treated for skin cancer several years later and in 1975 was diagnosed with throat cancer. It was during recovery from her first round of cancer treatments during the early 70s that Ruth, “a half-hearted Methodist” decided to read the Bible cover to cover. This project took two years and made her a confirmed atheist. When the throat cancer returned several years later in 1981 she kept the diagnosis to herself, knowing that this time the disease would be terminal. On July 7, 1981 Green ingested a fatal dose of painkillers. In her last letter to friend  Annie Laurie Gaylor , dated July 4, 1981 Green wrote, \"Freedom from religion must grow and prosper... freedom depends upon freethinkers.\"\nBrayshaw died of  throat cancer  in 1990.\nTreatment of Metastatic Cancer of the Throat. Patients with metastatic cancer of the throat have cancer that has spread to distant sites beyond the throat and neck region. Patients with metastatic cancer are usually treated with systemic combination chemotherapy. However, control of the primary cancer and regional lymph node spread through surgery or radiation is as important as controlling the metastases.\nChemotherapy is a drug treatment that uses powerful chemicals to kill fast-growing cells in your body. Chemotherapy is most often used to treat cancer, since cancer cells grow and multiply much more quickly than most cells in the body.Many different chemotherapy drugs are available. Chemotherapy drugs can be used alone or in combination to treat a wide variety of cancers.Though chemotherapy is an effective way to treat many types of cancer, chemotherapy treatment also carries a risk of side effects.hemotherapy is most often used to treat cancer, since cancer cells grow and multiply much more quickly than most cells in the body. Many different chemotherapy drugs are available.\nNIVOLUMAB is a monoclonal antibody. It is used to treat melanoma, lung cancer, kidney cancer, head and neck cancer, Hodgkin lymphoma, and urothelial cancer.\nMouth cancer, also called oral cancer, describes a cancerous tumour, growth or sore developing in the mouth. On the gums. Mouth cancer is related to throat cancer affecting the throat (pharynx). Mouth cancer can be life-threatening if it is not diagnosed and treated as early as possible. Mouth cancer can develop in the mouth itself, called primary oral cancer. It can also spread to the mouth from cancer elsewhere in the body. This is called secondary oral cancer, or metastatic oral cancer.\nOral cancer appears as a growth or sore in the mouth that does not go away. Oral cancer, which includes cancers of the lips, tongue, cheeks, floor of the mouth, hard and soft palate, sinuses, and pharynx (throat), can be life threatening if not diagnosed and treated early.\nJim Kelly avoids cancer surgery, doctors say it is 'treatable and potentially curable'. Jim Kelly and his daughter Erin watch a recent college basketball game at a Manhattan hospital on Saturday where the Bills great is being treated for a return of his oral cancer. (Uncredited/AP) BY Ralph Vacchiano\nMonoclonal antibodies can block these receptors and prevent the growth signal from getting through. Cetuximab (Erbitux), a monoclonal antibody approved to treat colon cancer and head and neck cancers, attaches to receptors on cancer cells that accept a certain growth signal (epidermal growth factor).etuximab (Erbitux), a monoclonal antibody approved to treat colon cancer and head and neck cancers, attaches to receptors on cancer cells that accept a certain growth signal (epidermal growth factor).\nThroat cancer is a type of head and neck cancer. Throat cancer has different names, depending on what part of the throat is affected. The different parts of the throat are called the oropharynx, the hypopharynx, and the nasopharynx. Sometimes the larynx, or voice box, is also included. The main risk factors for throat cancer are smoking or using smokeless tobacco and use of alcohol. Treatments include surgery, radiation therapy, and chemotherapy.\n1 Surgery for early-stage throat cancer. 2  Throat cancer that is confined to the surface of the throat or the vocal cords may be treated surgically using endoscopy. 3  Your doctor may insert a hollow endoscope into your throat or voice box and then pass special surgical tools or a laser through the scope.ptions may include: 1  Surgery for early-stage throat cancer. 2  Throat cancer that is confined to the surface of the throat or the vocal cords may be treated surgically using endoscopy. 3  Your doctor may insert a hollow endoscope into your throat or voice box and then pass special surgical tools or a laser through the scope.\nThe following list of diseases or medical conditions are some (but not all) of the medical issues that may be treated by Otolaryngologist/ear nose throat specialist (medical specialist) or where a Otolaryngologist/ear nose throat specialist may be involved: 1  Sinus problems. 2  Sleep apnea. 3  Tonsil problems.  Ear 1  cancer. Nose cancer.  Throat cancer.\nMany people with a stiff neck find taking a warm bath to be helpful. Symptoms of a cold combined with a stiff neck can be caused by neck cancer. Persistent headaches and stress can cause the neck to become stiffer. A cold with neck stiffness may be caused by tonsillitis.A heating pad can be used to treat a stiff neck when it's accompanied by a cold. In some cases, cold and flu symptoms in tandem with a stiff neck indicate meningitis or another serious ailment. Colds can cause a sore throat.any people with a stiff neck find taking a warm bath to be helpful. Symptoms of a cold combined with a stiff neck can be caused by neck cancer. Persistent headaches and stress can cause the neck to become stiffer. A cold with neck stiffness may be caused by tonsillitis.\nPharmacologic Classification: Cholinergic. Uses For pilocarpine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome.harmacologic Classification: Cholinergic. Uses For pilocarpine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome.\nPilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome.This medicine may help you speak without having to sip liquids.ses of This Medicine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome. This medicine may help you speak without having to sip liquids.\nUses of This Medicine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome. This medicine may help you speak without having to sip liquids.ses of This Medicine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome. This medicine may help you speak without having to sip liquids.\nFilm critic Roger Ebert s long battle with head and neck cancer demonstrates the complexity of treating this relatively rare disease, a top cancer specialist tells Newsmax Health. Cancers that occur in the head and neck can be very complicated to treat, says Richard... Roger Ebert,head and neck cancer,Richard Borrowdale,M.D.\nThroat cancers may be cured when detected early. If the cancer has spread (metastasized) to surrounding tissues or lymph nodes in the neck, about half of patients can be cured. If the cancer has spread to parts of the body outside the head and neck, the cancer is not curable. Treatment is aimed at prolonging and improving quality of life. After treatment, therapy is needed to help with speech and swallowing.\nTreatment for head and neck cancer depends on the type of cancer, stage, and other general health factors. Common methods of treating head and neck cancer include chemotherapy, radiation therapy, and surgery. Find a Doctor: UCompareHealthCare.\nAfter resection, these patients usually have excellent prognoses.[8] In most cases, esophageal cancer is a treatable disease, but it is rarely curable. The overall 5-year survival rate in patients amenable to definitive treatment ranges from 5% to 30%. The occasional patient with very early disease has a better chance of survival.\nSurgery for throat cancer. Surgery is the preferred treatment for early-stage throat cancers. The throat is comprised of the pharynx and the larynx. For advanced stage or recurrent throat cancer, we may combine surgery with other forms of treatment, such as radiation therapy and chemotherapy. These treatments may be used to shrink the tumor before surgery.\nSign Up. Treatment can include some combination of surgery, radiation and chemotherapy. However, sometimes in the final stage of throat cancer itâ\u0080\u0099s too advanced to be cured, so then treatment focuses on alleviating symptoms and making life as comfortable as possible.Best Answer.ign Up. Treatment can include some combination of surgery, radiation and chemotherapy. However, sometimes in the final stage of throat cancer itâ\u0080\u0099s too advanced to be cured, so then treatment focuses on alleviating symptoms and making life as comfortable as possible.\nIt can be difficult to detect throat cancer in its early stages. Common signs and symptoms of throat cancer include: 1  a change in your voice. 2  trouble swallowing. 3  weight loss. 4  sore throat. 5  persistent cough (may cough up blood). 6  swollen lymph nodes in the neck.hese abnormal cells form malignant growths called tumors. Throat cancer refers to cancer of the voice box, the vocal cords, and other parts of the throat, such as the tonsils and the oropharynx. Raise money to cover your cancer treatment costs.\nYour doctor can use a variety of tests to stage your throat cancer. Imaging tests like a CT scan or an MRI will allow your doctor to take a closer look at the chest, neck and head, giving him or her a better picture of the diseaseâ\u0080\u0099s progression.hese abnormal cells form malignant growths called tumors. Throat cancer refers to cancer of the voice box, the vocal cords, and other parts of the throat, such as the tonsils and the oropharynx. Raise money to cover your cancer treatment costs.\nWarning Signs of Oral Cancer. Approximately 37,000 Americans are diagnosed with oral cancer annually, and just over half will be alive five years later. These startling statistics from the Oral Cancer Foundation tell a warning tale, but there is some good news, too. If caught early, oral cancer is highly treatable.\nâ\u0080\u009cSome of the most common types of cancer seem to be treatable with immunotherapy. Overall, cancers of the lung, kidney, bladder, head and neck, and melanoma cause about 50,000 deaths a year, or around one third of cancer deaths.â\u0080\u009d. In one British-led study, 58 per cent of patients with advanced skin cancer saw their tumours reduce significantly when given a new combination of immunotherapy drugs.\nSymptoms of head and neck cancer. A lump in the neck. Cancers that begin in the head or neck usually spread to lymph nodes in the neck before they spread elsewhere. A lump in the neck that lasts more than two weeks should be seen by a physician as soon as possible.Of course, not all lumps are cancer.But a lump (or lumps) in the neck can be the first sign of cancer of the mouth, throat, voicebox (larynx), thyroid gland, or of certain lymphomas and blood cancers. Such lumps are generally painless and continue to enlarge steadily.Change in the voice. Most cancers in the larynx cause some changes in voice.ymptoms of head and neck cancer. A lump in the neck. Cancers that begin in the head or neck usually spread to lymph nodes in the neck before they spread elsewhere. A lump in the neck that lasts more than two weeks should be seen by a physician as soon as possible.\nPeople with these symptoms should tell their doctor so that any problem can be diagnosed and treated as early as possible. If you have symptoms that suggest laryngeal cancer, your doctor may do a physical exam. Your doctor looks at your throat and feels your neck for lumps, swelling, or other problems.You may have one or more of the following tests:iagnosis. If you have symptoms that suggest laryngeal cancer, your doctor may do a physical exam. Your doctor looks at your throat and feels your neck for lumps, swelling, or other problems.\nIn 2002, the total cost in the United States for initial cancer care was $6.7 billion. Over the course of the study, the average cost for treating a lung cancer patient went up $7,139, to an average of $39,891. With prostate cancer, the average price tag for treatment went up $5,345, to an average of $41,134.The cost of treating breast cancer went up $4,189, to an average cost of $20,964.However, the cost of treating prostate cancer dropped $196, to an average of $18,261 in 2002. The drop in cost was due to fewer men undergoing surgery for their cancer, the researchers found.owever, the cost of treating prostate cancer dropped $196, to an average of $18,261 in 2002. The drop in cost was due to fewer men undergoing surgery for their cancer, the researchers found.\nMethotrexate is a prescription medication used to treat certain types of cancers. It is also used to treat psoriasis, polyarticular juvenile idiopathic arthritis (PJIA), and rheumatoid arthritis (RA).Methotrexate belongs to a group of drugs called antimetabolites.ral/Injectable: Methotrexate is a prescription medication used to treat the following conditions: 1  severe psoriasis. 2  rheumatoid arthritis. 3  polyarticular juvenile idiopathic arthritis (PJIA). 4  breast cancer. 5  certain types of head and neck cancer. 6  lung cancer. 7  advanced non-Hodgkin lymphoma (NHL).\nABSTRACT: Anemia, common in people with cancer, can be due to the disease itself or to the associated therapy. Fatigue, the most prevalent of all symptoms experienced by cancer patients, is the primary symptom of anemia.Caused by many factors, fatigue, regardless of etiology, has an adverse impact on health-related quality of life.Anemia is among the more treatable of those causes. Prior to the development of recombinant human erythropoietin, red blood cell transfusion was the standard treatment for cancer-related anemia.aused by many factors, fatigue, regardless of etiology, has an adverse impact on health-related quality of life. Anemia is among the more treatable of those causes. Prior to the development of recombinant human erythropoietin, red blood cell transfusion was the standard treatment for cancer-related anemia.\nLimonene is a chemical found in the peels of citrus fruits and in other plants. It is used to make medicine. Limonene is used to promote weight loss, prevent cancer, treat cancer, and treat bronchitis.In foods, beverages, and chewing gum, limonene is used as a flavoring. In pharmaceuticals, limonene is added to help medicinal ointments and creams penetrate the skin.t is used to make medicine. Limonene is used to promote weight loss, prevent cancer, treat cancer, and treat bronchitis. In foods, beverages, and chewing gum, limonene is used as a flavoring.\nOral cancer appears as a growth or sore in the mouth that does not go away. Oral cancer, which includes cancers of the lips, tongue, cheeks, floor of the mouth, hard and soft palate, sinuses, and pharynx (throat), can be life threatening if not diagnosed and treated early. Read more.\nThroat cancer survival rate may differ depending on the stages. Under this cancer, four stages can be classified. Among the most critical stage is the stage 4. Stage 4 throat cancer survival rate is around 30 percent. This is the lowest percentage of survival rate of throat cancer.This stage is widely affecting the lips, the mouth and the lymph nodes. In contrast, stage 3 throat cancer survival rate levels up to 50 to 60 percent.If stages 3 and 4 are low in survival rates, stages 1 and 2 have higher percentages. This implies that you can either have higher or lower survival rate depending on the stage of your cancer.hroat cancer survival rate may differ depending on the stages. Under this cancer, four stages can be classified. Among the most critical stage is the stage 4. Stage 4 throat cancer survival rate is around 30 percent. This is the lowest percentage of survival rate of throat cancer.\nCancer is being treated by Rick Simpson in Canada. He makes hemp oil and puts it in a toothpaste tube. His patients eat a pea-sized amount daily. Eating hemp oil takes about 90 days to remove most terminal cancers, and has been SUCESSFULLY tested on patients with lung cancer, brain cancer, etc. Skin cancer can be treated in a matter of days by putting some of the oil on a bandage and attaching it to the infected area. Rick's movie is Run FROM the Cure .\nHere's what doctors often recommend, based on cancer stage: 1  Stage 0 throat cancers have not become invasive. They usually can be treated by removing the affected tissue. 2  Stage I or II throat cancers require surgery, radiation therapy or both.\nThey include cancers of the larynx (voice box), throat, lips, mouth, nose, and salivary glands. Most types of head and neck cancer begin in squamous cells that line the moist surfaces inside the head and neck (for example, the mouth, nose, and throat).o get the right information about treatment and prognosis, you need to know exactly what type of head and neck cancer you have and what stage it is. The Head and Neck Cancers fact sheet has additional basic information. Head and neck cancers are cancers that start in the tissues and organs of the head and neck.\nMany different chemotherapy drugs are available. Chemotherapy drugs can be used alone or in combination to treat a wide variety of cancers. Though chemotherapy is an effective way to treat many types of cancer, chemotherapy treatment also carries a risk of side effects.hemotherapy drugs can be used alone or in combination to treat a wide variety of cancers. Though chemotherapy is an effective way to treat many types of cancer, chemotherapy treatment also carries a risk of side effects.\nWe target throat tumors with some of the most advanced treatments and technology available. Our throat cancer program offers pioneering advances in radiation, surgery and chemotherapy, with a high quality of care.\nTreatment of throat cancer is multi-modality in nature. Because the throat is involved in talking, swallowing, and breathing, the type of treatment is selected to minimized impact on these important functions.\nOne of the controversies in treatment of early stage cancer of the throat is whether or not to routinely treat the lymph nodes in the neck with surgery and radiation therapy. If left untreated, cancers of the throat ultimately spread throughout the lymph system in the neck.\nEarly Stage Cancer of the Throat. Early stage cancers of the throat are small, localized, and highly curable when treated with surgery and/or radiation therapy. Early stage disease includes stage I, II, and some stage III cancers. Stage I cancer is no more than 2 centimeters in size (about 1 inch) and has not spread to lymph nodes in the area.\nSurgery: The most common treatment of early stage cancer of the throat is surgery, which results in cure for over 80% of patients. In some cases, patients are unable to tolerate surgery or surgery results in significant functional defects, including difficulty in talking or swallowing.\nSurgery for early-stage throat cancer. Throat cancer that is confined to the surface of the throat or the vocal cords may be treated surgically using endoscopy. Your doctor may insert a hollow endoscope into your throat or voice box and then pass special surgical tools or a laser through the scope.\nOptions may include: 1  Surgery for early-stage throat cancer. Throat cancer that is confined to the surface of the throat or the vocal cords may be treated surgically using endoscopy. 2  Surgery to remove all or part of the voice box (laryngectomy). For smaller tumors, your doctor may remove the part of your voice box that is affected by cancer, leaving as much of the voice box as possible. Your doctor may be able to preserve your ability to speak and breathe normally.\nIf diagnosed early, throat cancer has a high cure rate. Throat cancer may not be curable once malignant cells spread to parts of the body beyond the neck and head. However, those diagnosed can continue treatment to prolong their life and slow the progression of the disease.\nPrognosis of Throat cancer (Squamous Cell Carcinoma of the Tonsil) How is Throat cancer (Squamous Cell Carcinoma of the Tonsil) Treated? What is Throat cancer (Squamous Cell Carcinoma of the Tonsil) Throat cancer or squamous cell carcinoma of the tonsil is a part of cancers of the head and neck. In oncology squamous cell cancers of the head and neck are often considered together because they share many similarities - in incidence, cancer type, predisposing factors, pathological features, treatment of the cancer and cancer prognosis.\nThroat cancers may be cured when detected early. If the cancer has spread (metastasized) to surrounding tissues or lymph nodes in the neck, about half of patients can be cured. If the cancer has spread to parts of the body outside the head and neck, the cancer is not curable. Treatment is aimed at prolonging and improving quality of life.\nOral cancer appears as a growth or sore in the mouth that does not go away. Oral cancer, which includes cancers of the lips, tongue, cheeks, floor of the mouth, hard and soft palate, sinuses, and pharynx (throat), can be life threatening if not diagnosed and treated early.ral cancer appears as a growth or sore in the mouth that does not go away. Oral cancer, which includes cancers of the lips, tongue, cheeks, floor of the mouth, hard and soft palate, sinuses, and pharynx (throat), can be life threatening if not diagnosed and treated early.\nOutlook (Prognosis) Throat cancers may be cured when detected early. If the cancer has spread (metastasized) to surrounding tissues or lymph nodes in the neck, about half of patients can be cured. If the cancer has spread to parts of the body outside the head and neck, the cancer is not curable.\n1 Symptoms of throat cancer. 2  Throat cancer can spread. 3  Risk factors of throat cancer.  Diagnosis of throat 1  cancer. Treatment for throat cancer.  Side effects of cancer 1  treatment. Palliative 2  care. Where to get  help. Things to remember.", "key": "31_2", "timestamp": "2020-06-23 21:18:58.950503", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}