{"input_text": "Despite their weight, wild turkeys, unlike their  domesticated counterparts , are agile fliers. In ideal habitat of open woodland or wooded grasslands, they may fly beneath the canopy top and find perches. They usually fly close to the ground for no more than 400 m (a quarter mile).\nPredators of both adults and poults include  coyote s (Canis latrans),  gray wolves  (Canis lupus),  bobcat s (Lynx rufus),  cougar s (Puma concolor),  golden eagle s (Aquila chrysaetos) and possibly  American black bear s (Ursus americanus). In addition to poults, hens and adult-sized fledglings (but not, as far as is known, adult male toms) are vulnerable to predation by  great horned owl s (Bubo virginianus),  northern goshawk  (Accipiter gentilis),  domestic dogs  (Canis lupus familiaris),  domestic cats  (Felis catus), and  red fox es (Vulpes vulpes). Humans are now the leading predator of adult turkeys. When approached by potential predators, turkeys and their poults usually run away rather than fly away from potential predators, though they may also fly short distances if pressed.\nYoung domestic turkeys readily fly short distances, perch and roost.  These behaviours become less frequent as the birds mature, but adults will readily climb on objects such as bales of straw. Young birds perform spontaneous, frivolous running ('frolicking') which has all the appearance of play. Commercial turkeys show a wide diversity of behaviours including 'comfort' behaviours such as wing-flapping, feather ruffling, leg stretching and dust-bathing. Turkeys are highly social and become very distressed when isolated.  Many of their behaviours are socially facilitated i.e. expression of a behaviour by one animal increases the tendency for this behaviour to be performed by others. Adults can recognise 'strangers' and placing any alien turkey into an established group will almost certainly result in that individual being attacked, sometimes fatally. Turkeys are highly vocal, and 'social tension' within the group can be monitored by the birds’ vocalisations. A high-pitched trill indicates the birds are becoming aggressive which can develop into intense sparring where opponents leap at each other with the large, sharp  talons , and try to peck or grasp the head of each other.  Aggression increases in frequency and severity as the birds mature.\nTurkeys spend most of the time on the ground and often prefer to run to escape danger through the day rather than fly, though they can fly swiftly and powerfully for short distances as the majority of birds in this order do in necessity. Roosting is usually high in trees away from night-hunting predators such as  jaguar s and usually in a family group.\nTurkeys are large birds, their nearest relatives being the pheasant and the guineafowl. Males are larger than females and have spreading, fan-shaped tails and distinctive, fleshy  wattle s, called a  snood , that hang from the top of the beak and are used in courtship display. Wild turkeys can fly, but seldom do so, preferring to run with a long, stratling gait. They roost in trees and forage on the ground, feeding on seeds, nuts, berries, grass,foliage, invertebrates, lizards, and small snakes.\nHowStuffWorks  Turkey . The wild turkey has the potential to live as long as thirteen years or so, They can (and do) run fast with their long legs, and will take wing and fly. wild turkey. The maximum recorded lifespan for a turkey in captivity is twelve years and four months. ChaCha Answers. Male wild Turkeys grow to about four feet long, including the tail. If you own wild turkeys and do not wish for them to fly away, their wings need Domestic turkeys bred for food consumption were not bred to live over one year.\nWild Turkeys (full grown) Weight: Males 8-24 pounds (3.6-11 kg), females 7-16 pounds (3.2-7.2 kg). Male domestic turkeys have been known to get as heavy as 86 pounds (40 kg). A domestic turkey weighs about twice what a wild turkey weighs. Male wild turkeys grow to about four feet long, including the tail.f you have turkeys that can fly, their enclosed cage should have chicken wire surrounding it on all sides and top with a wood frame with a stiff metal dog wire of about 3-4 feet tall along the bottom to keep out other animals and to keep the turkeys in.\nTurkeys don't fly a lot. They can fly short distances, and they fly down and up from their roosting trees, but they do fly. 1 person found this useful.\nA: Wild turkeys can fly at speeds of 55 miles per hour. Though the birds are very fast in the air, they can only fly at these speeds for a very short amount o... Full Answer > Filed Under: Birds.\nFull Answer. On average, domestic turkeys weigh twice as much as their wild counterparts. In fact, they are so heavy that they usually cannot fly. Within 18 weeks after hatching, a male domestic turkey can attain a weight of 30 pounds.\nIn Care of Birds. Birds can fly because they have wings, and also because they have hollow bones. Humans can't fly because we don't have hollow bones or wings! Because a Birds bones are hoâ\u0080¦llow my science teacher also calls there bones spongy because they look like that from the inside. And since there bones are hollow it makes them less heavy i would guess and thats why they can fly!!!\nOpen Country. While the turkeys roost in trees, they do not use trees in dense forests. Given that they are large birds--they can weigh 20 lbs. or more--they would have trouble flying into trees in dense stands.And when they fly down in the morning, they prefer to simply pitch down into open land.pen Country. While the turkeys roost in trees, they do not use trees in dense forests. Given that they are large birds--they can weigh 20 lbs. or more--they would have trouble flying into trees in dense stands.\nWild Turkey HabitsWild turkeys roost in trees at night. They fly to their roosts at about sunset and fly to the ground at first light where they feed until mid-morning.They will often roost again for a short period in mid-morning and feeding will resume in the afternoon.ild Turkey HabitsWild turkeys roost in trees at night. They fly to their roosts at about sunset and fly to the ground at first light where they feed until mid-morning.\nReport Abuse. Most Turkeys have several roost sites. If there is more than one turkey they will be scattered in a single tree or even in a couple trees. But they will usually fly near the tops of the trees.Where I hunt they use mostly pines, and they are old mature pines.So these birds will sometimes be 50-60+ feet high.eport Abuse. Most Turkeys have several roost sites. If there is more than one turkey they will be scattered in a single tree or even in a couple trees. But they will usually fly near the tops of the trees.\nSit calmly and quietly, listening as turkeys move into a likely roosting spot. Youâ\u0080\u0099ll hear wing beats as they fly up; maybe even soft calling or gobbling as turkeys approach roost trees. With any luck youâ\u0080\u0099ll see them do this.Once in the trees, birds will often move from branch to branch, wings noisily flapping as they reposition.Okay, you know where turkeys sleep.ake your setup near where turkeys flew up the night before. If unpressured, they might land there in the morning. Roost gobbling and softer tree calling before fly-down as day breaks will allow you to reposition if necessary to gain the right setup position.\nWild turkeys have a lot less breast meat than regular turkeys because their breasts are designed to help them fly and they have no hormones or special feed. They are also much more muscular and leaner than their domestic cousins. Cooking a wild turkey is different than cooking a regular store-bought turkey.t is recommended to skin the turkey for fast preparation. Skinning the turkey is a lot faster and less messy. To skin the turkey, here are the steps you would take: 1  Cut off the fan by cutting off the skin at the tail of the turkey. 2  Cut off the wings of the turkey at the second joint.\nDomestic or tame turkeys weigh twice what a wild turkey does and are raised on farms for profit. Most domestic turkeys are so heavy they are unable to fly. Wild turkeys (Meleagris gallopavo) live in woods in parts of North America and are the largest game birds found in this part of the world.omestic or tame turkeys weigh twice what a wild turkey does and are raised on farms for profit. Most domestic turkeys are so heavy they are unable to fly. Wild turkeys (Meleagris gallopavo) live in woods in parts of North America and are the largest game birds found in this part of the world.\nThe domestic turkeys that cannot fly can be kept inside a fenced-in yard, much like a fence that would keep in a dog or a goat. The domestic turkeys that can fly should have some type of net to keep them in. Wild turkeys, on the other hand, can fly very well.\nWild Turkeys can run at speeds up to 25 mph, and they can fly up to 55 mph. However, if being hunted by someone for the Thanksgiving or Christmas table-Who know how fast the â\u0080¦ y will run or fly!\nswallows fly an average of 35 miles an hour. turkeys fly on average 40 miles an hour. blackbirds fly on average 40 miles an hour. pelicans fly around 20 miles an hour. eagles fly around 50 miles an hour. accipeters fly around 30 to 40 miles an hour but when pushed they exceed 60 miles an hour.\nDomestic or tame turkeys weigh twice what a wild turkey does and are raised on farms for profit. Most domestic turkeys are so heavy they are unable to fly. Wild turkeys (Meleagris gallopavo) live in woods in parts of North America and are the largest game birds found in this part of the world.They spend their days foraging for food like acorns, seeds, small insects and wild berries.n fact, Benjamin Franklin wanted to make the wild turkey, not the Bald Eagle, the national bird of the United States! The turkey's popularity comes from the American people's love of eating the bird for special occasions like Thanksgiving and Christmas.\nIn a turkey the active muscles such as the legs store a lot of oxygen and become dark, while less active muscles like the breast remain white. Turkeys can fly short distances -- typically from ground to perch -- but they are not known for their sustained flighing abilities. They rely on their legs to get them around.\nIf a bird doesn't roar on his own, owl hoot, crow call or hen cutt. Hopefully one or more birds will gobble and give away their roost trees. Even if no toms talk you should listen for heavy wings thumping up into the treetops. If you hear a turkey gobble or fly up, you know where to hunt the next morning.Slip into the area well before first light, set up 100 to 150 yards away from a turkey's roost and wait for tom to roar. Then give him your best calling.f you hear a turkey gobble or fly up, you know where to hunt the next morning. Slip into the area well before first light, set up 100 to 150 yards away from a turkey's roost and wait for tom to roar. Then give him your best calling.\nWild turkeys, on the other hand, can fly very well. Unless you keep their wings clipped you need a totally enclosed cage. Two turkeys can be kept in a 90 square foot area that is at least 6 feet high. However the more room you can give your turkey the better.\nThere are many different breeds of turkeys, however there are two varieties, domestic and wild. The wild turkey lives and breeds in the wild and some are kept as pets. It can fly and is said to be smarter than the domestic. The domestic turkey is the type eaten on thanksgiving.", "key": "75_5", "timestamp": "2020-06-23 21:18:59.305401", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}