{"input_text": "An  isomerization  reaction involves the rearrangement of atoms within a single molecule to one of its  isomer s.  Some isomerization processes may occur spontaneously, resulting in an  equilibrium  between the isomers, and the position of the system generally favors an aromatic product if the process is itself an aromatization.  Amongst  keto-enol tautomers , the keto form is generally favoured on by thermodynamics, but in the case of cyclohexa-2,4-dienone its aromatic isomer  phenol  is strongly favoured.  The  equilibrium constant  for this system has been determined to be 10, meaning that in phenol there are 10 trillion molecules in the aromatic enol form for every molecule in the keto form.  Isomerization reactions are temperature dependent, for example melting 1,4-naphthalenediol at 200 °C produces a 2:1 mixture with its keto form, 1,4-dioxotetralin.  The conversion to the 1,4-dioxotetralin tautomer can be driven to completion when bound in a chromium tricarbonyl  piano stool complex .\nKduI is involved in  pectin  degradation by free-living  soil   bacteria  that use pectin as a  carbon  source, breaking it down to 2-keto-3-deoxygluconate, which can ultimately be converted to  pyruvate . KduI  catalyses  the fourth step in pectin degradation, namely the interconversion of 5-keto-4-deoxyuronate and 2,5-diketo-3-dexoygluconate. KduI has a  TIM-barrel   fold .\nThis enzyme belongs to the family of  oxidoreductase s, specifically those acting on the CH-OH group of donor with NAD or NADP as acceptor.  The  systematic name  of this enzyme class is 2-dehydro-3-deoxy-D-gluconate:NAD 5-oxidoreductase. Other names in common use include 2-keto-3-deoxygluconate 5-dehydrogenase, 2-keto-3-deoxy-D-gluconate dehydrogenase, 2-keto-3-deoxygluconate (nicotinamide adenine dinucleotide, (phosphate)) dehydrogenase, 2-keto-3-deoxy-D-gluconate (3-deoxy-D-glycero-2,5-hexodiulosonic, and acid) dehydrogenase.  This enzyme participates in  pentose and glucuronate interconversions .\nA no-carbohydrate diet (no-carb diet, zero carb diet) excludes dietary consumption of all  carbohydrates  (including  dietary fiber ) and suggests  fat  as the main source of energy with sufficient  protein . A no-carbohydrate diet may be  ketogenic , which means it causes the body to go into a state of  ketosis , converting dietary fat and  body fat  into  ketone bodies  which are used to fuel parts of the body that do not  oxidize fat  for energy, especially the  brain . Some bodily organs and parts of the brain still require  glucose , which is tightly regulated by the liver and adequately supplied by  gluconeogenesis  or by converting  glycerol  from the breakdown of  triglycerides . A no-carbohydrate diet may use mainly  animal source foods  and may include a high  saturated fat  intake, though this is not prescriptive of the diet, which, by definition, only restricts carbohydrate intake.\nThis enzyme belongs to the family of  oxidoreductase s, specifically those acting on CH or CH groups with NAD or NADP as acceptor. The  systematic name  of this enzyme class is CDP-4-dehydro-3,6-dideoxy-D-glucose:NAD(P) 3-oxidoreductase. Other names in common use include CDP-4-keto-6-deoxyglucose reductase, cytidine diphospho-4-keto-6-deoxy-D-glucose reductase, cytidine diphosphate 4-keto-6-deoxy-D-glucose-3-dehydrogenase, CDP-4-keto-deoxy-glucose reductase, CDP-4-keto-6-deoxy-D-glucose-3-dehydrogenase system, and NAD(P)H:CDP-4-keto-6-deoxy-D-glucose oxidoreductase. This enzyme participates in  starch and sucrose metabolism .\nA 2007 study demonstrated that administration of 7-keto-DHEA to overweight adults in conjunction with a calorie-restricted diet effectively reverses the decline in resting metabolic rate (RMR) normally associated with dieting. 7-Keto-DHEA demonstrated an ability to increase RMR by 1.4% above baseline levels and demonstrated a 5.4% increase in daily RMR when administered with a calorie-restricted diet.\nA cyclic ketogenic diet (or carb-cycling) is a  low-carbohydrate diet  with intermittent periods of high or moderate  carbohydrate  consumption. This is a form of the general ketogenic diet that is used as a way to maximize fat loss while maintaining the ability to perform high-intensity exercise. A  ketogenic diet  limits the number of grams of carbohydrate the dieter may eat, which may be anywhere between 0 and 50g per day. The remainder of the caloric intake must come primarily from fat sources, as well as protein sources, in order to maintain  ketosis . (Ketosis is the condition in which the body burns  fats  and uses  ketones  instead of glucose for fuel.)\nOne of the reactions KDPG Aldolase catalyzes, as in the  Entner–Doudoroff pathway , is the reversible cleavage of 2-keto-3-deoxy-6-phosphogluconate (KDPG) into  pyruvate  and  D-glyceraldehyde-3-phosphate . This occurs through a stereospecific  retro-aldol cleavage . A proton transfer between the zwitterionic pair Glu-45/Lys-133 in the active site activates Lysine to serve as the  nucleophile  in the first step and Glutamate to aid in the base catalysis involved in the carbon-carbon cleavage. Lysine Residue 133 serves as the nucleophile and attacks the carbonyl group of 2-Keto-3-deoxy-6-phosphogluconate to form a protonated carbinolamine intermediate, also known as a  Schiff base  intermediate.  The intermediate is stabilized by hydrogen bonding with residues in the active site. A three carbon residue,  glyceraldehyde 3-phosphate , is cleaved off through base catalysis with a water molecule and residue Glu-45. The  pyruvate  is generated through the nucleophilic attack of water on the Schiff-base to reform a ketone. Aromatic interaction with Phe-135 ensures the stereospecific addition involved in the reverse process.\nThe transaminase enzymes are important in the production of various amino acids, and measuring the  concentration s of various transaminases in the blood is important in the diagnosing and tracking many  disease s. Transaminases require the coenzyme  pyridoxal-phosphate , which is converted into  pyridoxamine  in the first phase of the reaction, when an amino acid is converted into a keto acid. Enzyme-bound  pyridoxamine  in turn reacts with  pyruvate ,  oxaloacetate , or  alpha-ketoglutarate , giving  alanine ,  aspartic acid , or  glutamic acid , respectively. Many transamination reactions occur in tissues, catalysed by transaminases specific for a particular amino/keto acid pair. The reactions are readily reversible, the direction being determined by which of the reactants are in excess. The specific enzymes are named from one of the reactant pairs, for example; the reaction between glutamic acid and pyruvic acid to make alpha ketoglutaric acid and alanine is called glutamic-pyruvic transaminase or GPT for short.\nSugar  can be characterized by having  reducing  or non-reducing ends. A  reducing end  of a carbohydrate is a carbon atom that can be in equilibrium with the open-chain  aldehyde  ( aldose ) or keto form ( ketose ). If the joining of monomers takes place at such a carbon atom, the free hydroxy group of the  pyranose  or  furanose  form is exchanged with an OH-side-chain of another sugar, yielding a full  acetal . This prevents opening of the chain to the aldehyde or keto form and renders the modified residue non-reducing. Lactose contains a reducing end at its glucose moiety, whereas the galactose moiety form a full acetal with the C4-OH group of glucose.  Saccharose  does not have a reducing end because of full acetal formation between the aldehyde carbon of glucose (C1) and the keto carbon of fructose (C2).\nThe use of a regimented diet is an approach that has been found to help control seizures in children with severe, medically intractable frontal lobe epilepsy. Although the use of dieting to prevent seizures from occurring is a lost treatment that has been replaced by the use of new types of anticonvulsants, it is still recommended to patients to this day. A  ketogenic diet  is a high-fat, low- carbohydrate  based diet that patients are typically asked to follow in conjunction with their anticonvulsant medications. This diet was designed in order to mimic many of the effects that starvation has on the metabolic functioning of the body. By limiting the amount of carbohydrates and increasing the amount of exogenous fats available to the  metabolism , the body will create an excess of water-soluble compounds known as  ketone bodies . Although the mechanism of action is still unknown, it is believed that these excessive amounts of ketone bodies become the brain's main source of energy and in turn are able to suppress the frequency of seizure occurrence.\nThis enzyme belongs to the family of  oxidoreductase s, specifically those acting on the CH-OH group of donor with NAD or NADP as acceptor. The  systematic name  of this enzyme class is GDP-6-deoxy-D-mannose:NAD(P) 4-oxidoreductase. Other names in common use include GDP-4-keto-6-deoxy-D-mannose reductase, GDP-4-keto-D-rhamnose reductase, and guanosine diphosphate-4-keto-D-rhamnose reductase. This enzyme participates in  fructose  and  mannose metabolism .\nThis enzyme belongs to the family of  lyase s, specifically the aldehyde-lyases, which cleave carbon-carbon bonds.  The  systematic name  of this enzyme class is 2-dehydro-3-deoxy-L-pentonate glycolaldehyde-lyase (pyruvate-forming). Other names in common use include 2-keto-3-deoxy-L-pentonate aldolase, 2-keto-3-deoxy-L-arabonate aldolase, 2-keto-3-deoxy-D-xylonate aldolase, 3-deoxy-D-pentulosonic acid aldolase, and 2-dehydro-3-deoxy-L-pentonate glycolaldehyde-lyase.  This enzyme participates in  fructose  and  mannose metabolism .\nBecause many of the medications that are effective in treating epilepsy are also effective as mood stabilizers, it has been suggested that the  ketogenic diet — used for treating pediatric  epilepsy — could have mood stabilizing effects. Ketogenic diets are diets that are high in fat and low in carbohydrates, and force the body to use fat for energy instead of sugars from carbohydrates. This causes a metabolic response similar to that seen in the body during fasting. This idea has not been tested by clinical research, and until recently, was entirely hypothetical. Recently, however, two case studies have been described where ketogenic diets were used to treat bipolar II. In each case, the patients found that the ketogenic diet was more effective for treating their disorder than medication and were able to discontinue the use of medication. The key to efficacy appears to be  ketosis , which can be achieved either with a classic high-fat ketogenic diet, or with a low-carbohydrate diet similar to the induction phase of the  Atkins Diet .  The mechanism of action is not well understood. It is unclear whether the benefits of the diet produce a lasting improvement in symptoms (as is sometimes the case in treatment for epilepsy) or whether the diet would need to be continued indefinitely to maintain symptom remission.\nIn Europe the  ketogenic diet  is the diet that is most commonly recommended by doctors for patients with epilepsy. In this diet the ratio of fat to carbohydrates and proteins is 4:1. That means that the fat content of the consumed food must be around 80%, the protein content must be around 15%, and the carbohydrate content must be around 5%. For comparison the average western diet consists of a  carbohydrate  content of over 50%. After one year on the ketogenic diet the success rate (seizure reduction over 50%) is between 30 and 50% and the dropout rate is around 45%. Although the ketogenic diet can be very effective some families report that it's not compatible with daily life on the long run because it's too restrictive as bread pasta and sweets are forbidden in the ketogenic diet. In puberty with increasing autonomy it can be difficult for adolescents to follow the diet strictly. For this reason a fat ratio of 3: 1 instead of 4: 1 can be recommended to make meals more palatable. Side effects of the ketogenic diet can be constipation tiredness and after a long term diet in one out of 20 patients kidney stones.\nKeto is a very low-carbohydrates, high-fat, adequate protein diet. The Ketogenic diet is almost 100 yeard old, it was use as a treatment for the epileptic patients in the 1920 and 1930s: http://en.wikipedia.org/wiki/Ketogenic_diet.f it's your first time doing a Ketogenic diet, it will take your body between 10 to 30 days to fully adapt to a Ketogenic metabolism. The reason why most people can't follow this diet is because of the adaptation phase.\nGet Your Personal Ketogenic Diet Recommendation. This calculator determines your optimal food intake for your personal weight loss goals on the ketogenic diet. Click for more! A ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet. It has a lot of health advantages compared to the standard western diet.Most people do keto because of the weight loss, but it also has other health advantages like lowering risk for heart disease, diabetes, cancer, stroke, and much more.his calculator determines your optimal food intake for your personal weight loss goals on the ketogenic diet. Click for more! A ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet.\nThis calculator determines your optimal food intake for your personal weight loss goals on the ketogenic diet. Click for more! A ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet.It has a lot of health advantages compared to the standard western diet.Most people do keto because of the weight loss, but it also has other health advantages like lowering risk for heart disease, diabetes, cancer, stroke, and much more.his calculator determines your optimal food intake for your personal weight loss goals on the ketogenic diet. Click for more! A ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet.\nInsulin is one of the most important aspects of your body that a Ketogenic diet focuses on. It is a hormone secreted by the pancreas that regulates the metabolism of fat and carbs, specifically in the blood. Its main job is to regulate the distribution of energy to the cells of the body from fat storage.r/keto is to start with 20g of net-carbs per day. This limit does a good job of eliminating junk foods, refined carbohydrates and any other â\u0080\u009cfatteningâ\u0080\u009d foods. The full premise of a keto diet is far more than just minimizing carbs, it is a lifestyle about overall health.\nHow to achieve a healthy low-carb lifestyle 46:42 How should you formulate a low-carb or keto diet exactly in order to maximize success? How much fat, protein and carbs should you eat? How to formulate a low-carb keto diet 48:32 Low-carb pioneer Dr. Eric Westman talks about how to formulate an LCHF diet, low carb for different medical conditions and common pitfalls among others.\nThe ketogenic diet is a special high-fat, low-carbohydrate diet that helps to control seizures in some people with epilepsy. It is prescribed by a physician and carefully monitored by a dietitian. It is stricter than the modified Atkins diet, requiring careful measurements of calories, fluids, and proteins. The name ketogenic means that it produces ketones in the body (keto = ketone, genic = producing).\nHow Too Much Protein is Bad for Ketosis. The biggest energy source on the ketogenic diet is fat. In fact, around 75% of your diet should come from healthy fat sources. The key here is that, unlike the traditional idea of low-carb diets where protein is higher, protein intake should be moderate, not high, on keto.\nAs far as the effect of 7-keto DHEA on weight loss is concerned, the supplement has been shown to increase resting metabolic rate in participants who already were on weight-loss diets and were engaging in regular exercise.\nThe problem is not with the diet; problem is with the side effects which this diet brings. In a chat with Business Insider, Ashishh Gupta, Director, Gold's Gym, Gurgaon we deconstruct the growing fad, Keto Diet. This process of dilution of fat is called ketosis, popularly known as keto diet or low carb high fat diet.\nConfidence votes 8. A keto diet is one where the body will drop into the state of ketosis at some point throughout the day. Generally, this is true for any diet that includes less than 100 daily grams of carbohydrates. However, many keto diets advocate eating far lower amounts of carbs in the 20-30 gram per day range.\nThe â\u0080\u009cketoâ\u0080\u009d diet is any extremely low-or no-carbohydrate diet that forces the body into a state of ketosis. The â\u0080\u009cK-E,â\u0080\u009d or keto enteral, diet is a very low-calorie liquid form of this diet eaten through a feeding tube.\nA Keto Diet for Beginners. A ketogenic diet, or keto diet, is a very low-carb diet, which turns the body into a fat-burning machine. It has many potential benefits for weight loss, health and performance, but also some potential initial side effects. A ketogenic diet is similar to other strict low-carb diets, like the Atkins diet or LCHF (low carb, high fat).\nA keto or ketogenic diet is a very low-carb diet, which turns the body into a fat-burning machine. It has many proven benefits for weight loss, health and performance, as millions of people have experienced already. 1\nPrivacy Policy | About Us. If this sounds familiar, it's probably because ketosis is also the goal of the first stage of the Atkins diet. But unlike the keto diet, the Atkins diet aims to get you into a mild state of ketosis and allows for more carbohydrates. In other words, keto is more hardcore.\nHow Does the Ketogenic Diet Work. Ketogenic diet ever popular. A ketogenic diet has become very popular with body builders and/or those wanting to lose weight. This diet allows one to lose fat weight without losing muscle mass, and in fact, while gaining muscle mass in the case of some body builders. A ketogenic diet, also referred to as a ketosis diet or a keto diet, forces the body to burn fat as its primary energy source instead of carbohydrates.\nThis approach is referred to as carb-loading. You basically remain on the standard keto diet five days out of the week (normally Monday through Friday). And on the weekends (typically 24 â\u0080\u0093 48 hours), you eat around 500 â\u0080\u0093 600 grams of carbs to replenish muscle glycogen.\nThese are keto foods as although they do contain some carbs, they are full of fibre. As keto dieters will know, you take aware the fibre content from the carb content to arrive at â\u0080\u009cnet carbsâ\u0080\u009d, Your net carbs are the figure you need to keep low in order to remain in ketosis. Broccoli. Spinach. Lettuce.\nStandard Ketogenic Diet. 1  SKD â\u0080\u0093 (Standard Keto Diet) The standard keto diet is eating high fats, medium protein and low carbs on a day to day basis. No exceptions! 2  As the most common of all types of keto diets. You want to limit your carb intake to 30 grams or less per day.\nKeto is short for ketogenic, and in the most basic terms, the keto diet is a high-fat, low-protein, VERY low-carb diet. When you consume very few carbs (under 30g), you induce a metabolic state called ketosis, in which your liver starts producing ketones from stored fatty acids, which are then used for energy.\nKeto for Fat Loss. As a fat loss tool, the ketogenic diet is certainly one of the most popular nutrition programs available. The reason it has such a dramatic effect on the body for weight loss is due to the reduction of carbohydrates to such a low percentage.\nKnowing what the best keto supplement is also means knowing what kind of keto dieter you are. There are three main types of Keto Diets: Standard, Targeted, Cyclical, and High-Protein. The main difference lies in the amount of carbs you target to take on a daily basis.\nWhat Can You Eat on a Keto Diet? Healthy Fat. This is the first thing you need to figure outâ\u0080¦there is a difference between good and bad fats! Healthy fats can make up the majority of your caloric intake when on a keto diet. When you are figuring out what to eat on a keto diet make sure you are including things like olive oil, coconut oil, nuts, seeds, and even grass-fed butters. Theyâ\u0080\u0099ll help stave off hunger and give you much needed energy.\n7-Day Vegetarian Keto Diet Meal Plan & Menu. A ketogenic diet is a diet that is low in carbohydrates, high in fat, and has a moderate level of protein. This is a detailed meal plan for the vegetarian ketogenic diet. Foods to eat, foods to avoid and a sample 7-day vegetarian keto diet meal plan & menu. Contents.\nSome people notice loose stools after changing their diet. A higher fat intake on a keto diet or other type of low carb diet, for instance, can cause loose stools. A sudden increase in fiber-rich foods on a vegetarian or vegan diet can also trigger bloating, gas, and loose stools.\nIf ketosis continues for long periods of time, serious damage to the liver and kidneys can occur, which is why most low-carbohydrate, or ketogenic diets recommend only short-term use, typically 14 days. 11/26/10 - 371 1/1/11 - 348. 11/26/10 - 371.1/1/11 - 348.11-29-2010, 11:36 AM #2. Cailin Deas.he dangers of protein to the kidneys would apply far more to a 40/40/20 diet than to a keto one. If they applied. But they don't. People with damaged kidneys can not tolerate high levels of protein. So some experts have extrapolated this to mean that high levels of protein can damage healthy kidneys.\nHowever, critics say that not only is this a very unhealthy way to lose weight, the diet is downright dangerous. The â\u0080\u009cketoâ\u0080\u009d diet is any extremely low-or no-carbohydrate diet that forces the body into a state of ketosis. The â\u0080\u009cK-E,â\u0080\u009d or keto enteral, diet is a very low-calorie liquid form of this diet eaten through a feeding tube.\nMany people following a keto LCHF diet are unsure about how much protein they should be eating. Itâ\u0080\u0099s a common belief that a low carb diet should be high in protein. As we all know, eating a LCHF keto diet means eating most of your calories as fat, not protein. On a LCHF keto diet [â\u0080¦]\nItâ\u0080\u0099s a common belief that a low carb diet should be high in protein. As we all know, eating a LCHF keto diet means eating most of your calories as fat, not protein. On a LCHF keto diet your macros (the composition of your diet) should look something like this: 70% fat/25% protein/5% carbs. You definitely donâ\u0080\u0099t want to be eating more than 30% of your calories as protein.\nThese foods are the basis of the ketogenic diet. A ketogenic diet is a low-carb, high-fat diet with an average intake of proteins. Basically, the keto diet is based on an extremely low intake of carbs and an increased intake of fats. The keto diet is not used only in the weight loss process, but also in some disease treatments.\nA keto diet is well known for being a low carb diet, where the body produces ketones in the liver to be used as energy. Itâ\u0080\u0099s referred to as many different names â\u0080\u0093 ketogenic diet, low carb diet, low carb high fat (LCHF), etc. When you eat something high in carbs, your body will produce glucose and insulin. 1  Glucose is the easiest molecule for your body to convert and use as energy so that it will be chosen over any other energy source. 2  Insulin is produced to process the glucose in your bloodstream by taking it around the body.\nFor many, the ketogenic diet seems like the perfect option â\u0080\u0093 eat a ton of cream and cheese, yet still lose weight? Living the dream. But what is the ketogenic diet, and which foods are you allowed to eat? Whatâ\u0080\u0099s the science behind it? The keto diet is also known as the low carb diet, and is based around placing the body into a state of ketosis. When we eat foods high in carbohydrates, such as sugary cereal, cake and bread, the body produces glucose and insulin.\nKetogenic diet. The ketogenic diet is a high-fat, adequate-protein, low-carbohydrate diet that in medicine is used primarily to treat difficult-to-control (refractory) epilepsy in children. The diet forces the body to burn fats rather than carbohydrates.\nKeto Bars is a snack replacement bar that is specifically designed for a ketogenic diet. It has no added sugar and is completely free from gluten and nuts. It contains whey protein concentrate as its source of protein and coconut plus heavy cream as its source of fat.\nThis is normal. Once your body becomes keto-adapted, your body will be able to fully utilize the fats as its primary source of energy. Many studies done have shown that there is no long term drop in performance for professional athletes on a very low carb ketogenic diet.ince the glucose is being used as a primary energy, your fats are not needed, and are therefore stored. Typically on a normal, higher carbohydrate diet, the body will use glucose as the main form of energy. By lowering the intake of carbs, the body is induced into a state known as ketosis.\nContrary to what many people believe, calories do count, even on a ketogenic diet. When you eat nutritious foods low in carbs, moderate in protein and high in fat, most people will naturally eat less. For this reason, most of you won't need to count calories on a keto diet. However, just following a ketogenic diet doesn't guarantee weight loss. It helps to keep an eye on your fat intake.\nBottom Line: The ketogenic diet (keto) is a low-carb, high-fat diet. It lowers blood sugar and insulin levels, and shifts the bodyâ\u0080\u0099s metabolism away from carbs and towards fat and ketones. Different Types of Ketogenic Diets\nKeto coffee is an excellent way to get in your caffeine without sugary creamers and other additives, while also increasing the fat. As you know, keto is a low-carb, high fat diet, so this is really important! Take a look at how to make keto coffee and what to add to it. What is Keto Coffee? Keto coffee is simply a way to make a low-carb, high-fat coffee that is keto friendly. As you will see in the next section, there are actually quite a few benefits to drinking this coffee in the morning.\nA ketogenic diet (keto) is a very low-carb diet, which turns the body into a fat-burning machine. It has many potential benefits for weight loss, health and performance, but also some potential initial side effects. A ketogenic diet is similar to other strict low-carb diets, like the Atkins diet or LCHF (low carb, high fat).\nThe keto diet (also known as ketogenic diet, low carb diet and LCHF diet) is a low carbohydrate, high fat diet. Maintaining this diet is a great tool for weight loss. More importantly though, according to an increasing number of studies, it helps reduce risk factors for diabetes, heart diseases, stroke, Alzheimerâ\u0080\u0099s, epilepsy, and more 1-6.\nA keto or ketogenic diet is a diet that causes your body to burn fat (in the form of ketones) rather than sugar (in the form of glucose/glycogen). Iâ\u0080\u0099ll explain a little more in detail below, but you basically do this by eating a lot of fat and very little carbohydrates.\ncutting through the fat. Keto Calculator. Keto Diet 101. The goal of the ketogenic (keto) diet is to make a lean body leaner by forcing the body to burn fat for fuel. Itâ\u0080\u0099s a high fat, low-carb diet that maintains moderate protein consumption.\nA keto diet is well known for being a low carb diet, where the body produces ketones in the liver to be used as energy. Itâ\u0080\u0099s referred to as many different names â\u0080\u0093 ketogenic diet, low carb diet, low carb high fat (LCHF), etc. When you eat something high in carbs, your body will produce glucose and insulin.", "key": "78_1", "timestamp": "2020-06-23 21:18:59.328662", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}