{"input_text": "Social psychology often employs the experimental method in an attempt to understand human social interaction.  Social psychology conducts its experiments both inside and outside of the laboratory. One notable social psychology experiment is the  Stanford prison experiment  conducted by  Philip Zimbardo  in 1971, although the extremity of this field experiment is not prototypical of the field. Another notable study is the  Stanley Milgram  obedience experiment, often known as the  Milgram experiment .\nThe study of compliance is often recognized for the overt demonstrations of dramatic experiments such as the Stanford prison experiment and the Stanley Milgram shock experiments.  These experiments served as displays of the psychological phenomena of compliance.  Such compliance frequently occurred in response to overt social forces and while these types of studies have provided useful insight into the nature of compliance, today's researchers are inclined to concentrate their efforts on subtle, indirect and/or unconscious social influences.\nThe  Milgram experiment  is the name of a 1961 experiment conducted by American psychologist  Stanley Milgram . In the experiment Milgram had an authority figure order research participants to commit a disturbing act of harming another person. After the experiment he would reveal that he had deceived the participants and that they had not hurt anyone, but the research participants were upset at the experience of having participated in the research. The experiment raised broad discussion on the ethics of recruiting participants for research without giving them full information about the nature of the research.\nResearch has been conducted unethically in other experiments, not in regard to torture but in cases of consent, deception, privacy, and confidentiality. Such experiments include: the  Milgram Experiment  of 1961 (electric shock treatment),  Humphrey's Tearoom Trade  of 1970 (male on male sexual encounters), and the  Zimbardo Guard Study  of 1971 (college student simulated prison experiment) just to name a few. In these experiments the subjects did not always know what they were getting into or were not all voluntarily participating.\nFormal review procedures for institutional human subject studies were originally developed in direct response to research abuses in the 20th century. Among the most notorious of these abuses were the  experiments of Nazi physicians , which became a focus of the post-World War II  Doctors' Trial , the  Tuskegee Syphilis Study , a long-term project conducted between 1932 and 1972 by the  U.S. Public Health Service , and numerous  human radiation experiments  conducted during the  Cold War .  Other controversial U.S. projects undertaken during this era include the  Milgram obedience experiment , the  Stanford prison experiment , and  Project MKULTRA , a series of classified  mind control  studies organized by the  CIA .\nP. van Lange, a  social psychologist  at the  Vrije Universiteit   Amsterdam  pointed out the similarity to the  Stanford Prison Experiment  (1971). In that experiment the participants were placed in a jail, where half played guards and the other half prisoners. In six days the experiment derailed. The guards became  aggressive ,  repressive  and  sadistic . They transformed into personalities outside their normal selves. \"From the Stanford-experiment may be concluded that human behavior is largely summoned by the local circumstances\", added his colleague J. van der Pligt, professor at the  Universiteit van Amsterdam .\"People get carried away,\" said A. Bergsma of Psychologie Magazine. \"Isolation becomes reality. They lose themselves in the experiment. There are no checks and balances. If there is no correction, they will derail one after another.\"  All experts agreed that the big reward for the winner increased the chance of accidents. But not all had a negative opinion. A. Lange, a professor of clinical psychology at the Universiteit van Amsterdam indicated that the program could produce certain insights not possible to achieve any more in socio-psychological research because the psychological well-being of the participant had been given greater importance. \"The  design  of the programme is the  wet dream  of a psychological researcher. Nowhere in the world an ethical commission will be found that would agree to such a design\", agreed psycho-physiologist A. Gaillard of the  Netherlands Organisation for Applied Scientific Research .\nThe Wave is not the only movie to convert a social experiment conducted in the United States into a fictionalized plot. The  Stanford prison experiment  of 1971 was adopted for the 2001 production  Das Experiment  by Oliver Hirschbiegel, and the 2015 production directed by  Kyle Patrick Alvarez ,  The Stanford Prison Experiment . Gansel's Wave is based on teacher Ron Jones's  \"Third Wave\" experiment , which took place at a Californian school in 1967. Because his students did not understand how something like  national socialism  could even happen, he founded a  totalitarian , strictly-organized \"movement\" with harsh punishments that was led by him autocratically. The intricate sense of community led to a wave of enthusiasm not only from his own students, but also from students from other classes who joined the program later. Jones later admitted to having enjoyed having his students as followers. To eliminate the upcoming momentum, Jones aborted the project on the fifth day and showed the students the parallels towards the Nazi youth movements.\nIn her analysis of the comics, Sharon Packer M.D. made connections between Cage's origin story and historical events taking place in the time of the comics' publication. Carl Lucas uses his newfound power to crash through the prison’s cement barricades, he symbolically breaks through barriers that were once closed to him, similar to other black people of his era. Luke Cage’s story has a distinct connection to unethical medical experiments; his comics presumably enhanced awareness of the  Tuskegee syphilis experiments  that made New York Times headlines in the very same month and year that Luke Cage debuted. Dr. Altman published a book on self-experimentation ethics, one of many texts discussing ethical breaches in medical experiments at that time, meaning that the Luke Cage stories likely picked up on the rhetoric on prison experiments during that time and tapped into opprobrium about ethics. Since his comics were released at the same time that the news broke about the Tuskegee syphilis experiments on black men in Alabama, an event which caused public outrage and swayed public opinion against non-consenting or coercive human experimentation, it can be inferred that Luke Cage’s story influenced some of the aforementioned public opinion.\nToday moral psychology is a thriving area of research in both philosophy and psychology, even at an  interdisciplinary  level.  For example, the psychologist  Lawrence Kohlberg  questioned boys and young men about their thought processes when they were faced with a  moral dilemma  producing one of many very useful empirical studies in the area of moral psychology. As another example, the philosopher  Joshua Knobe  recently completed an empirical study on how the way in which an ethical problem is phrased dramatically affects an individual's intuitions about the proper moral response to the problem. More conceptually focused research has been completed by researchers such as John Doris. Doris (2002) discusses the way in which  social psychological  experiments—such as the  Stanford prison experiment s involving the idea of  situationism —call into question a key component in  virtue ethics : the idea that individuals have a single, environment-independent moral character. As a further example,  Shaun Nichols  (2004) examines how empirical data on psychopathology suggests that  moral rationalism  is false.\nHumans have been shown to be obedient in the presence of perceived legitimate  authority  figures, as shown by the  Milgram experiment  in the 1960s, which was carried out by Stanley Milgram to find out how the  Nazis  managed to get ordinary people to take part in the mass murders of the  Holocaust . The experiment showed that obedience to authority was the norm, not the exception. Regarding obedience, Milgram said that \"Obedience is as basic an element in the structure of social life as one can point to; Some system of authority is a requirement of all communal living, and it is only the man dwelling in isolation who is not forced to respond, through defiance or submission, to the commands of others.\" A similar conclusion was reached in the  Stanford prison experiment .\nThe Stanford prison experiment was in part a response to the  Milgram experiment  at Yale beginning in 1961 and published in 1963.\nGerman philosopher and anthropologist of law Axel Montenbruck wrote that dehumanization is inextricably linked with both the \" techniques of neutralization \" (David Matza/ Gresham Sykes ) and to the obedience aspects of the  Milgram experiment  and in a wider sense with  Philip Zimbardo 's  Stanford prison experiment .\nWhile most major controversies about unethical research were focused on biomedical sciences, there were also controversies involving behavioral, psychological, and sociological experiments such as: the  Milgram obedience experiment ,  Stanford prison experiment ,  Tearoom Trade  study, and others. There were also ethical issues related to the  CIA 's  Project MKULTRA .\nLater, Milgram and other psychologists performed variations of the experiment throughout the world, with similar results. Milgram later investigated the effect of the experiment's locale on obedience levels by holding an experiment in an unregistered, backstreet office in a bustling city, as opposed to at Yale, a respectable university. The level of obedience, \"although somewhat reduced, was not significantly lower.\" What made more of a difference was the proximity of the \"learner\" and the experimenter. There were also variations tested involving groups.\nThe other classical study on obedience was conducted at  Stanford University  during the 1970s.  Phillip Zimbardo  was the main psychologist responsible for the experiment. In the  Stanford Prison Experiment , college age students were put into a pseudo prison environment in order to study the impacts of \"social forces\" on participants behavior. Unlike the Milgram study in which each participant underwent the same experimental conditions, here using  random assignment  half the participants were prison guards and the other half were prisoners. The experimental setting was made to physically resemble a prison while simultaneously inducing \"a psychological state of imprisonment\".\nSome of the guards' behaviour led to dangerous and psychologically damaging situations. One third of the guards were judged to have exhibited \"genuine sadistic tendencies\", while many prisoners were emotionally traumatized; five of them had to be removed from the experiment early. After Maslach confronted Zimbardo and forced him to realize that he had been passively allowing unethical acts to be performed under his supervision, Zimbardo concluded that both prisoners and guards had become grossly absorbed in their roles and realized that he had likewise become as grossly absorbed in his own, and he terminated the experiment. Ethical concerns surrounding the experiment often draw comparisons to a  similar experiment , conducted ten years earlier in 1961 at  Yale University  by  Stanley Milgram .\nBoth the Milgram and Stanford experiments were conducted in experimental circumstances. In 1966, psychiatrist Charles K. Hofling published the results of a  field experiment  on obedience in the nurse–physician relationship in its natural hospital setting. Nurses, unaware they were taking part in an experiment, were ordered by unknown doctors to administer dangerous doses of a (fictional) drug to their patients. Although several hospital rules disallowed administering the drug under the circumstances, 21 out of the 22 nurses would have given the patient an overdose of medicine.\nPerhaps most damning to the traditional view of character are the results of the experiments conducted by  Stanley Milgram  in the 1960s and  Philip G. Zimbardo  in 1971. In the first of these experiments, the great majority of subjects, when politely though firmly requested by an experimenter, were willing to administer what they thought were increasingly severe electric shocks to a screaming \"victim.\" In the second, the infamous  Stanford prison experiment , the planned two-week investigation into the psychology of prison life had to be ended after only six days because the college students who were assigned to act as guards became sadistic and those who were the \"prisoners\" became depressed and showed signs of extreme stress. These and other experiments are taken to show that if humans do have noble tendencies, they are narrow, \"local\" traits that are not unified with other traits into a wider behavioral pattern of being.\nMilgram argued (in  Obedience to Authority: An Experimental View ) that the ethical criticism provoked by his experiments was because his findings were disturbing and revealed unwelcome truths about  human nature . Others have argued that the ethical debate has diverted attention from more serious problems with the experiment's  methodology . Australian psychologist Gina Perry found an unpublished paper in Milgram's archives that shows Milgram's own concern with how believable the experimental set-up was to subjects involved. Milgram asked his assistant to compile a breakdown of the number of participants who had seen through the experiments. This unpublished analysis indicated that many subjects suspected that the experiment was a  hoax , a finding that casts doubt on the veracity of his results. In the journal  Jewish Currents , Joseph Dimow, a participant in the 1961 experiment at Yale University, wrote about his early withdrawal as a \"teacher\", suspicious \"that the whole experiment was designed to see if ordinary Americans would obey immoral orders, as many Germans had done during the Nazi period.\"\nSome notable situationist studies include:  Zimbardo 's  Stanford prison experiment ,  bystander  experiments,  obedience  experiments like  Milgram experiment  and heat and  aggression  experiments. The term is popularly associated with  Walter Mischel , although he himself does not appear to like the term.\nApart from the obvious metaphor that life is a game of chess, the episode deals with conformity and pressures to conform, particularly  peer pressure . Parallels have been drawn with the  Milgram experiment ,  Asch conformity experiments  and the  Stanford prison experiment . Similar techniques are used to make Number 6 conform, hoping he will reveal the secret of his resignation.However, Number 6 discovers, as usual, that his trust is  misplaced  and the distinction between prisoner and warder remains blurred.\nIn  The Journal of the American Medical Association ,  Zimbardo's situational perspective received support from other social situational experiments that demonstrated the same idea and concept. Almost ten years prior to the Stanford Prison Experiment (1971),  Stanley Milgram  conducted research on obedient behavior in 1965 that embraced situational forces. Milgram had \"teachers\" that delivered mock electric shocks to the \"learner\" for every wrong answer that was given in a multiple choice test. The teachers, however, did not know that the electric shocks were not real, and still delivered them to the learners. At the end of the experiment, 65% of men ages 20–50 complied fully up to the very last voltage. In the same room as the teacher, there was a \"confederate\" that kept tabs on the teacher and if they were delivering the shocks to each wrong answer. In the beginning of the study, participants signed a waiver that clearly explained the ability to opt out of the experiment and not deliver the shocks. But with the surprising result rate of teachers who did continue to shock the learners, there was a situational force. The situational force that influenced the teachers to continue was the voice of the confederate egging them on by phrases such as, \"I advise you to continue with this experiment\" or \"I am telling you to continue delivering the shocks\" and the one that caught most teachers was \"You must continue with the shocks.\" Although the teachers knew that they could leave the experiment at any point in time, they still continued when they felt uncomfortable because of the confederate's voice demanding they proceed.\nHuman subject research legislation in the United States can be traced to the early 20th century.  Human subject research in the United States  was mostly unregulated until the 20th century, as it was throughout the world, until the establishment of various governmental and professional regulations and  codes of ethics . Notable – and in some cases, notorious – human subject experiments performed in the US include the  Tuskegee syphilis experiment ,  human radiation experiments , the  Milgram obedience experiment  and  Stanford prison experiment s and  Project MKULTRA . With growing public awareness of such experimentation, and the evolution of professional ethical standards, such research became regulated by various legislation, most notably, those that introduced and then empowered the  institutional review board s.\nParallels can be drawn to the supposed 'group experiment' element of  Big Brother  which Space Cadets draws on, and in wider terms  propaganda ,  subliminal advertising , and the  consensus nature of reality . See also:  Asch conformity experiments ,  Milgram experiment  and the  Stanford prison experiment .\nBurger's first study had results similar to the ones found in Milgram's previous study. The rates of obedience were very similar to those found in the Milgram study, showing that participants' tendency to obey has not declined over time. Additionally, Burger found that both genders exhibited similar behavior, suggesting that obedience will occur in participants independent of gender.In Burger's follow-up study, he found that participants that worried about the well being of the learner were more hesitant to continue the study. He also found that the more the experimenter prodded the participant to continue, the more likely they were to stop the experiment.The Utrecht University study also replicated Milgram's results. They found that although participants indicated they did not enjoy the task, over 90% of them completed the experiment.The Bocchiaro and Zimbardo study had similar levels of obedience compared to the Milgram and Utrecht studies. They also found that participants would either stop the experiment at the first sign of the learner's pleas or would continue until the end of the experiment (called \"the foot in the door scenario\").In addition to the above studies, additional research using participants from different cultures (including Spain, Australia, and Jordan) also found participants to be obedient.\nThe practice of deception has been challenged by some psychologists who maintain that deception under any circumstances is unethical, and that other research strategies (e.g.,  role-playing ) should be used instead. Unfortunately, research has shown that role-playing studies do not produce the same results as deception studies and this has cast doubt on their validity. In addition to deception, experimenters have at times put people into potentially uncomfortable or embarrassing situations (e.g., the  Milgram experiment  and  Stanford prison experiment ), and this has also been criticized for ethical reasons.\nSocial psychologists use experimental methods, both within and outside the laboratory, in an attempt to understand human social interaction. Two widely cited experiments in social psychology experiment are the Stanford prison experiment conducted by Philip Zimbardo in 1971 and the Milgram obedience experiment by Stanley Milgram.\nSocial psychology conducts its experiments both inside and outside of the laboratory. One notable social psychology experiment is the Stanford prison experiment conducted by Philip Zimbardo in 1971, although the extremity of this field experiment is not prototypical of the field.Another notable study is the Stanley Milgram obedience experiment, often known as the Milgram experiment.n the latter half of the 20th century, the phrase experimental psychology had shifted in meaning due to the expansion of psychology as a discipline and the growth in the size and number of its sub-disciplines.\nThe Stanford prison experiment was in part a response to the Milgram experiment at Yale beginning in 1961 and published in 1963. The Third Wave was a 1967 recreation of Nazi Party dynamics by high school teacher Ron Jones in Palo Alto, California. The Experiment (2010), is a film released by Inferno Distribution which is an English-language remake of the 2001 film Das Experiment. 2  Prison School (first published February 7, 2011) is a Japanese serialized manga that heavily references the Stanford Prison Experiment as the inspiration for Kate's revenge plot.\nIn other cases, these experiments were also quite controversial. Some of the most famous examples include Milgram's obedience experiment and Zimbardo's prison experiment. Explore some of these classic psychology experiments to learn more about some of the best-known research in psychology history. Pavlov's experiments still stands as one of the most famous in psychology.\nThe Stanford prison experiment (SPE) was a study of the psychological effects of becoming a prisoner or prison guard. The experiment was conducted at Stanford University on August 14â\u0080\u009320, 1971, by a team of researchers led by psychology professor Philip Zimbardo.sychologists Alex Haslam and Steve Reicher conducted the BBC Prison Study in 2002 and was published in 2006. This was a partial replication of the Stanford prison experiment conducted with the assistance of the BBC, which broadcast events in the study in a documentary series called The Experiment.\nThe Stanford prison experiment was in part a response to the Milgram experiment at Yale beginning in 1961 and published in 1963. The Third Wave was a 1967 recreation of Nazi Party dynamics by high school teacher Ron Jones in Palo Alto, California.sychologists Alex Haslam and Steve Reicher conducted the BBC Prison Study in 2002 and was published in 2006. This was a partial replication of the Stanford prison experiment conducted with the assistance of the BBC, which broadcast events in the study in a documentary series called The Experiment.", "key": "37_5", "timestamp": "2020-06-23 21:18:59.049927", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}