{"input_text": "The idea that  Benjamin Franklin  preferred the turkey as the national bird of the United States comes from a letter he wrote to his daughter Sarah Bache on January 26, 1784. The main subject of the letter is a criticism of the  Society of the Cincinnati , which he likened to a  chivalric order , which contradicted the ideals of the newly founded American  republic . In one section of the letter, Franklin remarked on the appearance of the  bald eagle  on the Society's crest:\nContrary to popular legend, there is no evidence that  Benjamin Franklin  ever publicly supported the  wild turkey  (Meleagris gallopavo), rather than the bald eagle, as a symbol of the United States. However, in a letter written to his daughter in 1784 from Paris, criticizing the  Society of the Cincinnati , he stated his personal distaste for the bald eagle's behavior. In the letter Franklin states:\nThe  bald eagle  has inspired millions of Americans across the nation since June 20, 1782. The American Eagle Day was celebrated ideally for the recovery and restoration of this exclusive bird. On June 28, 2007, the Department of the Interior has taken the bald eagle off the endangered and threatened species list. In addition, these birds have become a national symbol. The second Constitutional congress decided upon using American bald eagles as the great seal of the United States. There were many disagreements with the choice of national symbol. For example, one of the  founding fathers ,  Benjamin Franklin  quoted, \"I wish that the bald eagle had not been chosen as the representative of our country, he is a bird of bad moral character...Besides he is a rank coward...\" He thought that the national bird should have been a  wild turkey , because it is \"A bird of courage\".  In contrast, John F. Kennedy stated, \"The Founding Fathers made an appropriate choice when they selected the bald eagle as the emblem of the nation. The fierce beauty and proud independence of this great bird aptly symbolizes the strength and freedom of America.\"\nMint Director Nellie Tayloe Ross had long been an admirer of Benjamin Franklin, and wished to see him on a coin. In 1933, Sinnock had designed a medal featuring Franklin, which may have given her the idea.  Franklin had opposed putting portraits on coins; he advocated proverbs about which the holder could profit through reflection. In a 1948 interview, Ross noted that Franklin only knew of living royalty on coins, and presumably would feel differently about a republic honoring a deceased founder.  Indeed, Franklin might have been more upset at the reverse design: as  numismatic  writer Jonathan Tepper noted, \"Had Benjamin Franklin known that he would be appearing on a half dollar with an eagle, he most likely would have been quite upset.  He detested the eagle, and numismatic lore has it that he often referred to it as a scavenger. Given the practical man that he was, Franklin proposed the wild turkey as our national bird.\"\nThe wild turkey is a native bird of North America. As a result, Benjamin Franklin claimed this made the turkey a more suitable national bird for the United States than the bald eagle. Not everyone agreed with Franklin, however, and the bald eagle became the national emblem for the United States in 1782.he wild turkey is a native bird of North America. As a result, Benjamin Franklin claimed this made the turkey a more suitable national bird for the United States than the bald eagle. Not everyone agreed with Franklin, however, and the bald eagle became the national emblem for the United States in 1782.\nIn the late 1770â\u0080\u0099s, Benjamin Franklin suggested that the turkey should be the symbol for the fledgling United States. He argued that the bald eagle was no better than a pirate and a fish-eater (mostly true). The American turkey lost to the bald eagle by a single congressional vote. Native Americans in the Southwest and Mexico kept turkeys for feathers and food, and the birds, with their alarm calls, probably were good watch dogs as well. The Indians used the feathers in ceremonies, and they twisted and plaited the feathers with twine to form blankets.\n1 After this, the congress was called the Congress of the Confederation. 2  In the First Continental Congress, Patrick Henry, a delegate from Virginia, made the bold statement that I am not a Virginian, I am an American.3  At the time of the congress, there were around 2.5 million people living in the United States. John Adams and Thomas Jefferson chose the bald eagle as the symbol of the United States. 2  Ben Franklin wanted to use the turkey. 3  In addition to the thirteen colonies, the northern colonies of Quebec, St. John's Island, and Nova Scotia were all invited to the Second Continental Congress.\n1 John Adams and Thomas Jefferson chose the bald eagle as the symbol of the United States. 2  Ben Franklin wanted to use the turkey. 3  In addition to the thirteen colonies, the northern colonies of Quebec, St. John's Island, and Nova Scotia were all invited to the Second Continental Congress.\nThe bald eagle is the symbol of the United States and a source of pride for much of the nation. However, one of most famous founding fathers, Benjamin Franklin, hated the idea of the bald eagle as the national symbol. Benjamin Franklin said, I wish the eagle had not been chosen as the representative of this country.\nThe turkey! The turkey is â\u0080\u009ca much more respectable bird and a true native of the country.â\u0080\u009d. In truth, both species are natives of the United States. The bald eagle was chosen because it stands for strength, courage and freedom. Although the turkey was not chosen for our national symbol, it is the symbol of one of our most famous national holidays, Thanksgiving.\nThe eagle on the badge of the Society of the Cincinnati Medal looked more like a turkey, which prompted Franklin to compare the two birds as a symbol for the United States. Franklin's Letter to His Daughter (excerpt) For my own part I wish the Bald Eagle had not been chosen the Representative of our Country.\nThe eagle on the badge of the Society of the Cincinnati Medal looked more like a turkey, which prompted Franklin to compare the two birds as a symbol for the United States. For my own part I wish the Bald Eagle had not been chosen the Representative of our Country. He is a Bird of bad moral Character.\nTom Turkey (NOT named by Ben Franklin after Thomas Jefferson) Happy Thanksgiving to all. A myth has it that the bird was given this name by Ben Franklin, who wanted the turkey to be our national bird and (after losing out to the bald eagle) nicknamed the turkey after Thomas Jefferson.\nBy Tom Angleberger. Q: Just got this bit of info: Ben Franklin wanted our national bird to be a turkey, but Thomas Jefferson opposed him with the bald eagle. Franklin then coined the male turkey as â\u0080\u009cTomâ\u0080\u009d to spite Jefferson. Tom Turkey has been around ever since.\nWild Turkey. Meleagris gallopavo. Wild turkeys, with their distinctive feathers and gobbling call, were Benjamin Franklin's choice for the national bird of the United States. Photograph courtesy Gary M. Stolz/U.S.eleagris gallopavo. Wild turkeys, with their distinctive feathers and gobbling call, were Benjamin Franklin's choice for the national bird of the United States. Photograph courtesy Gary M. Stolz/U.S.\nWild Turkey. Meleagris gallopavo. Wild turkeys, with their distinctive feathers and gobbling call, were Benjamin Franklin's choice for the national bird of the United States. Photograph courtesy Gary M. Stolz/U.S.ild Turkey Range. The turkey was Benjamin Franklin's choice for the United States's national bird. The noble fowl was a favored food of Native Americans. When Europeans arrived, they made it one of only two domestic birds native to the Americasâ\u0080\u0094the Muscovy duck shares the distinction.\nDomestic or tame turkeys weigh twice what a wild turkey does and are raised on farms for profit. Most domestic turkeys are so heavy they are unable to fly. Wild turkeys (Meleagris gallopavo) live in woods in parts of North America and are the largest game birds found in this part of the world.They spend their days foraging for food like acorns, seeds, small insects and wild berries.n fact, Benjamin Franklin wanted to make the wild turkey, not the Bald Eagle, the national bird of the United States! The turkey's popularity comes from the American people's love of eating the bird for special occasions like Thanksgiving and Christmas.\nWild turkeys, with their distinctive feathers and gobbling call, were Benjamin Franklin's choice for the national bird of the United States.ild Turkey Range. The turkey was Benjamin Franklin's choice for the United States's national bird. The noble fowl was a favored food of Native Americans. When Europeans arrived, they made it one of only two domestic birds native to the Americasâ\u0080\u0094the Muscovy duck shares the distinction.\nThe head of the bird is white, the body of the bird is black, and the tail is white. The feet are a dull orange and its beak is yellow. The Bald Eagle is a large fierce looking bird. It's name in Latin means the sea eagle with a white head. It is the national symbol of the United States of America. Benjamin Franklin had suggested that the national symbol be the Wild Turkey, because the Bald Eagle was a bird of bad moral character, but he was outvoted. Today it is seen on many things in the United States, such as money, seals, and other patriotic symbols. The Bald Eagle generally lives forty-five to fifty years in captivity and twenty-five years in the wild. It is one of the largest flying birds seen in the United States. It stands between 30.4 and 36.4 inches tall, or about as high as an average office desk. It has a five and a half to eight foot wing span. That's about as long as a big dining room table.\nBen Franklin was not in favor of having the Bald Eagle as the national symbol, and would have opted for the wild turkey. As a naturalist, Ben Franklin realized that bald eagles were prone to scavengers and piracy. Eagles steal the spoils of its lesser cousin the Osprey.\nBest Answer: Turkeys have been a symbol of thanksgiving and abundance long before the Piligrimâ\u0080\u0099s â\u0080\u009dfirst mealâ\u0080\u009d in 1621 with the Native Americans. Native American Indians view the turkey as a both a symbol of abundance and fertility.The turkey was the guest of honor (sacrificial, that is) in various fertility and gratitude ceremonies.o the Lenape, the turkey is called the giving bird. It was used for food, as well as it's feathers. Here in the East, before the Europeans came, eagles weren't seen as often as the turkey. And the eagle was seen as a scavenger. The feathers were used to make capes.", "key": "75_6", "timestamp": "2020-06-23 21:18:59.307459", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}