{"input_text": "There is currently no robust estimate of the global whale shark population. The species is considered  endangered  by the  IUCN  due to the impacts of fisheries, bycatch losses, and vessel strikes, combined with its long life span and late maturation. It is listed, along with six other species of sharks, under the  CMS   Memorandum of Understanding on the Conservation of Migratory Sharks . In 1998, the Philippines banned all fishing, selling, importing, and exporting of whale sharks for commercial purposes, followed by India in May 2001, and Taiwan in May 2007.\nHarmless to humans, the smalltail shark is  caught incidentally  by  gillnet  and  longline   fisheries  throughout its range. The meat is sold fresh, frozen, or dried and salted. In addition, the dried fins are exported for use in  shark fin soup , the  liver oil  and  cartilage  are used medicinally, and the carcass is processed into  fishmeal . In 2006, the  IUCN  assessed this species, including Pacific populations now separated as C. cerdale, as  Data Deficient  due to a lack of fishery data. In Trinidad, its abundance makes it the most economically important shark. Off northern Brazil, substantial numbers are caught by gillnet fisheries targeting the  Serra Spanish mackerel  (Scomberomorus brasiliensis). In the 1980s, this species constituted roughly 43% of the  shark and ray  catch, but has since declined to around 17%. This apparent decline is thought to have resulted from increasing fishing effort, the large proportion of juveniles captured, and the shark's low reproductive rate. Consequently, the IUCN has assessed the smalltail shark in Brazil as  Vulnerable , and noted the urgent need for conservation measures given that northern Brazil represents the center of the species' range. Although the smalltail shark was ostensibly given protection by inclusion on the 2004 Official List of Endangered Animals in Brazil, fishing remains effectively unmanaged.\nThe \"Shark World\" exhibit is a huge exhibit containing  of water, and featuring 20  shark  species, rays and corals. The exhibit has a huge viewing window, an underwater tunnel and an interactive explanations area with educational stations about the importance of sharks and the threats that make sharks endangered.\nAlmost nothing is known about the natural history of the Borneo shark. It is  viviparous  like other requiem sharks; the females bear litters of six pups, which are provisioned through  gestation  by a  placenta l connection. The  International Union for Conservation of Nature  last assessed this species as  Endangered , at which time it had not been seen since 1937. While an extant population has since been found, the Borneo shark continues to merit conservation concern given its highly limited range within heavily fished waters.\nThe shark has no major importance to humans. It is not an endangered species and is not used as a common food supply. It is, however, useful when scientists are hoping to study bottom-dwelling sharks and can be vulnerable to being caught as  bycatch . It also does not pose any danger to humans. In October 2011. a man was 'bitten' by a Port Jackson shark at  Elwood  Beach near  Melbourne . The bite did not pierce the skin and the man was able to swim away while the shark was latched on to his calf.\nWhile fins from many shark species are used in the trade, certain shark species have been identified over the centuries as supplying the tastiest and most succulent fins. The shark-like rays (the sawfishes and  shovelnose ray s) supply the highest quality fin. As observed by one of the leading treatises on shark trade, \"The ... fins ... from the white-spotted guitarfish [ Rhynchobatus  spp.] are considered to be most valuable. The preferred shark species for fins are  tiger ,  mako , sawfish,  sandbar ,  bull ,  hammerhead ,  blacktip ,  porbeagle ,  thresher  and  blue shark .\" The fins from the critically endangered sawfishes \"are highly favored in Asian markets and are some of the most valuable shark fins.\" Sawfishes are now protected under the highest protection level of the Convention on International Trade in Endangered Species ( CITES ), Appendix I, but given the great volume of the shark fin trade, and that detached shark fins are difficult to identify, it is unlikely that CITES protection will prevent sawfish fins from entering the trade.\nThe fauna found here include:70 species of  sponges  are found. Coral  52 species including 42 species of  hard coral  and 10 species of  soft coral . Jellyfish ,  Portuguese man of war  and  sea anemones  are other coelentrates found here. Arthropods  include 27 species of  prawns , 30 species of  crabs ,  lobsters ,  shrimps  and other  crustaceans . Molluscs  like  pearl oysters  and  sea slugs  are present.  Octopus  which change colour are also found. Echinoderms  like  starfish ,  sea cucumbers  and  sea urchins  are present.The fishes found are  puffer fishes ,  sea horse ,  sting ray ,  mudskippers  and  whale sharks  which are an endangered species.Endangered sea turtles such as  green sea turtles ,  olive ridleys  and  leatherbacks  are seen here. There are three species of  sea snakes .There are  dugong s and smaller  cetacean s like  finless porpoise s,  common dolphin s,  bottlenose dolphin s and  Indo-Pacific humpback dolphin s. Larger whales such as  blue whale s,  sei whale s are seen.  Humpback whale s, and  sperm whale s may have been almost wiped out due to illegal whaling by the  Soviet Union  and  Japan .  Whale shark s can be found in deeper areas. A surprisingly large scale  greater flamingo  colony, reaching up to 20,000 nests is known to occur along the gulf. There are 42 islands in the  Arabian Sea  with coral reefs and the park is situated in one of those.\nThe sand tiger shark (Carcharias taurus), grey nurse shark, spotted ragged-tooth shark, or blue-nurse sand tiger is a species of shark that inhabits subtropical and temperate waters worldwide. It inhabits the  continental shelf , from sandy shorelines (hence the name sand tiger shark) and submerged reefs to a depth of around . They dwell in the waters of Japan, Australia, South Africa, the  Mediterranean  and the east coasts of North and South America. Despite its name, it is not related to the  tiger shark  Galeocerdo cuvier; however, it is a cousin of the  great white shark  Carcharodon carcharias. Despite its fearsome appearance and strong swimming ability, it is a relatively placid and slow-moving shark with no confirmed human fatalities. This species has a sharp, pointy head, and a bulky body. The sand tiger's length can reach . They are grey with reddish-brown spots on their backs. Shivers (groups) have been observed to hunt large schools of fish. Their diet consists of bony fish,  crustaceans ,  squid ,  skates  and other  sharks . Unlike other sharks, the sand tiger can gulp air from the surface, allowing it to be suspended in the  water column  with minimal effort. During pregnancy, the most developed  embryo  will feed on its siblings, a reproductive strategy known as  intrauterine cannibalism  i.e. \"embryophagy\" or, more colorfully,  adelphophagy  — literally \"eating one's brother\". The sand tiger is categorized as vulnerable on the  International Union for Conservation of Nature Red List . It is the most widely kept large shark in public  aquariums  owing to its tolerance for captivity.\nThis species is therefore listed as  vulnerable  on the International Union for Conservation of Nature Red List, and as endangered under Queensland's  Nature Conservation Act 1992 . It is a U.S. National Marine Fisheries Service [Species of Concern], which are those species that the U.S. Government’s National Oceanic and Atmospheric Administration,  National Marine Fisheries Service  (NMFS), has some concerns regarding status and threats, but for which insufficient information is available to indicate a need to list the species under the U.S.  Endangered Species Act . According to the National Marine Fisheries Service, any shark caught must be released immediately with minimal harm, and is considered a prohibited species, making it illegal to harvest any part of the sand tiger shark on the United States' Atlantic coast.\nThe  coral reef s support a high diversity of reef animals, including approximately 250 species of corals (stony and soft corals) and 1,200 reef and reef-associated fish species, a population of marine turtles, manta rays (Manta birostris), whale sharks (Rhincodon typus) and seabirds. These also include threatened and endangered species such as the green turtle (Chelonia mydas), hawksbill turtle (Eretmochelys imbricata), Napoleon wrasses (Cheilinus undulatus), and tawny nurse shark (Nebrius ferrugineus).\nThis family of small ground sharks is not targeted by humans for any fishing or food purposes. Although not endangered or threatened, these species are negatively impacted by fisheries as a result of bycatch. The shrimping industry has affected them the most.\nPreying on  demersal   bony fish es and  crustacean s, the speartooth shark is adapted for hunting in near-complete darkness. It is not as active as other  requiem shark s, moving upstream and downstream with  tidal  currents so as to save energy. Reproduction is  viviparous  with females forming a  placenta l connection to their young, though details are unknown. The speartooth shark is threatened by  incidental capture  in  commercial  and  recreational fisheries , as well as by  habitat degradation . Given its small population, restricted range, and stringent  habitat  requirements, this species is highly susceptible to these pressures and has been listed as  Endangered  by the  International Union for Conservation of Nature  (IUCN).\nIn 1997, the U.S.  National Oceanographic and Atmospheric Administration  (NOAA)  National Marine Fisheries Service  (NMFS) listed the night shark as a \"Species of Concern\", meaning that it merits conservation concern but there is insufficient evidence for listing on the  Endangered Species Act  (ESA). In 1999, the NMFS Fishery Management Plan (FMP) of the Atlantic tunas, swordfish, and sharks was revised to prohibit the retention of 19 species, including the night shark. The prohibition of this species was upheld by Amendment 1 of the FMP, added in 2003. Night sharks suffer high bycatch mortality on longlines, and prohibited or not some are kept by fishers because of their value and the difficulty of identifying disembodied parts to species. Nevertheless, a 2003–2008 NMFS population assessment concluded that night shark population in United States waters has stabilized (perhaps even increasing) and no longer merits categorization as a \"Species of Concern\", though recommended that the prohibition on retention be maintained as a precautionary measure. This species should also benefit from the imposition of time/area closures in the Florida Straits and on the Charleston Bump. Off Brazil and elsewhere, fishing continues largely unmanaged. IUCN members have urged that Brazil improve catch monitoring and enforcement of existing regulations, declare some critical habitat off-limits, and implement the Brazilian National Plan of Action for Sharks (NPOA-Sharks) under the FAO International Plan of Action for the Conservation and Management of Sharks (IPOA-Sharks).\nIn 2009, the  International Union for Conservation of Nature 's  IUCN Red List  of Endangered Species named 64 species, one-third of all oceanic shark species, as being at risk of extinction due to fishing and shark finning.\n overturning an understanding which had stood for nearly 50 years. Sims’ satellite tracking of basking sharks were some of the first long-term trackings of any shark species and contributed to the conservation proposals listing basking sharks on Appendix II of the Convention for International Trade in Endangered Species (CITES) (Feb 2003) and the Convention for the Conservation of Migratory Species of Wild Animals (CMS) (Nov 2005).\nShark  species are increasingly becoming threatened because of commercial and recreational fishing pressures, the impact of non-shark fisheries on the seabed and shark prey species, and other habitat alterations such as damage and loss from coastal development and  marine pollution . Rising demands for shark products has increased pressure on shark fisheries, but little monitoring or management occurs of most fisheries. Major declines in shark stocks have been recorded over the past few decades; some species have declined over 90% and population declines of 70% are not unusual. In particular, harvesting young sharks before they reproduce severely impacts future populations. Sharks generally reach  sexual maturity  only after many years and produce few offspring in comparison to other fish species.\nThe rapid collapse of porbeagle stocks on both sides of the North Atlantic is often cited as archetypal of the \"boom and bust\" pattern of most shark fisheries. Factors including a small litter size, long maturation time, and the capture of multiple age classes all contribute to this shark's susceptibility to  overfishing . The  International Union for Conservation of Nature  has assessed the porbeagle globally as  Vulnerable ,  Endangered  in the western North Atlantic (including the  Baltic ), and  Critically Endangered  in the eastern North Atlantic and Mediterranean Sea.\nVarious species of endemic, rare, and endangered wildlife have been confirmed in the vicinity of Otago Peninsula both on land and at sea.  Jewelled gecko s are known from the area.  Giant moa s were historically seen on the peninsula. Endangered ocean  megafauna s such as  Basking Shark s,  Great White Shark s, and  Leatherback Turtle s have been confirmed along Otago coasts.\nIn 2013, great white sharks were added to California's Endangered Species Act. From data collected, the population of great whites in the North Pacific was estimated to be fewer than 340 individuals. Research also reveals these sharks are genetically distinct from other members of their species elsewhere in Africa, Australia, and the east coast of North America, having been isolated from other populations.\nThe bay off Inhassaro is popular with  scuba divers  with the  reef s and the area is a seasonal home to many species of  dolphin ,  turtle , the rare and endangered  dugong  or sea cow,  whale shark s,  manta rays  and  humpback whales .\nShark finning  is a worldwide issue that involves cutting off the fins of  sharks . This is done while the shark is still alive followed by the rest of the body being thrown back into the ocean, leaving it to die days after. Used in countries like China and Japan, shark fins are a key ingredient in the world-renowned meal,  shark fin soup . The high demand for this particular type of soup has sky rocketed in the last few decades and sells for around $100 on average and is often catered at special occasions such as weddings and banquets. Due to the increased want for these shark fins, traders seek out the fins in order to make a profit. However, the fins are the only part of the shark that fishermen seek out to retrieve due to the low economical value of the actual shark meet. This recently exposed issue along with other overfishing issues has brought upon roughly 80 percent of the shark population decline. It has become prominent concern in marine conservation activism for millions of sharks are killed yearly at an often-unregulated expense.\nShores of Silence: Whale Sharks in India is a landmark film by  Mike Pandey  that brought about major legislative changes to protect whale sharks worldwide. This documentary depicts the needless killing and harvesting of whale sharks by poor Indian communities. In response to the film, the  Indian government  introduced legislature to ban fishing of  whale shark s, declaring them  endangered species  and protecting them under the  Wildlife Protection Act of 1972 . This gives whale sharks equal status to other endangered species such as  tiger s and  rhinoceros es. Internationally, the film helped to bring the whale shark global protection under  CITES . The film won 11 international awards including The Wildscreen Panda, also known as the  Green Oscar . Recently, the film received four stars from the  Hindustan Times .\nIn 2013, the  Convention on International Trade in Endangered Species of Wild Fauna and Flora  (CITES) listed the vulnerability of sharks.\nIn March 2015, The  National Marine Fisheries Service  responded to a court order to compile information as to whether the shark will be listed as threatened or endangered under The  Endangered Species Act .\nThe bay is famous for visits by endangered marine  megafauna  including  whale shark s,  great white shark s,  hammerhead shark s,  blacktip shark s,  manta rays ,  orange-spotted grouper s,  potato cod s, critically endangered  leatherback turtle s,  loggerhead sea turtle s, and even  coelacanth s, the 'living fossil' appear. The discovery of presences of Coelacanths made the region world-famous.\nStocks off the eastern United States are severely overfished; a 2006 stock assessment survey by the U.S. National Marine Fisheries Service (NMFS) showed that its population had dropped to 15–20% of 1970s levels. In 1997, the dusky shark was identified as a  Species of Concern  by the NMFS, meaning that it warranted conservation concern but there was insufficient information for listing on the U.S.  Endangered Species Act  (ESA). Commercial and recreational retention of dusky sharks was prohibited in 1998, but this has been of limited effectiveness due to high bycatch mortality on multi-species gear. In addition, some 2,000 dusky sharks were caught by recreational fishers in 2003 despite the ban. In 2005, North Carolina implemented a time/area closure to reduce the impact of recreational fishing. To aid conservation efforts, molecular techniques using  polymerase chain reaction  (PCR) have been developed that can identify whether marketed shark parts (e.g. fins) are from prohibited species like the dusky shark, versus similar allowed species such as the sandbar shark.\nThe Grey Nurse shark is one of the most critically endangered shark species and believed to be the first protected shark in the world. It was declared ‘vulnerable’ in the waters of New South Wales (Australia) in 1984 and later throughout the world.In 1996 the species was listed globally ‘vulnerable’ by the International Union for the Conservation of Nature (IUCN) and declared ‘vulnerable’ in Commonwealth waters of Australia. According to the Environment Protection and Biodiversity Conservation Act 1999 (EPBC Act 1999) it is believed that there are two separate populations of Grey Nurse shark in Australia. The population in the east coast is listed as ‘critically endangered’ whereas the west coast population is listed as ‘vulnerable’ under the EPBC Act (1999)The Grey Nurse sharks are also protected under the Fisheries Legislation in New South Wales, Western Australia, Victoria, Tasmania and Queensland. In the Northern Territory the species is classified as ‘data deficient’ by the Territory Parks and Wildlife Conservation Act (2000)NTG.\nG. gangeticus is one of 20 sharks on the  International Union for Conservation of Nature and Natural Resources Red List  of endangered shark species. The species is currently classified as  Critically Endangered . There is an urgent need for a detailed survey of the shark fisheries of the Bay of Bengal.\nDetractors also purport that previous beliefs in regards to sharks and cancer have been overturned, as forty-two varieties of cancer have now been discovered in sharks and related species.  Also, many opponents feel that non-existent (or even limited) results do not justify the rampant over-fishing of many endangered species of sharks, further threatening their extinction.\nAs  apex predator s, sharks are of high importance for the ocean as an eco system. Through overfishing, many shark species are endangered. Apart from ethical problems this also causes economical problems as the demand for shark meat in Trinidad cannot be covered any more. Often catfish and ray are used as substitutes and are declared incorrectly. In return, bake and shark stalls sometimes advertise for using shark meat instead of cheaper alternatives.\nThe Ganges shark (Glyphis gangeticus) is a  critically endangered  species of  requiem shark  found in the  Ganges River  and the  Brahmaputra River  of India. It is often confused with the more common  bull shark  (Carcharhinus leucas), which also inhabits the Ganges River and is sometimes incorrectly referred to as the Ganges shark. Unlike bull sharks, which need to migrate to salt water to reproduce, species in the genus Glyphis are true  river sharks . The genus contains a total of six known species, only half of which are described. In contrast,  genetic  evidence has shown that both the  Borneo river shark  (G. fowlerae) and  Irrawaddy river shark  (G. siamensis) should be regarded as  synonyms  of the Ganges shark, expanding the range of the species to Pakistan,  Myanmar ,  Borneo  and  Java . Even with this expanded range, the species remains very poorly known and very rare.\nThree species are frequent in the  aquarium fish  trade;  E. munense  is the only member of the genus that rarely (if ever) makes its way into the trade. The demand for these colourful fishes is high, and breeding is almost impossible to achieve in the home aquarium. The popular species are thus bred on an industrial scale in  Southeast Asia . Today all  red-tailed black shark s (E. bicolor), all  flying foxes  (E. kalopterus), and most  rainbow shark s (E. frenatum) seen in the aquarium trade are believed to be farm-bred. The main problem for their status is  dam ming of rivers between the fishes' usual haunts and the breeding grounds. While otherwise a considerable take of wild Epalzeorhynchus could be sustained, dams will literally stand in the way of successful reproduction, and such isolated  subpopulation s are easily extinguished by  overfishing .  Water pollution  is also problematic. Due to these threats, the red-tailed black shark is very rare and was believed to be  extinct in the wild , but a tiny wild population is now known, leading to its current  IUCN  rating as  critically endangered . Among the remaining, E. munense is  vulnerable , the rainbow shark is considered safe, and the flying fox is  data deficient  (its status is unclear based on 2009 knowledge).\nIn 2010, the Convention on International Trade in Endangered Species ( CITES ) rejected proposals from the  United States  and  Palau  that would have required countries to strictly regulate trade in several species of  scalloped hammerhead ,  oceanic whitetip  and  spiny dogfish shark s. The majority, but not the required two-thirds of voting delegates, approved the proposal.  China , by far the world's largest shark market, and  Japan , which battles all attempts to extend the convention to marine species, led the opposition. In March 2013, three endangered commercially valuable sharks, the  hammerheads , the  oceanic whitetip  and  porbeagle  were added to Appendix 2 of  CITES , bringing shark fishing and commerce of these species under licensing and regulation.\nThe bala shark, Balantiocheilos melanopterus, also known as the tricolor shark, silver shark, or shark minnow, is a  fish   species  of the  family   Cyprinid ae, and is one of the two species in the  genus   Balantiocheilos . This species is not a true  shark , but is commonly so called because of its  torpedo -shaped body and large fins. It is endangered because the population decreased by 50% in the last 10 years.\nDeclaring July 4, 2012, as a day of freedom for all marine animals, Yeh led the release of an endangered  Whale shark  that had been caught accidentally by a Chinese fishing boat as  bycatch , as well as two Green sea turtles. At this event, he proclaimed, \"Sea turtle conservation does not only involve sea turtles. When we protect  charismatic species  such as whale sharks, those efforts spill over and protect sea turtles as well. These two animals share the ocean, and we must learn to share the ocean with them.” Holding humans accountable for sea turtle and Whale shark endangerment, he added that, \"protecting them is humankind's responsibility.\"\nOn the  IUCN Red List  there are 39 species of  elasmobranch es (sharks and rays) listed as threatened species ( Critically Endangered ,  Endangered  or  Vulnerable ).\nIn South Australia, spotter planes and a small number of patrolled swimming beaches are the only methods used to mitigate against shark attack. On 6 February 2014, Port Lincoln tuna \" baron \"  Hagen Stehr  expressed his support for the Western Australian shark cull. He also stated that his business' spotter planes had observed increases in great white shark numbers off the west coast of Eyre Peninsula. One of the wealthiest men in South Australia, he acknowledged that his tuna farming operations attract some sharks. He told  The Advertiser  that he believed \"selected culling of sharks is a must. It is crazy stuff to put them under protection so it becomes a major offence to kill them.\" Critics of Stehr's stance note that a cull of sharks in SA would be beneficial to his business, as tuna is a major source of food for sharks. Shark attack survivor turned conservationist  Rodney Fox  has spoken out against the cull, saying \"When a shark attacks someone, we go 'the shark needs to be punished'. They don't live under our laws. It's a different world down there and it should be treated differently.\"\nThe range of conservation threats faced by the speartooth shark, coupled with its small population and restricted range and  habitat  preferences, have led the  International Union for Conservation of Nature  (IUCN) to assess it as  Endangered . Furthermore, in Australia it has been listed as Critically Endangered on the 1999 Commonwealth Environment Protection and Biodiversity Conservation Act, though this is of minimal effect as Commonwealth protection does not apply until a distance of three  nautical mile s from the coast, likely outside the range of this shark. It has also been listed as Vulnerable on the 2000 Territory Parks and Wildlife Conservation Act, though a management plan has yet to be enacted. Sharks in the Kakadu and  Lakefield National Park s are protected somewhat from habitat alteration, if not fishing. There are no regulations restricting the capture of this species in Papua New Guinea.\nShark nets also result in incidence of  bycatch , including threatened and  endangered species  like  sea turtle s,  dugong s,  dolphin s and  whale s. In QLD in the 2011/12 summer season there were 700 sharks caught, 290 above 4 metres in shark nets and drum lines.\nSharks are one of the ocean's most threatened species because they are mistakenly caught by vessels searching for fish, and end up getting tossed back into the ocean dead or dying This disappearance of sharks has enabled prey animals like rays to multiply, which alters the ecological food chain.\nThe western North Atlantic porbeagle population has a more positive prospect than in the eastern North Atlantic. Fishing in Canadian waters was originally regulated by the 1995 Fisheries Management Plan for pelagic sharks in Atlantic Canada, which established an annual quota of 1,500 tons, restricted the time, place, and gear types allowed for commercial fishing, and set limits for bycatch and recreational fishing. In 2000–2001, Fisheries and Oceans Canada (DFO) prepared a detailed population model and concluded that a quota of 200–250 tons would allow for population growth, resulting in a quota of 250 tons being adopted for the period of 2002–2007. The mating ground off of Newfoundland was also closed to shark fishing.  In 2004, the Committee on the Status of Endangered Wildlife in Canada (COSEWIC) listed the porbeagle as Endangered, largely on the basis of the low population abundance (<25% of original numbers). Canada decided not to list the species under its Species At Risk Act, but further reduced the total fishing quota to 185 tons.  In US waters, the 1993 Fishery Management Plan for Sharks of the Atlantic Ocean sets an annual quota of 92 tons (post-processing) for the porbeagle. In 2006, this species was listed as a  Species of Concern  by the  National Marine Fisheries Service  (NMFS), meaning that it merits conservation concern but there is insufficient data for inclusion on the US  Endangered Species Act .\nAs of 2008, the scalloped hammerhead is on the \"globally endangered\" species list. In parts of the Atlantic Ocean, their populations have declined by over 95% in the past 30 years.  Among the reasons for this drop off are over-fishing and the rise in demand for shark fins. Researchers attribute this growth in demand to the increase in shark fins as an expensive delicacy (such as in  shark fin soup ) and are calling for a ban on the practice of  shark finning , a practice in which the shark's fins are cut off and the rest of the animal is thrown back in the water to die. Hammerheads are among the most commonly caught sharks for finning.\nThe majority of shark fisheries have little monitoring or management. The rise in demand for shark products increases pressure on fisheries. Major declines in shark stocks have been recorded—some species have been depleted by over 90% over the past 20–30 years with population declines of 70% not unusual. A study by the  International Union for Conservation of Nature  suggests that one quarter of all known species of sharks and rays are threatened by extinction and 25 species were classified as critically endangered.\nOver 1000 species of marine life inhabit the reef with many considered as endangered. Animal species found include  manta ray s,  lionfish ,  sea turtles ,  clownfish , and sharks.  Tubbataha has become a popular site for seasoned  sport diver s because of its coral \"walls\" where the shallow coral reef abruptly ends giving way to great depths. These \"walls\" are also habitats for many colonies of fish.  Giant trevally  (jacks),  hammerhead sharks ,  barracuda s,  manta rays , palm-sized  Moorish idol s,  napoleon wrasse ,  parrotfish , and  moray eels  live in the sanctuary. There also have been reported sightings of  whale sharks  and  tiger shark s. Tubbataha is even home to  cetacean s and the hawksbill sea turtles ( Eretmochelys imbricata ) which are critically endangered species.\nShark s inhabit all the coastal waters and estuarine habitats of Australia's coast. There are 166 species, including 30 species of  requiem shark , 32 of  catshark , six of  wobbegong shark , and 40 of  dogfish shark . There are three species from the family  Heterodontidae : the  Port Jackson shark , the  zebra bullhead shark  and the  crested bullhead shark . In 2004, there were 12 unprovoked  shark attacks in Australia , of which two were fatal. Only 3 species of shark pose a significant threat to humans: the  bull shark , the  tiger shark  and the  great white shark . Some popular beaches in Queensland and  New South Wales  are protected by  shark net ting, a method that has reduced the population of both dangerous and harmless shark species through accidental entanglement. The overfishing of sharks has also significantly reduced shark numbers in Australian waters, and several species are now endangered. A  megamouth shark  was found on a  Perth  beach in 1988; very little is known about this species, but this discovery may indicate the presence of the species in Australian coastal waters.\nHammerhead sharks can be found both in deep and shallow waters. Out of nine species, two are listed as endangered (great hammerhead and scalloped hammerhead) and one as vulnerable (golden hammerhead) species. People pose the greatest threat for the survival of the hammerhead sharks. They hunt hammerhead shark because of the fins that are served as delicacy in certain parts of the world. After the fins are removed, sharks are returned into the ocean. Sharks without fins cannot swim and they are dying in agony.\nWell-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predatorsâ\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nThe scientific name for the hammerhead shark family is Sphyrnidae, with most being in the genus Sphyrna. The Great Hammerhead Shark is Sphyrna mokarran. (endangered species) T â\u0080¦ he scalloped hammerhead is Sphyrna lewini.\nAnd the lead author of the study says the 2011 study underestimated the number of Great White Sharks in the oceans - and it should not be regarded as an endangered species. A new look at research on Great White Sharks in the Eastern North Pacific Ocean indicates the population is likely growing rather than endangered.\nStatus January 10, 2005 ( www.redlist.org) The Red List of the IUCN (The World Conservation Union) contains the names of endangered animal and plant species, and unfortunately includes many shark species. The degree of endangerment to the various species is determined on the basis of seriously documented criteria (see Red List Criteria). Endangered Shark Species. Status January 10, 2005 ( www.redlist.org) The Red List of the IUCN (The World Conservation Union) contains the names of endangered animal and plant species, and unfortunately includes many shark species.\nGreat White Sharks are now listed as 'vulnerable' on the IUCN Red List rather than 'endangered'. Burgess credits the growth in sharks to 40 years of U.S. federal protections for marine mammals that sharks feed on, especially sea lions and seals.\nWhy are Sharks Endangered. Always assumed to be dangerous man-eaters, not many really care whether sharks exist or near extinction. However, this myth about sharks ought to be dispelled, and the reality of their waning numbers has to be brought to light. Sharks are endangered and a lot of factors are contributing to this process.\nThe National Marine Fisheries Service (NMFS) was petitioned to add white sharks to the endangered species list but declined, based on its own research, bolstered by a preview copy of the study by the international team, said Heidi Dewar, a fisheries research biologist.\nGreat White Sharks are NOT endangered: Study shows the number of predators is ten times higher than previously thought. 1  A team of scientists led by the University of Florida studied shark numbers.  They found that measures to improve the population had been successful.\nGreat White Sharks are NOT endangered: Study shows the number of predators is ten times higher than previously thought. In 2011 an alarming study by Standford University suggested Great White Sharks were becoming an endangered species.\nGreat white sharks on way to endangered. Great white sharks off the coast of California are safer, at least for now. Great white sharks may be listed as endangered species. California To Consider Listing Great White Shark As Endangered Species. Calif. advances candidacy of great white shark to endangered species list ... Great White Sharks May Soon be Endangered; Jaws Needs Help. Officials Push To List Great White Sharks As Endangered Species. Fish and Game to consider great white shark status.\nReuters. Great white sharks will now be protected under Californiaâ\u0080\u0099s Endangered Species Act starting on Friday. The state Fish and Game Commission approved the designation in February, forbidding the hunting, pursuing, catching, capturing or killing of the animal. California will now allocate funds to a wide study populations of the great white shark -- also known as Carcharodon carcharias -- expected to be released next year. The species has long been an object of fascination among humans, many of whom fear the beast for its size and reputation as a man-eater.\nIn 2011 an alarming study by Standford University suggested Great White Sharks were becoming an endangered species. But new look at research on them in the Eastern North Pacific Ocean indicates the population is now growing thanks to conservation efforts, according to an international research team.\nWhile it is a truth that some shark species are animals that present a sort of danger to people, it is also true that humans have endangered the preservation of many shark species, despite all the physical and physiological adaptations they have achieved through evolution to survive in their natural environment.\nTHREATENED SHARKS. Predators, but also prey. According to IUCN analysts, among the approximately 470 species of sharks, 2.4 percent are Critically Endangered, 3.2 percent are Endangered, 10.3 percent are Vulnerable, and 14.4 percent are Near Threatened.\n50 shark species are listed as vulnerable, endangered, or critically endangered by the IUCN, but only the Great White, Whale, and Basking sharks are protected internationally by CITES (the Convention on International Trade in Endangered Species).\nHammerhead shark is probably the weirdest type of sharks. There are nine species of hammerhead sharks that inhabit all oceans of the world. Hammerhead sharks can be found both in deep and shallow waters. Out of nine species, two are listed as endangered (great hammerhead and scalloped hammerhead) and one as vulnerable (golden hammerhead) species.\nZebra bullhead sharks (Heterodontus zebra) are not considered an endangered species. The IUCN's Red List of Threatened Species, which is an internationally recognized databaseâ\u0080¦ of plant and animal species' conservation status and threat level, places them in the Least Concern category.\nWell-known species such as the great white shark, tiger shark, blue shark, mako shark, thresher shark, and the hammerhead shark are apex predatorsâ\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nThe fish wind up in conservation limbo, since insufficient data is available. Such sharks include the thresher, Java, kitefin, salmon, broadnose sevengill, bigeye sand tiger, narrowmouth catshark, great hammerhead, Argentine angel shark and megamouth, which was only first discovered in 1976.re sharks dangerous or endangered? The answer is both. On the danger side, most sharks are apex predators. This means they exist at the top of the oceanic food chain and possess few, or no, natural enemies.\nWell there are 9 different species of Hammerhead Sharks : Winghead shark Scalloped bonnethead White fin hammerhead Scalloped hammerhead Scoophead Great hammerhead â\u0080¦ Bonnethead Smalleye hammerhead Smooth hammerhead The Great and the Scalloped hammerhead are listed on the World Conservation Union's 2008 Red List as endangered, whereas the Smalleye hammerhead is listed as vulnerable. As for the other species they are not endangered.\nGreat White Shark's Endangered Species Listing Proposed In California. SAN FRANCISCO, Feb 6 (Reuters) - The California Fish and Game Commission voted on Wednesday to recommend protection of the great white shark, the world's largest predatory fish, in waters along the Pacific Coast, under the state's endangered species law.", "key": "32_2", "timestamp": "2020-06-23 21:18:58.976740", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}