{"input_text": "Promotional posters for the album utilised newly developed  Hypertag  technology to enable fans to download free content to their mobile phones, including  ringtone s,  wallpapers  or track previews, depending on the user's phone capability. This was one of the first implementations of such technology by the music industry.\nSound recording  was also a major influence on the development of  popular music  genres, because it enabled recordings of  song s and bands to be inexpensively and widely distributed nationwide or even, for some artists, worldwide. The development of relatively inexpensive reproduction of music via a succession of formats including  vinyl record s,  compact cassette s,  compact disc s (introduced in 1983) and, by the mid-1990s,  digital audio  recordings, and the transmission or broadcast of audio recordings of music performances on radio, of video recordings or live performances on television, and by the 1990s, of audio and video recordings via the  Internet , using  file sharing  of  digital audio  recordings, gave individuals from a wide range of socioeconomic classes access to a diverse selection of high-quality music performances by artists from around the world. The introduction of  multitrack recording  in 1955 and the use of  mixing  had a major influence on  pop  and  rock music , because it enabled  record producer s to mix and overdub many layers of instrument tracks and vocals, creating new sounds that would not be possible in a live performance. The development of  sound recording  and  audio engineering  technologies and the ability to edit these recordings gave rise to new subgenres of classical music, including the  Musique concrète  (1949) and  acousmatic (1955) schools of electronic composition. In the 1970s,  African-American   hip hop music ians began to use the  record turntable  as a musical instrument, creating rhythmic and percussive \" scratching \" effects by manipulating a  vinyl record  on the turntable.\nThe middle of the 20th century saw a number of very important changes in American popular music.  The field of  pop music  developed tremendously during this period, as the increasingly low price of recorded music stimulated demand and greater profits for the record industry.  As a result, music  marketing  became more and more prominent, resulting in a number of mainstream pop stars whose popularity was previously unheard of.  Many of the first such stars were Italian-American crooners like  Dean Martin ,  Rudy Vallee ,  Tony Bennett ,  Perry Como ,  Frankie Laine  and, most famously, the \"first pop vocalist to engender hysteria among his fans\"  Frank Sinatra . The era of the modern teen pop star, however, began in the 1960s.  Bubblegum pop  groups like  The Monkees  were chosen entirely for their appearance and ability to sell records, with no regard to musical ability.  The same period, however, also saw the rise of new forms of pop music that achieved a more permanent presence in the field of American popular music, including rock, soul and pop-folk. By the end of the 1960s, two developments had completely changed popular music: the birth of a  counterculture , which explicitly opposed mainstream music, often in tandem with political and social activism, and the shift from professional composers to performers who were both  singers and songwriters .\nIn 2000 PlayMedia began to provide the hugely popular  Napster   peer-to-peer  music application with core MP3 technologies.  It later was tasked with developing the  music industry -disrupting music service with a next-generation file format - “ .nap ”.\nThe plentiful supply of food and the dense populations that it supported made  division of labor  possible. The rise of nonfarming specialists such as craftsmen and  scribe s accelerated economic growth and technological progress. These economic and technological advantages eventually enabled Europeans to conquer the peoples of the other continents in recent centuries by using the guns and steel of the book's title.\nThe Information Age was enabled by technology developed in the  Digital Revolution , which was itself enabled by building on the developments in the  Technological Revolution .\nBy the second half of the 20th century, developments in electronic  media  made possible the delivery of entertainment products to mass audiences across the globe. The technology enabled people to see, hear and participate in all the familiar forms stories, theatre, music, dance wherever they live. The rapid development of entertainment technology was assisted by improvements in  data storage device s such as  cassette tapes  or  compact disc s, along with increasing  miniaturisation . Computerisation and the development of  barcodes  also made ticketing easier, faster and global.\nIn the period from 1950 to the mid-1960s, studio musicians and composers were also heavily dependent on  magnetic tape  to realize their works. The limitations of existing electronic music components meant that in many cases each note or tone had to be recorded separately, with changes in pitch often achieved by speeding up or slowing down the tape, and then splicing or overdubbing the result into the master tape. These tape-recorded electronic works could be extremely laborious and time-consuming to create—according to the 1967 Moog 900 Series demonstration record, such recordings could have as many as eight edits per inch of tape. The key technological development that led to the creation of the Moog synthesizer was the invention of the  transistor , which enabled researchers like Moog to build electronic music systems that were considerably smaller, cheaper, consumed far less power, and were far more reliable than earlier systems, which depended on the older  vacuum tube  technology.\nIn  popular music , the commercial and artistic importance of the single (as compared to the  EP  or  album ) has varied over time, technological development, and according to the audience of particular artists and genres. Singles have generally been more important to artists who sell to the youngest purchasers of music (younger  teenager s and  pre-teen s), who tend to have more limited financial resources. Perhaps the golden age of the single was on  45 s in the 1950s to early 1960s in the early years of  rock music . Starting in the mid-sixties, albums became a greater focus and more important as artists created albums of uniformly high quality and coherent themes, a trend which reached its apex in the development of the  concept album . Over the 1990s and early 2000s, the single generally received less and less attention in the United States as albums, which on  compact disc  had virtually identical production and distribution costs but could be sold at a higher price, became most retailers' primary method of selling music. Singles continued to be produced in the UK and Australia, surviving the transition from compact disc to digital download.\nIn its early development electronic music was associated almost exclusively with Western  art music , but from the late 1960s on the availability of affordable music technology, particularly of synthesisers, meant that music produced using electronic means became increasingly common in the popular domain of  rock  and  pop music , resulting in major electronically based subgenres. After the definition of  MIDI  in 1982 and the development of  digital audio , the creation of purely electronic sounds and their manipulation became much simpler. As a result, synthesizers came to dominate the pop music of the early 1980s. In the late 1980s,  electronic dance music  (EDM) records made using only electronic instruments became increasingly popular, resulting in a proliferation of electronic genres, subgenres and scenes. In the new millennium, as computer technology became even more accessible and  music software  advanced, interacting with music production technology made it possible to create music that has no relationship to traditional  musical performance  practices, leading to further developments and rapidly evolving subgenres.\nMoog synthesizer (pronounced  ; often  anglicized  to  , though  Robert Moog  preferred the former) may refer to any number of  analog synthesizer s designed by Robert Moog or manufactured by  Moog Music , and is commonly used as a generic term for older-generation analog music synthesizers.  The Moog company pioneered the commercial manufacture of modular voltage-controlled  analog synthesizer  systems in the mid 1960s.  The  technological development that led to the creation of the Moog synthesizer was the invention of the  transistor , which enabled researchers like Moog to build electronic music systems that were considerably smaller, cheaper and far more reliable than earlier  vacuum tube -based systems.\nStereo sound recording on tape was perfected in 1943 by German audio engineers working for the  AEG  corporation. Around 250 stereo tape recordings were made during this period (of which only three have survived), but the technology remained a closely guarded secret within Germany until the end of World War II. After the war, American audio engineer  John T. Mullin  and the  Ampex  corporation pioneered the commercial development of tape recording in the USA, and the technology was rapidly taken up by radio and the music industry due to its superior sound fidelity and because tape - being a linear recording medium - could be easily edited, by physically cutting and splicing the tape, to remove unwanted elements and create a 'perfect' recording. 2-track tape recording was rapidly adopted for modern music in the 1950s because it enabled signals from two or more separate microphones to be recorded simultaneously, enabling stereophonic recordings to be made and edited conveniently, which in turn facilitated the rapid expansion of the consumer high-fidelity (\"HiFi\") market. Stereo (either true binaural two-microphone stereo or multimixed) quickly became the norm for commercial classical recordings and radio broadcasts, although many pop music and jazz  recordings continued to be issued in monophonic sound until the late 1960s.\nThe centre of the music publishing industry in the US during the late 19th century was in New York's ' Tin Pan Alley ' district. The Tin Pan Alley music publishers developed a new method for promoting sheet music: incessant promotion of new songs. One of the technological innovations that helped to spread popular music around the turn of the century was  player pianos . A player piano could be used to record a skilled pianist's rendition of a piano piece. This recorded performance could be \"played back\" on another player piano. This allowed a larger number of music lovers to hear the new popular piano tunes. By the early 1900s, the big trends in popular music were the increasing popularity of vaudeville theaters and dance halls and a new invention—the  gramophone player . The record industry grew very rapidly; \"By 1920 there were almost 80 record companies in Britain, and almost 200 in the USA\". The availability of records enabled a larger percentage of the population to hear the top singers and bands.\nThe use of  electronic music technology  in  rock music  coincided with the practical availability of  electronic musical instruments  and the genre's emergence as a distinct style. Rock music has been highly dependent on technological developments, particularly the invention and refinement of the synthesizer, the development of the  MIDI  digital format and computer technology.\nAround the turn of the 20th century, with the invention and popularization of the  gramophone record  (commercialized in 1892), and  radio broadcasting  (starting on a commercial basis ca. 1919-1920), there was a vast increase in music listening, and it was easier to distribute music to a wider public. The development of  sound recording  had a major influence on the development of  popular music  genres, because it enabled recordings of songs and bands to be widely distributed.  The invention of  sound recording  gave rise to new subgenre of  classical music , the  Musique concrete  style of electronic composition. The invention of  multitrack recording  enabled pop bands to overdub many layers of instrument tracks and vocals, creating new sounds that would not be possible in a live performance. In the early 20th century, electric technologies such as  electromagnetic pickup s,  amplifiers  and  loudspeaker s were used to develop new electric instruments such as the  electric piano  (1929),  electric guitar  (1931),  electro-mechanical organ  (1934) and  electric bass  (1935). The 20th-century orchestra gained new instruments and new sounds. Some orchestra pieces used the  electric guitar ,  electric bass  or the  Theremin .\nMusic technology is connected to both artistic and technological creativity. Musicians and music technology experts are constantly striving to devise new forms of expression through music, and they are physically creating new devices and software to enable them to do so. Although in the 2010s, the term is most commonly used in reference to modern electronic devices and computer software such as  digital audio workstation s and  Protools  digital sound recording software, electronic and digital musical technologies have precursors in the  electric music technologies  of the early 20th century, such as the electromechanical  Hammond organ , which was invented in 1929. In the 2010s, the  ontological  range of music technology has greatly increased, and it may now be electronic, digital, software-based or indeed even purely conceptual.\nMusic software development dates back to the 1960s and 70s. While this software was at best primitive, it nonetheless helped lay the foundation for the future development of the software and synthetic musical production. The early music software was run on large computers at several universities such as Stanford and Penn State. Much of what development came to music software came as a result of the continuous improvement to computers over time. Chain of development is seen clearly in 1978 when nearly 50 music programs came out as a result of MIDI technology, a form of computer communication still used today. MIDI technology provided the key link in hardware for musical software, giving a person a tactile control of an instrument and playing directly into the software in the computer and allowing for maximum control of the production.  Fourth generation music software came out in the early 1990s. The largest improvement with this software was the addition of more detailed displays allowing the music software to show more on the screen making the program much easier to use and understand.An important recent development is to automatically transcribe performed music directly to sheet music as developed by  ScoreCloud .\nFor centuries, instrumental music had either been created by singing, or using  mechanical music technologies , such as drawing a bow across a string that is strung on a hollow instrument or plucking taught gut or metal strings ( string instruments ), constricting vibrating air ( woodwinds  and  brass ) or hitting something to make rhythmic sounds ( percussion instrument s). In the early twentieth century,  electronic devices  were invented that were capable of generating sound electronically, without an initial mechanical source of vibration. As early as the 1930s, composers such as  Olivier Messiaen  incorporated electronic instruments into live performance. While  sound recording  technology is often associated with the key role it played in enabling the creation and mass marketing of  popular music , new electric and electronic sound recording technology was used to produce art music, as well. The  musique concrète  (French: “concrete music”), developed about 1948 by Pierre Schaeffer and his associates, was an experimental technique using recorded sounds as raw material.\nElectronic or digital music technology is any device, such as a  computer , an electronic  effects unit  or  software , that is used by a  musician  or  composer  to help make or perform  music . The term usually refers to the use of electronic devices,  computer hardware  and  computer software  that is used in the  performance , playback,  recording ,  composition ,  sound recording and reproduction ,  mixing ,  analysis  and  editing  of music. Electronic or digital music technology is connected to both artistic and technological creativity. Musicians and music technology experts are constantly striving to devise new forms of expression through music, and they are physically creating new devices and software to enable them to do so. Although in the 2010s, the term is most commonly used in reference to modern electronic devices and computer software such as  digital audio workstation s and  Protools  digital sound recording software, electronic and digital musical technologies have precursors in the  electric music technologies  of the early 20th century, such as the electromechanical  Hammond organ , which was invented in 1929. In the 2010s, the  ontological  range of music technology has greatly increased, and it may now be electronic, digital, software-based or indeed even purely conceptual.\nIn the early 1990s, Goldman developed and patented technologies for digital audio systems wherein music could be stored, browsed, downloaded and purchased from digital databases. These technologies are a way for enabling digital  music downloads  on web sites.\nMany of the ideas integral to appropriate technology can now be found in the increasingly popular \" sustainable development \" movement, which among many tenets advocates technological choice that meets human needs while preserving the environment for future  generation s. In 1983, the OECD published the results of an extensive survey of appropriate technology organizations titled, The World of Appropriate Technology, in which it defined appropriate technology as characterized by \"low investment cost per work-place, low capital investment per unit of output, organizational simplicity, high adaptability to a particular social or cultural environment, sparing use of natural resources, low cost of final product or high potential for employment.\" Today, the OECD web site redirects from the \"Glossary of Statistical Terms\" entry on \"appropriate technology\" to \"environmentally sound technologies.\" The United Nations' \"Index to Economic and Social Development\" also redirects from the \"appropriate technology\" entry to \"sustainable development.\"\nThe third wave of development in audio recording began in 1945, when the allied nations gained access to a new German invention -  magnetic tape  recording. The technology was invented in the 1930s, but remained restricted to Germany (where it was widely used in broadcasting) until the end of World War II. Magnetic tape provided another dramatic leap in audio fidelity — indeed, Allied observers first became aware of the existence of the new technology because they noticed that the audio quality of obviously pre-recorded programs was practically indistinguishable from live broadcasts. From 1950 onwards, magnetic tape quickly became the standard medium of audio master recording in the radio and music industries, and led to the development of the first hi-fi  stereo  recordings for the domestic market, the development of  multi-track tape recording  for music, and the demise of the disc as the primary mastering medium for sound. Magnetic tape also brought about a radical reshaping of the recording process — it made possible recordings of far longer duration and much higher fidelity than ever before, and it offered recording engineers the same exceptional plasticity that film gave to cinema editors — sounds captured on tape could now easily be manipulated sonically, edited, and combined in ways that were simply impossible with disc recordings. These experiments reached an early peak in the 1950s with the recordings of  Les Paul  and  Mary Ford , who pioneered the use of tape editing and \"multi-tracking\" to create large 'virtual' ensembles of voices and instruments, constructed entirely from multiple taped recordings of their own voices and instruments. Magnetic tape fueled a rapid and radical expansion in the sophistication of popular music and other genres, allowing composers, producers, engineers and performers to realize previously unattainable levels of complexity. Other concurrent advances in audio technology led to the introduction of a range of new consumer audio formats and devices, on both disc and tape, including the development full-frequency-range disc reproduction, the change from shellac to polyvinyl plastic for disc manufacture, the invention of the 33rpm, 12-inch long-playing (LP) disc and the 45rpm 7-inch \"single\", the introduction of domestic and professional portable tape recorders (which enabled high-fidelity recordings of live performances), the popular  4-track cartridge  and  compact cassette  formats, and even the world's first \"sampling keyboards\" - the pioneering tape-based keyboard instrument the  Chamberlin , and its more famous successor, the  Mellotron .\nAlthough the music industry developed over several decades, popular music drew ethnomusicologists’ attention by the 90s because a standardizing effect began to develop. The corporate nature surrounding popular music streamlined it into a framework that focused on slight deviations from the accepted norm, creating what Adorno calls “pseudo-individualism”; what the public would perceive as unique or organic would musically comply with standard, established musical conventions. Thus, a duality emerged from this standardization, an industry-driven manipulation of the public’s tastes to give people what they want while simultaneously guiding them to it. In the case of rock music, while the genre may have grown out of politicized forces and another form of meaningful motivation, the corporate influence over popular music became integral to its identity that directing public taste became increasingly easier. Technological developments allowed for easy dispersion of western music, causing the dominance of western music into rural and urbanized areas across the globe. However, because popular music assumes such a corporatized role and therefore remains subject to a large degree of standardization, ambiguity exists whether the music reflects actual cultural values or those only of the corporate sector seeking economic profit. Because popular music developed such a dependent relationship with media and the corporations surrounding it, where record sales and profit indirectly shaped musical decisions, the superstar person became an important element of popular music. From the fame and economic success surrounding such superstars, subcultures continued to arise, such as the rock and punk movements, only perpetuated by the corporate machine that also shaped the musical aspect of popular music.\nIn the 1950s and 1960s, the new invention of television began to play an increasingly important role in disseminating new popular music. Variety shows regularly showcased popular singers and bands. In the 1960s, the development of new technologies in recording, such as multitrack recorders gave  sound engineer s and  record producer s an increasingly important role in popular music. By using multitrack recording techniques, sound engineers could create new sounds and  sound effect s that were not possible using traditional \"live\" recording techniques, such as a singer performing her own backup vocals or having a  lead guitar ist play  rhythm guitar  behind her  guitar solo . During the 1960s era of  psychedelic music , the recording studio was used to create even more unusual sounds, in order to mimic the effect of taking  hallucinogenic drug s, some songs used tapes of instruments played backwards or panned the music from one side to the other of the stereo image.\nThe invention of the miniature  transistor  in 1947 enabled the creation of a new generation of  synthesizer s, which were used first in pop music in the 1960s. Synthesizers became popular in the mass market in the early 1980s. With the development of powerful  microchip s, a number of new electronic or digital music technologies were introduced in the 1980s and subsequent decades. Electronic and digital music technologies are any device, such as a computer, an electronic  effects unit  or  software , that is used by a musician or composer to help make or perform music. The term usually refers to the use of electronic devices,  computer hardware  and  computer software  that is used in the  performance , playback,  recording ,  composition ,  sound recording and reproduction ,  mixing ,  analysis  and  editing  of music.\nWith  20th-century music , there was a vast increase in music listening, as the  radio  gained popularity and  phonograph s were used to replay and distribute music. The invention of  sound recording  and the ability to edit music gave rise to new subgenre of classical music, including the  acousmatic  and  Musique concrète  schools of electronic composition. Sound recording was also a major influence on the development of popular music genres, because it enabled recordings of songs and bands to be widely distributed. The introduction of the  multitrack recording  system had a major influence on  rock music , because it could do much more than record a band's performance. Using a multitrack system, a band and their  music producer  could overdub many layers of instrument tracks and vocals, creating new sounds that would not be possible in a live performance.\nIn the 1970s, electronic music began having a significant influence on  popular music , with the adoption of  polyphonic synthesizer s,  electronic drums , and  drum machine s, through the emergence of genres such as  krautrock ,  disco ,  new wave  and  synthpop . In the 1980s, electronic music became more dominant in popular music, with a greater reliance on synthesizers, and the adoption of programmable drum machines, and  bass synthesizer s. In the early 1980s,  digital technologies  for synthesizers including  digital synthesizer s have been popularized, and a group of musicians and music merchants developed the Musical Instrument Digital Interface ( MIDI ).\nThe Civil War was an important period in the development of American music.  During the Civil War, when soldiers from across the country commingled, the multifarious strands of American music began to crossfertilize each other, a process that was aided by the burgeoning  railroad  industry and other technological developments that made travel and communication easier.  Army units included individuals from across the country, and they rapidly traded tunes, instruments and techniques.  The songs that arose from this fusion were \"the first American folk music with discernible features that can be considered unique to America\".  The war was an impetus for the creation of many songs that became and remained wildly popular; the songs were aroused by \"all the varied passions (that the Civil War inspired)\" and \"echoed and re-echoed\" every aspect of the war.  John Tasker Howard has claimed that the songs from this era \"could be arranged in proper sequence to form an actual history of the conflicts; its events, its principal characters, and the ideals and principles of the opposing sides\".\nThe rise of big band instrumentation had as much to do with artistic trends as it did with commercial viability. Significant technological developments transformed the music industry during the 1920s, allowing for an increase in the mass consumption of music. Phonographs and records became standard household items; indicative of the widespread popularization of recorded music is the fact that nearly 100 million records were sold in 1927 alone. Prearranged music had a particular commercial appeal, since audiences were familiar with the songs they saw performed live from the recordings they purchased. Furthermore, exposure to musical innovation—and jazz, in all its varieties, was certainly innovative—had never before reached the same breadth of American audience. Given the commercial availability of music—which, in addition to records, was aided by the proliferation of broadcast radio—a platform was thus created that accounted for the popularization of jazz. But the mass consumption of jazz simultaneously allowed the audience an inverted influence on its development, and consumer demands dictated that orchestral jazz adopted a structure similar to traditionally accessible popular music.\nAfter  World War I , sheet music publishers—namely those from  Tin Pan Alley —experienced unprecedented growth that was fueled for the next three decades by composers, technological advancements—and also market saturation owed partly to higher quality of recorded sound, radio, and film.  The boom was so great that even some \"established\" music libraries were facing challenges relating to expectations of the scope of acquisitions deviating from European classical to  avant-garde , popular, jazz, blues, folk, and experimental.  Standardization of uniform cataloging of a music industry that had little knowledge of the pioneering music librarianship was a large undertaking.  By the late 1930s, music librarianship was recognized as a new frontier.  Fifteen years earlier (1923), the field of musicology, as an academic vocation, was also a new discipline.  Many credit  Otto Kinkeldey  as not only being among the first musicologists, but also, in 1937, the first to propose music librarianship, not only as field of study at the university level, but also as a full-time vocation requiring expertise on par with PhDs.\nTechnology  has had an influence on music since prehistoric times, when cave people used simple tools to bore holes into bone flutes 41,000 years ago. Technology continued to influence music throughout the history of music, as it enabled new instruments and music notation reproduction systems to be used, with one of the watershed moments in music notation being the invention of the  printing press  in the 1400s, which meant music scores no longer had to be hand copied. In the 19th century, music technology led to the development of a more powerful, louder  piano  and led to the development of new valves brass instruments. In the early 20th century (in the late 1920s), as  talking pictures  emerged in the early 20th century, with their prerecorded musical tracks, an increasing number of moviehouse orchestra musicians found themselves out of work. During the 1920s live musical performances by orchestras,  pianist s, and  theater organ ists were common at first-run theaters. With the coming of the talking motion pictures, those featured performances were largely eliminated. The  American Federation of Musicians  (AFM) took out newspaper advertisements protesting the replacement of live musicians with mechanical playing devices. One 1929 ad that appeared in the  Pittsburgh Press  features an image of a can labeled \"Canned Music / Big Noise Brand / Guaranteed to Produce No Intellectual or Emotional Reaction Whatever\"\nIn the 1960s, larger, more powerful guitar amplifiers were developed, called \"stacks\". These powerful amplifiers enabled guitarists to perform in rock bands that played in large venues such as stadiums and outdoor music festivals (e.g.,  Woodstock Music Festival ). Along with the development of guitar amplifiers, a large range of electronic  effects unit s, many in small  stompbox  pedals were introduced in the 1960s and 1970s, such as  fuzz pedal s,  flanger s and  phaser   enabling performers to create unique new sounds during the  psychedelic rock  era. Breakthroughs in electric guitar and basses technologies and playing styles enabled major breakthroughs in pop and rock music in the 1960s and 1970s. The distinctive sound of the amplified  electric guitar  was the centerpiece of new genres of music such as  blues rock  and  jazz-rock fusion . The sonic power of the loudly amplified, highly  distorted  electric guitar was to key element of the early  heavy metal music , with the distorted guitar being used in  lead guitar  roles, and with  power chord s as a  rhythm guitar .\nIn addition to the influence of technology of instrumental development on the course of music and musical performance, the introduction of recording technology is considered probably the most important historical development in music given a technological development (Bates; Montagu; Taylor).\nPiano music characteristics. Used at home and a popular solo instrument for virtuosos. Technological developments (factory production) in the nineteenth century led to creation of modern concert grand piano. Allowed for access of piano to the masses.The rise of the virtuosic pianist was characteristic of the genre. in the beginning of the piece.\nIn the early-2000s, floppy disks slowly lost popularity as better technology developed which was able to offer higher levels of storage capacity, smaller physical characteristics, and faster processing speeds.\nInnovations and Changes During the 20th Century. There were many innovations during the 20th century that contributed to how music was created, shared and appreciated. Technological advancements in radio, TV, and recording enabled the public to listen to music in the comforts of their own home.", "key": "40_3", "timestamp": "2020-06-23 21:18:59.064702", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}