{"input_text": "Deploying CubeSats from ISS has a number of benefits. Launching the vehicles aboard the logistics carrier of ISS visiting vehicle reduces the vibration and loads they have to encounter during launch. In addition, they can be packed in protective materials so that the probability of CubeSat damage during launch is reduced significantly. In addition, for earth observation satellites, such as those of Planet Labs, the lower orbit of the ISS orbit, at roughly 400 Kilometers, is an advantage.  In addition, the lower orbit allows for a natural decay of the satellites, thus reducing the build-up of orbital debris.\nQB50 is a proposed international network of 50 CubeSats for multi-point, in-situ measurements in the lower  thermosphere  (90–350 km) and re-entry research. QB50 is an initiative of the  Von Karman Institute  and is funded by the European Commission as part of the 7th Framework Programme (FP7). Double-unit (2U) CubeSats (10×10×20 cm) are developed, with one unit (the 'functional' unit) providing the usual satellite functions and the other unit (the 'science' unit) accommodating a set of standardised sensors for lower thermosphere and re-entry research. 35 CubeSats are envisaged to be provided by universities in 19 European countries, 10 by universities in the US, 2 by universities in Canada, 3 by Japanese universities, 1 by an institute in Brazil, and others. Ten 2U or 3U CubeSats are foreseen to serve for in-orbit technology demonstration of new space technologies.\nPurpose: To use low-cost open-source hardware and software for its flight computers that will control the satellite payload. The CubeSat carries a VGA camera, a GPS receiver, a linear transponder, and an AX-25 packet radio transponder.\nPurpose: This satellites uses commercial off-the-shelf components to provide the basic satellites functions such as commanding, power generation & supply, and communications with the other two units of the satellites. The CubeSat will fly and Exo-Brake to orbit that is deployed once the satellite is released to demonstrate a Passive De-Orbit System for satellites.\nWhile nearly all CubeSats are deployed from a launch vehicle or the International Space Station, some are deployed by the primary payloads themselves. For example,  FASTSAT  deployed the  NanoSail-D2 , a 3U CubeSat. This was done again with the  Cygnus Mass Simulator  as the primary payload launched on the maiden flight of the  Antares  rocket, carrying and later deploying four CubeSats. For CubeSat applications beyond Earth's orbit, the method of deploying the satellites from the primary payload will also be adopted. Eleven CubeSats are planned to be launched on the  Space Launch System 's  Exploration Mission 1 , which would place them in the vicinity of the  Moon .  Insight , a planned  Mars   lander , will also bring CubeSats beyond Earth orbit to use them as  relay communications satellites . Known as  MarCO  A and B, they would be the first CubeSats sent beyond the  Earth–Moon system .\nUniSat-5  is the first satellite designed, built and launched by G.A.U.S.S. Srl, the company that inherits the experience gained with the UniSat program at the  School of Aerospace Engineering  of the  University of Rome “La Sapienza” . The spacecraft was inserted into a near-SSO orbit with an altitude of 634 km at 07:25:48 UTC.The launch of UniSat-5 satellite, boarded on the  Dnepr  rocket, took place on 21 November 2013 from Yasny cosmodrome in Russia, marking an historical event in the world of CubeSats and nanosatellites.  UniSat-5  boarded four  CubeSat s and four  PocketQube s.\nThe term \"CubeSat\" was coined to denote  nanosatellites  that adhere to the standards described in the CubeSat design specification. Cal Poly published the standard in an effort led by aerospace engineering professor Jordi Puig-Suari.  Bob Twiggs , of the Department of Aeronautics & Astronautics at Stanford University, and currently a member of the space science faculty at Morehead State University in Kentucky, has contributed to the CubeSat community. His efforts have focused on CubeSats from educational institutions. The specification does not apply to other cube-like nanosatellites such as the NASA \"MEPSI\" nanosatellite, which is slightly larger than a CubeSat.\nThe Interactive Satellite for Art and Design Experimental Research or INVADER, also known as Cubesat Oscar 77 (CO-77) and Artsat-1 is an artificial satellite for artistic experiments in space. The satellite was built by the  University of Tokyo  in collaboration with  Tama Art University . It has a size of 100x100x100mm (without antennas) and built around a standard 1U  cubesat  bus. The primary satellite payload is an FM voice transmitter. Also, it includes low-resolution CMOS camera and  thermochromic  panels for artistic purposes.\nDuring the development of the Estonian satellite mission it was decided to make a 1U CubeSat.By standard 1 unit (1U) CubeSat base side length must be 100.0±0.1 millimeters and satellite height must be 113.5±0.1 mm.Mass is also set in CubeSat standard, the highest possible mass for 1U CubeSat is 1300 grams.\nFour CubeSats were deployed from the  Cygnus Mass Simulator , which was launched April 21, 2013 on the maiden flight of Orbital Sciences'  Antares rocket . Three of them are 1U  PhoneSat s built by NASA's  Ames Research Center  to demonstrate the use of  smart phones  as  avionics  in CubeSats. The fourth was a 3U satellite, called Dove-1, built by  Planet Labs .\nSome CubeSats have complicated components or instruments, such as  LightSail-1 , that  pushes their construction cost into the millions, but a basic 1U CubeSat can cost about $50,000 to construct so CubeSats are a viable option for some schools and universities; as well as small businesses to develop CubeSats for commercial purposes.\nThe Dynamic Ionosphere CubeSat Experiment (DICE) is a scientific mission consisting of two  Miniaturized Satellites  DICE-1 and DICE-2 flying in formation. The satellites are an unusual 1.5U variant of the  CubeSat  design for microsatellites. Both satellites were launched from  Vandenberg Air Force Base  in October 2011 atop a  Delta II   rocket . This was a multi-payload mission with four other CubeSats,  AubieSat-1 ,  M-Cubed ,  Explorer-1_Prime  and  RAX-2 .\nHayato was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the  H-IIA  202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . K-Sat shared its dispenser with the  Negai ☆  satellite, whilst a second dispenser contained  Waseda-SAT2 . The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nStandard CubeSats are made up of 10×10×11.35 cm units designed to provide 10×10×10 cm or 1 liter of useful volume while weighing no more than  per unit. The smallest standard size is 1U, while 3U+ is the largest being composed of three units stacked lengthwise with an additional 6.4 cm diameter cylinder centered on the long axis and extending 3.6 cm beyond one face.  The Aerospace Corporation  has constructed and launched two smaller form CubeSats of 0.5U for radiation measurement and technological demonstration. In recent years larger CubeSat platforms have been proposed, most commonly 6U (10×20×30 cm or 12×24×36 cm) and 12U (20x20x30 cm or 24x24x36 cm), to extend the capabilities of CubeSats beyond academic and technology validation applications and into more complex science and national defense goals. In 2014 two 6U  Perseus-M  CubeSats were launched for maritime surveillance, those two CubeSats represent the largest CubeSats flown as of 2015. The 2018 launch of the  InSight  lander to Mars, will include two 6U CubeSats called  Mars Cube One  (MarCO).\nIndian Space Research Organisation  (ISRO) is contributing towards augmenting  ESA   Galileo satellite navigation system  and GPS service in northern Europe by sharing data from the  Indian Regional Navigation Satellite System  (IRNSS). ISRO  Polar Satellite Launch Vehicle  has launched  Miniaturized satellite s of several European universities and opened payload capacity on Indian  CubeSat s to European scientific experiments. India relies on  Arianespace  for the launch of  I-3K -class satellites to geosynchronous transfer orbits.\nA group of UL Lafayette engineering students participating in the Cajun Advanced Picosatellite Experiment (CAPE) built a small artificial  satellite , known as a  CubeSat , that was launched into orbit from the  Republic of Kazakhstan  in 2007. A second satellite, the CAPE-2, was launched into space on the Minotaur 1 rocket in November 2013. The CAPE-2 CubeSat weighed about 2 pounds, had deployable solar panels, and could convert speech to text, tweet messages and send emails.\nThe term \"picosatellite\" or \"picosat\" (not to be confused with the  PicoSAT  series of microsatellites) is usually applied to artificial satellites with a wet mass between , although it is sometimes used to refer to any satellite that is under 1 kg in launch mass. Again, designs and proposed designs of these types usually have multiple picosatellites working together or in formation (sometimes the term \"swarm\" is applied). Some designs require a larger \"mother\" satellite for communication with ground controllers or for launching and docking with picosatellites. The  CubeSat  design, with approximately  mass, is an example of a large picosatellite (or minimum nanosat).\nIn 2012, Meisei Electric designed and built its first satellite, the  We-Wish   CubeSat . We-Wish, a miniature  infrared  monitoring satellite built using the standardised CubeSat architecture, was developed with the assistance of  amateur radio  operators, and its data was made available to Japanese  high school  students. It was carried to orbit along with several other CubeSats aboard Japan's  Kounotori 3  spacecraft in July 2012, and was launched from the  International Space Station  on 4 October 2012. The CubeSat destructively  deorbit ed as intended on 11 March 2013, after over 150 days of successful operation.\nThe CubeSat Space Protocol enables distributed embedded systems to deploy a service-oriented network topology. The layering of CSP corresponds to the same layers as the  TCP/IP  model. The implementation supports a connection oriented transport protocol (Layer 4), a router-core (Layer 3), and several network-interfaces (Layer 1–2). A service-oriented topology eases the design of satellite subsystems, since the communication bus itself is the interface to other subsystems. This means that each subsystem developer only needs to define a service-contract, and a set of port-numbers his system will be responding on. Furthermore, subsystem inter-dependencies are reduced, and redundancy is easily added by adding multiple similar nodes to the communication bus.\nWith continued advances in the  miniaturization and capability increase of electronic technology  and the use of  satellite constellation s, nanosatellites are increasingly capable of performing commercial missions that previously required microsatellites.For example, a  6U CubeSat  standard has been proposed to enable a constellation of 35   Earth-imaging satellite s to replace a constellation of five   RapidEye  Earth-imaging satellites, at the same mission cost, with significantly increased revisit times: every area of the globe can be imaged every 3.5 hours rather than the once per 24 hours with the RapidEye constellation. More rapid revisit times are a significant improvement for nations performing disaster response, which was the purpose of the RapidEye constellation. Additionally, the nanosat option would allow more nations to own their own satellite for off-peak (non-disaster) imaging data collection.\nNASA's CubeSat Launch Initiative has launched more than 46 CubeSats on its ELaNa missions over the last several years, and as of 2016, 57 are manifested for flight over the next few years.  No matter how inexpensive or versatile CubeSats may be, they must hitch rides as secondary payload on large rockets launching much larger spacecraft, at prices starting around $100,000. Since CubeSats are deployed by P-PODs and similar deployment systems, they can be integrated and launched into virtually any launch vehicle. However, some launch service providers refuse to launch CubeSats, whether on all launches or only on specific launches, two examples are  ILS  and  Sea Launch .\nSmall solar sails have been proposed to accelerate the deorbiting of small artificial satellites from Earth orbits.  Satellites in  low Earth orbit  can use a combination of solar pressure on the sail and increased atmospheric drag to accelerate satellite  reentry .  A de-orbit sail developed at  Cranfield University  is part of the UK satellite TechDemoSat-1, launched in 2014, and is expected to be deployed at the end of the satellite's five-year useful life. The sail's purpose is to bring the satellite out of orbit over a period of about 25 years. In July 2015 British 3U  CubeSat  called  DeorbitSail  was launched into space with the purpose of testing 16 m deorbit structure, but eventually it failed to deploy it. There is also a student 2U CubeSat mission called  PW-Sat2  planned to launch in 2017 that will test 4 m deorbit sail.\nThe CubeSat  reference design  was proposed in 1999 by professors  Jordi Puig-Suari  of  California Polytechnic State University  and  Bob Twiggs  of  Stanford University . The goal was to enable  graduate student s to be able to design, build, test and operate in space a  spacecraft  with capabilities similar to that of the first spacecraft,  Sputnik . The CubeSat, as initially proposed, did not set out to become a standard; rather, it became a standard over time by a process of  emergence . The first CubeSats were launched in June 2003 on a  Russia n  Eurockot , and approximately 75 CubeSats had been placed into orbit by 2012.\nWaseda was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the  H-IIA  202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . A second dispenser contained  K-Sat  and the  Negai ☆  satellite. The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nThe CubeSat specification accomplishes several high-level goals. The main reason for miniaturizing satellites is to reduce the cost of deployment and are often suitable for launch in multiples, using the excess capacity of larger launch vehicles. The CubeSat design specifically minimizes risk to the rest of the launch vehicle and payloads. Encapsulation of the launcher– payload  interface takes away the amount of work that would previously be required for mating a piggyback satellite with its launcher. Unification among payloads and launchers enables quick exchanges of payloads and utilization of launch opportunities on short notice.\nThe following is a list of  CubeSat s,  nanosatellite s used primarily by universities for research missions, typically in  low Earth orbit s. Some CubeSats became  their country's first national satellite .\nThe secondary payloads were four  CubeSat s that were deployed from the CMS. Three of them were  PhoneSat s, 1U CubeSats built by NASA's  Ames Research Center . These were named  Alexander ,  Graham  and  Bell , after the  inventor of the telephone . The purpose of these three satellites was to demonstrate the use of  smartphone s as  avionics  in CubeSats. They each had a mass of  and were powered by lithium batteries. The fourth nanosat was a 3U CubeSat, called Dove-1, built by Cosmogia Inc. It carried a \"technology development Earth imagery experiment\" using the Earth's magnetic field for attitude control.\nP-PODs were designed with CubeSats to provide a common platform for  secondary payload s. P-PODs are mounted to a  launch vehicle  and carry CubeSats into orbit and deploy them once the proper signal is received from the launch vehicle. The P-POD Mk III has capacity for three 1U CubeSats, or other 0.5U, 1U, 1.5U, 2U, or 3U CubeSats combination up to a maximum volume of 3U. Other CubeSat deployers exist, with the NanoRacks CubeSat Deployer (NRCSD) on the International Space Station being the most popular method of CubeSat deployment as of 2014. Some CubeSat deployers are created by companies, such as the ISIPOD (Innovative Solutions In Space BV) or SPL (Astro und Feinwerktechnik Adlershof GmbH), while some have been created by governments or other non-profit institutions such as the X-POD ( University of Toronto ), T-POD ( University of Tokyo ), or the J-SSOD ( JAXA ) on the International Space Station. While the P-POD is limited to launching a 3U CubeSat at most, the NRCSD can launch a 6U (10×10×68.1 cm) CubeSat and the ISIPOD can launch a different form of 6U CubeSat (10×22.63×34.05 cm).\nNASA's CubeSat Launch Initiative, created in 2010 provides CubeSat launch opportunities to educational institutions, non-profit organizations and NASA Centers. Since its inception the CubeSat Launch Initiative has launched 46 CubeSats flown on 12 ELaNa Missions from 28 unique organizations and has selected 119 CubeSat missions from 66 unique organizations.  Educational Launch of Nanosatellites (ELaNa) missions have included: BisonSat the first CubeSat built by a tribal college, TJ3Sat the first CubeSat built by a high school and STMSat-1 the first CubeSat built by an elementary school. NASA releases an Announcement of Opportunity in August of each year with selections made the following February.\nThe Japanese Experiment Module Small Satellite Orbital Deployer (J-SSOD) is the first of its kind to deploy small satellites from the International Space Station. The facility provides a unique satellite install case to the Japanese Experiment Module (JEM) Remote Manipulator System (RMS) for deploying small, CubeSat, satellites from the ISS. The J-SSOD holds up to 3 small one-unit (1U, 10 x 10 x 10 centimeters) small CubeSats per satellite install case, 6 in total, though other sizes up to 55 x 55 x 35 cm may also be used. Each pre-packed satellite install case is loaded by crewmembers onto the Multi-Purpose Experiment Platform (MPEP) within the JEM habitable volume. The MPEP platform is then attached to the JEM Slide Table inside the JEM airlock for transfer to the JEMRMS and space environment. The JEMRMS grapples and maneuvers the MPEP and J-SSOD to a predefined deployment orientation and then jettisons the small CubeSat satellites.\nQIKCom-1 is an amateur radio payload built to take advantage of the previously developed APRS network. Because it flies on a host spacecraft (SIMPL), there were no solar panels or attitude control systems developed (as in previous designs). It continues the PCSat and PSAT missions containing APRS packet radio communications transponders for relaying remote telemetry, sensor and user data from remote users and amateur radio environmental experiments. The data transponder also includes all the telemetry and command and control for a complete CubeSat.\nA CubeSat (U-class spacecraft) is a type of  miniaturized satellite  for  space research  that is made up of multiples of 10×10×11.35 cm cubic units. CubeSats have a mass of no more than 1.33 kilograms per unit, and often use  commercial off-the-shelf  (COTS) components for their  electronics  and structure. CubeSats are most commonly put in orbit by deployers on the  International Space Station , or launched as  secondary payload\nAttitude control  for CubeSats relies on miniaturizing technology without significant performance degradation. Tumbling typically occurs as soon as a CubeSat is deployed, due to asymmetric deployment forces and bumping with other CubeSats. Some CubeSats operate normally while tumbling, but those that require pointing in a certain direction or cannot operate safely while spinning, must be detumbled. Systems that perform attitude determination and control include  reaction wheel s,  magnetorquer s, thrusters,  star tracker s,  Sun sensor s, Earth sensors,  angular rate sensor s, and  GPS receivers and antennas . Combinations of these systems are typically seen in order to take each method's advantages and mitigate their shortcomings.  Reaction wheels  are commonly utilized for their ability to impart relatively large  moments  for any given energy input, but reaction wheel's utility is limited due to saturation, the point at which a wheel cannot spin faster. Examples of CubeSat reaction wheels include the Maryland Aerospace MAI-101 and the Sinclair Interplanetary RW-0.03-4. Reaction wheels can be desaturated with the use of thrusters or magnetorquers. Thrusters can provide large moments by imparting a  couple  on the spacecraft but inefficiencies in small propulsion systems cause thrusters to run out of fuel rapidly. Commonly found on nearly all CubeSats are magnetorquers which run electricity through a  solenoid  to take advantage of Earth's magnetic field to produce a  turning moment . Attitude-control modules and solar panels typically feature built-in magnetorquers. For CubeSats that only need to detumble, no attitude determination method beyond an  angular rate sensor  or electronic  gyroscope  is necessary.\nCubeSat structures do not have all the same strength concerns as larger satellites do, as they have the added benefit of the deployer supporting them structurally during launch. Still, some CubeSats will undergo  vibration analysis  or  structural analysis  to ensure that components unsupported by the P-POD remain structurally sound throughout the launch. Despite rarely undergoing the analysis that larger satellites do, CubeSats rarely fail due to mechanical issues.\nNUTS-1 (NTNU Test Satellite) is a  Norwegian  2U  CubeSat  created by the NUTS student satellite project at  NTNU . The  satellite  is currently under development by students from several  engineering  and science disciplines.  It is one of three CubeSats part of the Norwegian student space program ANSAT, the other two are the  CubeStar  and the  HiNCube .  From NTNUs CubeSat projects NUTS-1 is a succssor of the  nCube-1  and nCube-2 projects. The satellite will use a main groundstation located at  NTNU .\nEdison Demonstration of Smallsat Networks (EDSN) is a  CubeSat   Satellite constellation  by  NASA Ames  developed as a technology demonstration of satellite networking. The constellation will consist of 8 identical satellites. The satellites follow the CubeSat specifications for a 1.5U CubeSat.\nBoth satellites were built to the  CubeSat  pico-satellite standard, which defined their mass and size (10 cm  cube ). This standard allows one or more cube satellites to be launched by ' piggyback ing' with a larger satellite.  In this way the smaller satellites get a cheap ride into orbit.\nRoBiSAT represents the second Romanian artificial nanosatellites mission. The mission is composed out of 2 Cubesat 2U type satellites that will be part of the QB50 constellation. They will be sent to the  ISS  at the end of 2016 on the  Cygnus CRS OA-7 .The two nanosatellites, called Robisat 1 and Robisat 2, were built at the Institute of Space Science located in  Magurele ,  Romania .\nCubeSats use  solar cell s to convert solar light to electricity that is then stored in rechargeable  lithium-ion batteries  that provide power during eclipse as well as during peak load times. These satellites have a limited surface area on their external walls for solar cells assembly, and has to be effectively shared with other parts, such as antennas, optical sensors, camera lens, propulsion systems, and access port. Lithium-ion batteries feature high energy-to-mass ratios, making them well suited to use on mass-restricted spacecraft. Battery charging and discharging is typically handled by a dedicated electrical power system (EPS). Batteries sometimes feature heaters to prevent the battery from reaching dangerously low temperatures which might cause battery and mission failure. Missions with higher power requirements can make use of  attitude control  to ensure the solar panels remain in their most effective orientation toward the Sun, and further power needs can be met through the addition and orientation of deployed solar arrays. Recent innovations include additional spring-loaded solar arrays that deploy as soon as the satellite is released, as well as arrays that feature  thermal knife  mechanisms that would deploy the panels when commanded. CubeSats may not be powered between launch and deployment, and must feature a  remove-before-flight  pin which cuts all power to prevent operation during loading into the P-POD. Additionally, a deployment switch is actuated while the craft is loaded into a P-POD, cutting power to the spacecraft and is deactivated after exiting the P-POD.\nSolar sail s (also called light sails or photon sails) are a form of spacecraft propulsion using the  radiation pressure  (also called solar pressure) from stars to push large ultra-thin mirrors to high speeds, requiring no propellant. Force from a solar sail scales with the sail's area, this makes sails well suited for use in CubeSats as their small mass results in the greater acceleration for a given solar sail's area. However, solar sails still need to be quite large compared to the satellite, which means useful solar sails must be  deployed, adding mechanical complexity and a potential source of failure. This propulsion method is the only one not plagued with restrictions set by the CubeSat Design Specification, as it does not require high pressures, hazardous materials, or significant chemical energy. Few CubeSats have employed a solar sail as its main propulsion and stability in deep space, including the 3U  NanoSail-D2  launched in 2010, and the  LightSail-1  in May 2015.  LightSail-2  is scheduled for launch in March 2017, while at least two CubeSats that plan to launch on the  Space Launch System 's first flight in September 2018 are set to use solar sails, the proposed  Near-Earth Asteroid Scout  (NEA Scout) and the  Lunar Flashlight .\nCubeSat propulsion has made rapid advancements in the following technologies:  cold gas ,  chemical propulsion ,  electric propulsion , and  solar sail s. The biggest challenge with CubeSat propulsion is preventing risk to the launch vehicle and its primary  payload  while still providing significant capability. Components and methods that are commonly used in larger satellites are disallowed or limited and the CubeSat Design Specification (CDS) requires a waiver for pressurization above 1.2 standard  atmospheres , over 100 Wh of stored chemical energy, and hazardous materials. Those restrictions pose great challenges for CubeSat propulsion systems, as typical space propulsion systems utilize combinations of high pressures, high energy densities, and hazardous materials. Beyond the restrictions set forth by  launch service provider s, various technical challenges further reduce the usefulness of CubeSat propulsion.  Gimbaled thrust  cannot be used in small engines due to the complexity of gimbaling mechanisms, thrust vectoring must instead be achieved by thrusting asymmetrically in multiple-nozzle propulsion systems or by changing the center of mass relative to the CubeSat's geometry with actuated components. Small motors may also not have room for  throttling  methods that allow smaller than fully-on thrust, which is important for precision maneuvers such as  rendezvous . CubeSats which require longer life also benefit from propulsion systems, when used for  orbit keeping  a propulsion system can slow  orbital decay .\nCubeSat forms a cost-effective independent means of getting a payload into orbit. After delays from low-cost launchers such as  Interorbital Systems , launch prices have been about $100,000 per unit, but newer operators are offering lower  pricing.\nAubieSat-1 ( OSCAR -71) is a  CubeSat  designed, built, and tested by undergraduate  students  at  Auburn University . It was launched from  Vandenberg Air Force Base  October 28, 2011 atop a  Delta II   rocket . This was a multi-payload mission with five other CubeSats,  M-Cubed ,  DICE-1 ,  DICE-2 ,  Explorer-1  and  RAX-2 .\nCubeSat s are small, low-cost satellites that are typically launched as secondary payloads on other missions, often built and operated as student projects. Several CubeSat missions have attempted to deploy tethers, so far without success.\n, one method of getting CubeSats to  orbit  is to  transport  them aboard a larger spacecraft as part of  a cargo load  to a larger  space station .  When this is done, deploying the CubeSats into orbit as a separate  artificial satellite  requires a special apparatus, such as the NanoRacks CubeSat Deployer. The NRCSD is put into position to be grabbed by one of the ISS’s robotic arms, which then places the CubeSat deployer into the correct position externally mounted to the ISS to be able to release the miniature satellites into proper orbit.\nCubeSat  electric propulsion  typically uses electric energy to accelerate propellant to high speed, which results in high  specific impulse . Many of these technologies can be made small enough for use in nanosatellites, and several methods are in development. Types of electric propulsion currently being designed for use in CubeSats include  Hall-effect thruster s,  ion thruster s,  pulsed plasma thruster s,  electrospray thrusters , and  resistojets . Several notable CubeSat missions plan to use electric propulsion, such as NASA's  Lunar IceCube . The high efficiency associated with electric propulsion could allow CubeSats to propel themselves to Mars. Electric propulsion systems are disadvantaged in their use of power, which requires the CubeSat to have larger solar cells, more complicated power distribution, and often larger batteries. Furthermore, many electric propulsion methods may still require pressurized tanks to store propellant, which is restricted by the CubeSat Design Specification.\nUnlike full-sized spacecraft, CubeSats have the ability to be delivered into space as cargo and then deployed by the International Space Station. This presents an alternative method of achieving orbit apart from launch and deployment by a  launch vehicle .  NanoRacks  and  Made in Space  are developing means of constructing CubeSats on the International Space Station.\nThe low cost of CubeSats has enabled unprecedented access to space for smaller institutions and organizations but, for most CubeSat forms, the range and available power is limited to about 2W for its communications antennae.  They can use radio-communication systems in the  VHF ,  UHF ,  L- ,  S- ,  C-  and  X-band . For UHF/VHF transmissions, a single  helical antenna  or four  monopole antenna e are deployed by a spring-loaded mechanism.\nUses typically involve experiments which can be miniaturized or serve purposes such as  Earth observation  or  amateur radio . Many CubeSats are used to demonstrate spacecraft technologies that are targeted for use in small satellites or that present questionable feasibility and are unlikely to justify the cost of a larger satellite. Scientific experiments with questionable underlying theory may also find themselves aboard CubeSats as their low cost could justify riskier experiments. Biological research payloads have been flown on several missions, with more planned. Several missions to the  Moon  and  Mars  are planned to use CubeSats.\nPurpose: These 28 3U CubeSats are working to build an Earth-observation constellation based solely on CubeSats. The CubeSats contain batteries that provide power to the various systems in each Dove. Each satellite has an optical telescope for acquiring high-resolution images of earth. Each satellites uses an X-band system for the downlink of acquired images and systems telemetry at data rates of 120Mbit/s.\nNegai was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the H-IIA 202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . Negai shared its dispenser with the  K-Sat  satellite, whilst a second dispenser contained  Waseda-SAT2 . The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nDifferent CubeSat components possess different acceptable temperature ranges, beyond which they may become temporarily or permanently inoperable. Satellites in orbit are heated by  radiative heat  emitted from the  Sun ,  Earth , sunlight reflected off Earth, as well as heat generated by the craft's components. CubeSats must also  cool by radiating heat  either into space or into the cooler Earth's surface, if it is cooler than the spacecraft. All of these radiative heat sources and sinks are rather constant and very predictable, so long as the CubeSat's orbit and eclipse time are known.\n(Page excerpted from WIkipedia http://en.wikipedia.org/wiki/CubeSat). A CubeSat is a type of miniaturized satellite for space research that usually has a volume of exactly one liter (10 cm cube), has a mass of no more than 1.33 kilograms, [1] and typically uses commercial off-the-shelf components for its electronics.1U cubesat structure without outer skin.2]. The standard 10Ã\u009710Ã\u009710 cm basic CubeSat is often called a â\u0080\u009c1Uâ\u0080\u009d CubeSat meaning one unit. CubeSats are scalable along only one axis, by 1U increments. CubeSats such as a â\u0080\u009c2Uâ\u0080\u009d CubeSat (20Ã\u009710Ã\u009710 cm) and a â\u0080\u009c3Uâ\u0080\u009d CubeSat (30Ã\u009710Ã\u009710 cm) have been both built and launched.\nStandard CubeSats are made up of 10Ã\u009710Ã\u009711.35 cm units designed to provide 10Ã\u009710Ã\u009710 cm or 1 liter of useful volume while weighing no more than 1.33 kg (2.9 lb) per unit. The smallest standard size is 1U and 3U is the largest which does not occupy allowed extra volumes.-PODs are mounted to a launch vehicle and carry CubeSats into orbit and deploy them once the proper signal is received from the launch vehicle. The P-POD Mk III has capacity for three 1U CubeSats, or other 0.5U, 1U, 1.5U, 2U, or 3U CubeSats combination up to a maximum volume of 3U.\nThe basic building block of cubesats is a cube measuring 4 inches (10 centimeters) on each side. Satellites that consist of just a single such block are known as 1U (short for one unit) cubesats; those that combine two or three of them are 2U and 3U, respectively.mall and economical cubesats already eye our planet from orbit. But such bantam craft are about to start pushing out into deep space, helping researchers study and explore the moon, asteroids and other distant bodies.\nThe CubeSat Kit is designed to help you complete a successful CubeSat mission in as short a time as possible, and at low cost.Each CubeSat Kit includes: 1  A rugged Development Board that you use in the lab to prototype mission-specific hardware, develop software, test your ideas, measure performance, etc.ll you need beyond the CubeSat kit is a PC with a USB port and a CubeSat-Kit certified C compiler / Integrated Development Environment (IDE). You use the compiler and IDE to develop software for this MCU.\nCubeSats are miniature satellites that are commonly used in  low Earth orbit for applications such as remote sensing or communications. As engineers become more familiar with the technology, CubeSats are also being considered for flights outside of Earth orbit â\u0080\u0094 particularly to locations such as Mars or Jupiter.\nList of CubeSats. The following is a list of CubeSats, nanosatellites used primarily by universities for research missions, typically in low Earth orbits. Some CubeSats became their country's first national satellite.\nA CubeSat is a type of miniaturized satellite for space research that is made up of multiples of 10Ã\u009710Ã\u009710 cm cubic units. CubeSats have a mass of no more than 1.33 kilograms per unit, and often use commercial off-the-shelf components for their electronics and structure. CubeSats are most commonly put in orbit by deployers on the International Space Station, or launched as secondary payloads on a launch vehicle. In 1999, California Polytechnic State University and Stanford University ...\nSince CubeSats missions are often made to very Low Earth Orbits (LEO), and experience atmospheric reentry after just days or weeks, radiation can largely be ignored and standard consumer-grade electronics may be used. CubeSats are built from four specific types of aluminum alloy to ensure that they have the same coefficient of thermal expansion as the launch vehicle.\nIf you build a CubeSat, securing a rocket to launch it on is not difficult, merely expensive. A typical CubeSat launch cost is estimated at $40,000. There are several commercial providers promising future CubeSat rockets, assuming they complete development.f there is a slight tumble to the satellite, all the better. These light sensors will provide a basic measure of the satelliteâ\u0080\u0099s position and tumbling. If you want to measure actual light levels, your design will have to ensure the Sun doesnâ\u0080\u0099t saturate your detector.", "key": "50_8", "timestamp": "2020-06-23 21:18:59.113729", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}