{"input_text": "Union Market is a gourmet  food hall  in Northeast  Washington, D.C. . Bon Appétit called it one of the 5 best food halls in the United States. Union Market is owned by Edens, a South Carolina-based company.\nWhile you are in DC April is the perfect time to also join us on some of our other great walking tours or perhaps one of our famous Washington DC Food Tours. This April is the 150th Anniversary of Lincolnâ\u0080\u0099s Assassination and there are several special events planned.\nWhile you are in DC April is the perfect time to also join us on some of our other great walking tours or perhaps one of our famous Washington DC Food Tours. This April is the 150th Anniversary of Lincolnâ\u0080\u0099s Assassination and there are several special events planned. Written by Fred Pickhardt. Ocean Weather Services.\nThursday, July 15, 2010. A Part of my Family. Benâ\u0080\u0099s Chili Bowl stands tall and proud on U street, fully aware of itâ\u0080\u0099s incredible popularity. Itâ\u0080\u0099s always packed with people, hungry for the famous and delicious chili. Each and every person in Washington D.C. feels a connection to Benâ\u0080\u0099s, as if it is part of the family. Business is always booming and the long lines until 4 in the morning become a familiar face. Not only is the food fantastic but there is a gift shop, created because of the desire for Benâ\u0080\u0099s Chili Bowl attire and items.\nWashington, D.C., has emerged as one of the hottest dining destinations in the country. There's never been a shortage of sites, museums and monuments, but now there are even more diversions to enjoy while you're here.\nBook, Enter, Win with RW Diner Rewards. Named the coolest city in America, Bon Appetit's 2016 Restaurant City of Year, Zagat's Hottest Food City of 2016, and earning it's very own Michelin Guide, DC is known for its restaurants. Experience 250 of them with Metropolitan Washington Restaurant Week.", "key": "54_7", "timestamp": "2020-06-23 21:18:59.129027", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}