{"input_text": "It has been speculated that Princess Emeraude was based on  The Childlike Empress  from  Michael Ende 's  The Neverending Story  (Die unendliche Geschichte) being as they are both directly linked to their kingdom (if one should die, so shall their empire), they both do not play a direct role despite the fact that their powers are the most revered, and they are both depicted as young women, no older than the age of ten to thirteen. Furthermore, though they are both young in appearance, they are both considered \"ageless\". Lastly, their stories, though different in ways, are also similar. Recalling the fact that Emeraude sent for earthlings to kill her (for no one in Cephiro could do her harm),  The Childlike Empress  sent for a human boy, for no one in her kingdom of Fantasia could give her a new name. Also the Proof of the Pillar which took the form of Emeraude's tiara could also be related to  The Childlike Empress ' AURYN, which was the symbol of her absolute power in Fantasia.\nHis most memorable role was  Atreyu  in the 1984 film  The NeverEnding Story . He received his second Young Artist Awards nomination and won the award for Best Younger Actor in the 12th Annual  Saturn Awards .\nNoah Leslie Hathaway (born November 13, 1971) is an American  actor  and a former  teen idol . He is best known for his roles as  Atreyu  in the  1984  film  The NeverEnding Story  and for portraying  Boxey  on the  original  TV Series Battlestar Galactica.  His work in The Neverending Story made him particularly popular as a  teen-aged  celebrity in Europe.\nOliver had minor roles in television and film, until starring as Bastian in the 1984 movie  The NeverEnding Story . Subsequently, he was cast as the lead in  Tim Burton 's short film  Frankenweenie  and as the  android  'Daryl' in the 1985 film  D.A.R.Y.L. , a part for which he won a  Saturn Award .\nOne of Cox's earliest roles was the  Childlike Empress  in the 1994 film  The NeverEnding Story III . She played  Diana, Princess of Wales  in Princess in Love by David Greene, a film released in 1996 based upon the publication by Anna Pasternak. Cox played the character Sophie Aronnax in a remake of 20,000 Leagues under the Sea in 1997, and in 1999 she appeared as Giulietta in the film adaptation of  Alegría .\nThe NeverEnding Story (German: Die unendliche Geschichte) is a 1984  West German -produced English language  epic   fantasy film  based on the  novel of the same name  by  Michael Ende , about a boy who reads a magical book that tells a story of a young warrior whose task is to stop a dark storm called the Nothing from engulfing a fantasy world.\nThe Neverending Story: The Animated Adventures of Bastian Balthazar Bux is an  animated television series , produced by  CineVox  (Germany),  Ellipse  (France), and  Nelvana  (Canada), aired for one season (1995–1996) on  HBO , ran for 26 episodes, and loosely based on  Michael Ende 's book,  The Neverending Story  (1979).\nThe NeverEnding Story II: The Next Chapter is a 1990 German-American  fantasy film  and sequel to  The NeverEnding Story . It was directed by  George T. Miller  and stars  Jonathan Brandis  as  Bastian Bux ,  Kenny Morrison  as  Atreyu , and  Alexandra Johnes  as the  Childlike Empress . The only actor to return from the first film was  Thomas Hill  as Mr. Koreander.\nThe NeverEnding Story  was the first film adaptation of the novel. It was released in 1984, directed by  Wolfgang Petersen  and starring  Barret Oliver  as Bastian,  Noah Hathaway  as Atreyu, and  Tami Stronach  as the Childlike Empress. It covered only the first half of the book, ending at the point where Bastian enters Fantasia (Fantastica). Ende, who was reportedly \"revolted\" by the movie, requested they halt production or change the movie's name, as he felt it had drastically deviated from his novel; when they did neither, he sued them and subsequently lost the case.  The music was composed by  Klaus Doldinger . Some electronic tracks by  Giorgio Moroder  were added to the US version of the movie, as well as the titlesong Never Ending Story composed by  Giorgio Moroder  and  Keith Forsey  becoming a chart success for  Limahl , the former singer of  Kajagoogoo .\nAt the age of fourteen, he received his first starring role, as  Bastian Bux  in  The NeverEnding Story II: The Next Chapter . That same year, Brandis played the young \"Stuttering Bill\" Denbrough, the main protagonist in the 1990 film  Stephen King's It , alongside  Tim Curry , based on the epic horror novel of the  same name . Brandis' performance in the film was lauded by critics and audiences. Brandis then appeared in  Sidekicks , costarring  Chuck Norris , and in  Ladybugs , with actor/comedian  Rodney Dangerfield .\nBastian Balthazar Bux is the main protagonist of the story. Bastian is a shy and bookish boy around 12 years old who is neglected by his father, who is still mourning the sudden death of his wife (she died of an unspecified illness). He is a dreamer, who is shunned by other children due to his immense imagination. During a visit to an antique bookstore, he steals a curious-looking book titled The Neverending Story, and upon reading it he finds himself literally drawn into the story.\nBastian Balthazar Bux is a shy and friendless bibliophile 12-year-old, teased by bullies from school. On his way to school, he hides from the bullies in a bookstore, interrupting the grumpy bookseller, Mr. Coreander. Bastian asks about one of the books he sees, but Mr. Coreander advises against it. His curiosity piqued, Bastian seizes the book, leaving a note promising to return it, and hides in the school's attic to read. The book describes the world of Fantasia slowly being devoured by a force called \"The Nothing\". Fantasia's ruler, the Childlike Empress, has fallen ill, and  Atreyu  is tasked to discover the cure, believing that once the Empress is well, the Nothing will no longer be a threat. Atreyu is given a medallion named the  AURYN  that can guide and protect him in the quest. As Atreyu sets out, the Nothing summons  Gmork , a vicious and highly intelligent  wolf -like creature, to kill Atreyu.\nAt 13, Saller was invited by his older brother Ryan to join a band started by some of his friends, Dan Jacobs and  Alex Varkatzas . The three of them formed a street punk band called Retribution, which by 1998, had adapted a heavier sound and changed names to Atreyu after the  main character  of  The Neverending Story . The band signed to  Victory Records  in 2001 and released 3 albums under the label,  Suicide Notes and Butterfly Kisses  in 2002,  The Curse  in 2004, and  A Death-Grip on Yesterday  in 2006. The band later joined major label  Hollywood Records  and released 2007's  Lead Sails Paper Anchor  and 2009's  Congregation of the Damned .  After over 10 years of worldwide success, the band embarked on hiatus, but returned in 2014. They released their sixth studio album,  Long Live  in 2015.\nThe NeverEnding Story III: Escape from Fantasia (also known as: The NeverEnding Story III: Return to Fantasia) is a 1994 film and the second  sequel  to the  fantasy  film  The NeverEnding Story  (following the first sequel  The NeverEnding Story II: The Next Chapter ). It starred  Jason James Richter  as the principal character Bastian Bux, and  Jack Black  in one of his early roles as the school bully Slip. This film used the characters from  Michael Ende 's novel  The Neverending Story  (1979), but introduced a new storyline.\nThe film was produced by  Bernd Eichinger  and Dieter Giessler and directed and co-written by  Wolfgang Petersen  (his first English-language film) and starred  Barret Oliver ,  Noah Hathaway ,  Tami Stronach ,  Moses Gunn ,  Thomas Hill ; and  Alan Oppenheimer  as the voices of both  Falkor  and  Gmork  ( as well as other characters ). At the time of its release, it was the most expensive film produced outside the  United States  or the  Soviet Union . The film was the first in  The NeverEnding Story film series  and later followed by two  sequel s.\nStronach made her acting debut as \" The Childlike Empress \" in  The Neverending Story  (1984), a film adaptation of the novel  Die Unendliche Geschichte (The Neverending Story)  by  Michael Ende .  She has not since had many known acting roles; her parents preferred that she did not pursue any further acting to avoid the possible dangers many  child actresses  in both movies and television sometimes encounter. She has nevertheless since acted in the play \"Chambre\" at the  La MaMa Experimental Theatre Club , and she has further studied acting with  Laura Esterman . She had a leading role in the Czech fantasy film,  Poslední z Aporveru , a tale of two children trying to save their world from destruction.\nThe series also introduces new supporting characters. Lucas and Marely are Bastian's friends who try to defend him from school bullies, and Fly Girl is a heroine whom Atreyu meets who is on her own Quest. \"Tales from The Neverending Story\" is the first live action adaption not to feature the characters of Nighthob, TeenyWeeny, or Rockbiter.\nChildren of the '80s will no doubt feel a deep pang of nostalgia when they see The Neverending Story characters Atreyu and Falkor soaring together through the skies, once again, as Limahl sings the title track of the classic fantasy film in a new campaign from Spotify.\nThe Nothing is the main antagonist and primary threat faced by the protagonist of the German... The Nothing is the main antagonist and primary threat faced by the protagonist of the German novel Die unendliche Geschichte (The Neverending Story) and its 1984 movie adaptation. It is a frightening dark cloud that nearly engulfs the magical world of Fantasia, prompting the primary Fantasian protagonist Atreyu to search for a human child whose imagination could dispel it.\n~ Gmork about the Nothing. The Nothing is the main antagonist and primary threat faced by the protagonist of the German novel Die unendliche Geschichte (The Neverending Story) and its 1984 movie adaptation.\nMeanings and history of the name Atreyu: | Edit. Originally found in the German fantasy novel, The Neverending Story by Michael Ende, 1979. In the book the character, Atreyu's parents are killed when he is a baby, so the village raises him. Therefore the name means, son of all. As the story develops Atreyu is chosen for his strength to save the world by saving the childlike empress.\nFalkor (Fuchur (German), Falcor or Falcore) is a Luck Dragon. He is one of main characters from the Neverending Story. Falkor has a graceful elongated body of 43 feet long, his whole body is covered in albino light downy/soft fur on the entire length of his body.\nIn the miniseries Tales from the Neverending Story, Xayide is portrayed as the Childlike Empress' sister and the ruler of a 'Dark City'. In The Neverending Story cartoon, Xayide is the main antagonist of the series.\nThe NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nThe NeverEnding Story (German: Die unendliche Geschichte) is a 1984 West German-produced English language epic fantasy film based on the novel of the same name by Michael Ende, about a boy who reads a magical book that tells a story of a young warrior whose task is to stop a dark storm called the Nothing from engulfing a fantasy world.\nThe name of Atrayu's horse in the neverending story was Artax. What is the horses name from Neverending story The name of Atrayu's horse in the neverending story was Artax. for now! What is the name of the horse off of the Neverending story Artax is the name of the horse in The Neverending Story. Have a fun weekend. ! Ask us Anything.\nThe Neverending Story (German: Die unendliche Geschichte) is a German fantasy novel by Michael Ende that was first published in 1979. The standard English translation, by Ralph Manheim, was first published in 1983.The novel was later adapted into several films.he NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nThe NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.The music was composed by Klaus Doldinger.he NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nThe film was produced by Bernd Eichinger and Dieter Giessler and directed and co-written by Wolfgang Petersen (his first English-language film) and starred Barret Oliver, Noah Hathaway, Tami Stronach, Moses Gunn, Thomas Hill; and Alan Oppenheimer as the voices of both Falkor and Gmork.he second half of the book would subsequently be used as the rough basis for the second film, The NeverEnding Story II: The Next Chapter.\nMeanings and history of the name Atreyu: | Edit. Originally found in the German fantasy novel, The Neverending Story by Michael Ende, 1979. In the book the character, Atreyu's parents are killed when he is a baby, so the village raises him.Therefore the name means, son of all.As the story develops Atreyu is chosen for his strength to save the world by saving the childlike empress. Later turned into an American movie by the same name in 1984, directed by Wolfgang Peterson. The character, Atreyu, is played by Noah Hathaway.herefore the name means, son of all. As the story develops Atreyu is chosen for his strength to save the world by saving the childlike empress. Later turned into an American movie by the same name in 1984, directed by Wolfgang Peterson. The character, Atreyu, is played by Noah Hathaway.\nMeanings and history of the name Atreyu: | Edit. Originally found in the German fantasy novel, The Neverending Story by Michael Ende, 1979. In the book the character, Atreyu's parents are killed when he is a baby, so the village raises him.Therefore the name means, son of all.As the story develops Atreyu is chosen for his strength to save the world by saving the childlike empress. Later turned into an American movie by the same name in 1984, directed by Wolfgang Peterson. The character, Atreyu, is played by Noah Hathaway.herefore the name means, son of all. As the story develops Atreyu is chosen for his strength to save the world by saving the childlike empress. Later turned into an American movie by the same name in 1984, directed by Wolfgang Peterson.", "key": "33_8", "timestamp": "2020-06-23 21:18:59.020299", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}