{"input_text": "Montignac's diet was followed by the  South Beach Diet  that also used the GI principle, and Michael Mosley's  Intermittent Fasting 5:2  diet incorporates a recommendation to select foods with a low  glycemic index  or  glycemic load .\nAnimal studies performed in Dr. Mattson’s Laboratory showed that intermittent fasting has profound beneficial effects on the body and brain including: 1) Improved glucose regulation; 2) Loss of abdominal fat with maintenance of muscle mass; 3) Reduced blood pressure and heart rate, and increased heart rate variability (similar to what occurs in trained endurance athletes; 4) Improved learning and memory and motor function; 5) Protection of neurons in the brain against dysfunction and degeneration in animal models of Alzheimer's disease, Parkinson's disease, stroke and Huntington's disease.   He further discovered that intermittent fasting is beneficial for health because it imposes a challenge to cells, and those cells respond adaptively by enhancing their ability to cope with stress and resist disease.\nThe 5:2 diet, or fast diet, is a diet which stipulates  calorie restriction  for two non-consecutive days a week and unconstrained eating the other five days. A form of  intermittent fasting , it originated and became popular in the UK, and spread in Europe and to the USA.\nFasting is a willing  abstinence  or reduction from some or all  food ,  drink , or both, for a period of time. An absolute fast (dry fasting) is normally defined as abstinence from all food and liquid for a defined period, usually a period of 24 hours, or a number of days.  Water fasting  allows drinking water but nothing else. Other fasts may be partially restrictive, limiting only particular foods or substances. A fast may also be  intermittent in nature . Fasting practices may preclude intercourse and other activities as well as food.\nA study funded by Isagenix in 2012 by the University of Illinois at Chicago examined the effect of intermittent fasting in combination with a liquid diet consisting of Isagenix Isalean Shakes or a food-based (National Cholesterol Education Program Therapeutic Lifestyle Changes) diet. Intermittent fasting in combination with Isalean led to a reduction in fat mass 9% more to that of intermittent fasting in combination with a food-based diet, as well greater reductions in total and LDL cholesterol and several other factors associated with coronary heart disease risk and loss of visceral fat.\nAfter publishing the results of two studies documenting beneficial effects of intermittent fasting in human subjects, one in asthma patients (in collaboration with Dr. James Johnson at LSU Medical Center) and another in women at risk for breast cancer (in collaboration with Dr. Michelle Harvie at the University of Manchester), media coverage of Dr. Mattson’s research led to a  BBC  documentary and a subsequent book by Dr. Michael Mosley which have informed the public throughout Europe and North America of the health benefits of intermittent fasting.   In particular, a diet called the  5:2 diet , based on the studies of Drs. Harvie and Mattson has become widely popular.    A person on the 5:2 diet eats normal amounts of healthy food 5 days each week and eats only one moderate size (500-600 calorie) meal 2 days each week.  For many, this diet has proven easy to implement and maintain.\nA 2014 review described that studies done in animal models have shown fasting improves indicators of health—blood pressure, insulin sensitivity, and inflammation—likely through adaptive cellular responses to better handle stress. These findings suggest intermittent fasting has the potential to improve health and reduce the risk of chronic diseases; however this has not been reproduced in long-term human studies.  The review also concluded that intermittent fasting has not been studied in children, the elderly, or the underweight, and could be harmful in this population. They also suggest that those choosing to fast for periods of time greater than 24 hours should be monitored by a physician, as changes to the gastrointestinal system or  circadian rhythm  can occur.  The review also concluded that fasting is unlikely to have much effect on conditions other than obesity, such as aging or other chronic condition, unless combined with moderate calorie restriction and plant-based diet such as the Mediterranean diet.\nIn some contexts, fasting allows the consumption of a limited amount of low-calorie beverages such as coffee or tea. Modified fasting involves limiting caloric intake (e.g., 20% of normal) on fasting days rather than none at all, possibly retaining most of the benefits of intermittent fasting.\nIntermittent fasting (IF) is an umbrella term for various diets that cycle between a period of  fasting  and non-fasting. Intermittent fasting can be used along with calorie restriction for weight loss.\nLengthy fasting can be dangerous due to the risk of  malnutrition  and should be carried out only under medical supervision. During prolonged fasting or very low calorie diets the reduction of blood glucose, the preferred energy source of the  brain , causes the body to deplete its glycogen stores. Once glycogen is depleted the body begins to fuel the brain using ketones, while also metabolizing body protein (including but not limited to skeletal muscle) to be used to synthesize sugars for use as energy by the rest of the body. Most experts believe that a prolonged fast can lead to muscle wasting although some dispute this. The use of short-term fasting, or various forms of  intermittent fasting  have been used as a form of dieting to circumvent this issue.\nSo is Jimmy Kimmel. But unlike most celebrity-sanctioned diets, thereâ\u0080\u0099s actually some compelling science to support its purported benefits. Itâ\u0080\u0099s sometimes called the 5-2 dietâ\u0080\u0094meaning five days of normal eating followed by two days of severe calorie restrictionâ\u0080\u0094though itâ\u0080\u0099s more commonly referred to as intermittent fasting. No matter what you call it, avoiding food for hours or even days at a time appears to be more popular than ever.\nSimilar to the alternate-day diet and the 80:20 diets favoured by A-listers such as supermodel Miranda Kerr, the 5:2 plan promises to be the easiest fasting regime to adapt into your regular lifestyle. Essentially, on two (non-consecutive) days, you are recommended to consume just 500 calories (600 for men).t's the diet that claims to let you have your cake â\u0080\u0093 and eat it. And intermittent fasting isn't as scary as it sounds. Also nicknamed the 5:2 diet, the regime follows a relatively straightforward process allowing you to eat flavour-filled foods five days a week, whilst fasting on the other two.\nHow to Adopt an Intermittent Fasting Diet. Intermittent fasting (also known as, IF) is the practice of periodically going without food for repeated periods of time, typically on the order of 16 to 20 or up to 36 hours and then eat.\nCommunity Q&A. Intermittent fasting (also known as, IF) is the practice of periodically going without food for repeated periods of time, typically on the order of 16 to 20 or up to 36 hours and then eat. Then fast again after the flexible feeding window, the feeding period can slide and vary, as your schedule varies.\nThis method of intermittent fasting involves eating only within a certain â\u0080\u0098windowâ\u0080\u0099 of time each day. Some intermittent fasters prefer to fast every day but for a shorter length of time than attempt longer fasts as they find this easier to stick to.\nHere's a simple definition of intermittent fasting: you eat your normal amount of food in a smaller time frame. It's not a diet, it's just a pattern of eating that reduces your eating window each day to about 8 hours. For example, I usually eat my first meal around 12pm or 1pm and then I can continue eating until my final meal at 8pm.\nThe Military Diet is a form of intermittent fasting: Any diet that dictates less than 1000 calories a day is a type of fasting. And fasting changes the way the body works. For starters, fasting lowers levels of IGF-1 (Insulin-like Growth Factor).\nIntermittent fasting is the latest diet protocols that many people are starting to get excited about. They're tired of meticulously counting calories and eating small, unsatisfying meals throughout the day.\nIntermittent Fasting And Weight Control. The very first point to think about is what your primary aim of using intermittent fasting is for. If you're someone who is seeking fat loss and that's why you've chosen this diet over others, then you'll likely use it for however long it takes you to reach your goal weight.\nHere's how it works in a nutshell: Don't eat during certain hours of the day. When people practice intermittent fasting, they go without food for anywhere from 14 hours to several days. Some techies say intermittent fasting helps them focus and be more productive, while others laud the diet as an easy weight-loss hack. Here's what you need to know if you're thinking about trying a fast.\nAs you may have figured from its name, intermittent fasting is a diet plan where you fast for a set period of time during the day. This is usually between 16-20 consecutive hours. You eat during the other 4-8 hours of the day. While fasting you can eat and drink low calorie or calorie-free foods.es, you can. In fact, doing the right type of workout while fasting will help you lose weight faster and even build muscle. The best workouts to do while fasting for weight loss are 3-4 intense strength training workouts weekly. This means anything from standard strength training to kettlebell or body weight workouts.\nBy Dr. Mercola. Intermittent fasting is a powerful approach to eating that is becoming very popular because it can help you lose weight while reducing your risk of chronic diseases like diabetes and heart disease.\nThe Benefits of Intermittent Fasting Confirmed by the Latest Research. A new review evaluated the various approaches to intermittent fasting, particularly the advantages and limitations for its use in fighting obesity and type 2 diabetes.\nIntermittent Fasting: What It Is and How I Do It. Hereâ\u0080\u0099s a simple definition of intermittent fasting: you eat your normal amount of food in a smaller time frame. Itâ\u0080\u0099s not a diet, itâ\u0080\u0099s just a pattern of eating that reduces your eating window each day to about 8 hours.\nPeople often refer to their fasting windows by numbers: 19/5 or 21/3, for example, means 19 hours of fasting and 5 hours eating or 21 hours fasting and 3 hours eating, respectively. Once you have the hang of eating on a schedule, you can try short periods of 18-24 hour fasting. Then you can judge if intermittent fasting is for you. Whether you decide to do it every day, once a week, or twice a week is up to you â\u0080\u0093 do what makes you feel best and listen to your body.\nBy fasting and then feasting on purpose, intermittent fasting means eating your calories during a specific window of the day, and choosing not to eat food during the rest. Now, there are a few different ways to take advantage of intermittent fasting: Regularly eat during a specific time period.\nIntermittent fasting, which can involve anything from fasting for 14 hours at a time to forgoing food a couple days a week, is all about restricting food consumption during specified periods of time. You consume little to no calories during â\u0080\u009cfastingâ\u0080\u009d periods, and eat pretty normally during â\u0080\u009cfeastingâ\u0080\u009d times.\nWhen most people mention intermittent fasting, this is what they mean. The most common eating window is eight hoursâ\u0080\u0094for example, only eating between 10pm and 6pm or between 12pm and 8pm, then not eating anything outside of those hours. Thatâ\u0080\u0099s 16 hours of fasting and eight hours of eating each day. This is often referred to as 18/6 intermittent fasting. Some people will decrease the eating window even further, such as 20/4 or even as lower as 23/1, only eating one hour a day. Choosing your eating window can vary based on what works best for you, but starting with the standard 18/6 is best for most people.\nMany people who intermittent fast in the common fasting window method (16/8, 18/6, etc.) do it on a daily basis. This is helpful for getting into a rhythm than works and getting used to how intermittent fasting feels.\nCrescendo Fasting for Women. Intermittent fasting for women can be hard on your body if you are new to it or if you jump in too quickly. So if you are a woman or trying fasting for the first time, you might benefit from modified â\u0080\u0094 or crescendo â\u0080\u0094 intermittent fasting. Crescendo fasting only requires you to fast a few days a week instead of every day.\nHow often is okay to do these forms of fasting? Frequency of Intermittent Fasting. The answer to that question above is pretty simple: as long as your health is good and you fast safely, you can do intermittent fasting as often as youâ\u0080\u0099d like! In order to get the most benefit from fasting, planning for it regularly is recommended.\nAs a result, one good example of an autophagy diet is intermittent fasting. For example, one intermittent fasting approach involves fasting for 24 hours once or twice a week, while another approach is fasting for 16 hours and having an 8 hour â\u0080\u0098feeding periodâ\u0080\u0099 each day.\n2. Best way to schedule your daily fast. 1  When you're intermittent fasting you can schedule your 14-to-20 hour fasting & 4-to-10 hour feasting cycle anyway you want to but for the best resultsâ\u0080¦. 2  Its best that you eat your last meal 2-to-3 hours before bedtime so you'll spend less hours awake while you fast andâ\u0080¦.magine how fast you'll lose fat combining Intermittent Fasting with a weight loss diet & exercise plan. 1  You're losing fat fast without diet & exercise when you fast 14-to-20 hours per day plusâ\u0080¦. 2  You're losing fat fast when you eat less on your weight loss diet &â\u0080¦.\nHere's an example intermittent fasting schedule over a 24 hour period where you fast for 16 hours and eat over an 8 hour periodâ\u0080¦. 1  Sunday night at 8pm: You finish eating your last meal.magine how fast you'll lose fat combining Intermittent Fasting with a weight loss diet & exercise plan. 1  You're losing fat fast without diet & exercise when you fast 14-to-20 hours per day plusâ\u0080¦. 2  You're losing fat fast when you eat less on your weight loss diet &â\u0080¦.\nIntermittent fasting is a great tool for getting strong and lean without changing your diet. But it can also seem confusing or extreme if you're not familiar with it. In fact, my guide seemed to prompt quite a few questions, many of which I responded to over email.\nAsk the Diet Doctor: The Pros & Cons of Fasting for Weight Loss. People see intermittent fasting as a quick solution for weight loss. Fasting for weight loss seems to be one of the hottest diet trends right now. But despite its current popularity, fasting has been used for thousands of years for various purposes.\nwikiHow to Adopt an Intermittent Fasting Diet. Community Q&A. Intermittent fasting (also known as, IF) is the practice of periodically going without food for repeated periods of time, typically on the order of 16 to 20 or up to 36 hours and then eat. Then fast again after the flexible feeding window, the feeding period can slide and vary, as your schedule varies.", "key": "78_7", "timestamp": "2020-06-23 21:18:59.341224", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}