{"input_text": "In 1974, after retiring from the Air Force, Boyne joined the National Air and Space Museum as curator of air transport. Prior to the opening of the museum in 1976, he was assigned responsibility for introducing all aircraft into their exhibits. Boyne was also responsible for transforming the museum's dilapidated  Silver Hill  facility into the world's premier restoration facility. He also organized the effort to rename the facility in honor of  Paul E. Garber , a curator of the National Air Museum—the predecessor to the National Air and Space Museum.\nThe spacecraft is on permanent display at the  National Air and Space Museum ,  Washington, D.C.\nThe National Air and Space Museum is a center for research into the history and science of  aviation  and  spaceflight , as well as  planet ary science and terrestrial  geology  and  geophysics . Almost all space and aircraft on display are originals or the original backup craft. It operates an annex, the  Steven F. Udvar-Hazy Center , at  Dulles International Airport , which opened in 2003 and itself encompasses . The museum currently conducts restoration of its collection at the  Paul E. Garber Preservation, Restoration, and Storage Facility  in  Suitland, Maryland , while steadily moving such restoration and archival activities into its Udvar-Hazy annex facilities .\nThe Air and Space museum  was originally called the National Air Museum when formed on August 12, 1946 by an act of  Congress  and signed into law by President  Harry S. Truman .  Some pieces in the National Air and Space Museum collection date back to the 1876  Centennial Exposition  in  Philadelphia  after which the Chinese Imperial Commission donated a group of kites to the Smithsonian after Smithsonian Secretary Spencer Fullerton Baird convinced exhibiters that shipping them home would be too costly. The  String fellow  steam engine intended for aircraft was added to the collection in 1889, the first piece actively acquired by the Smithsonian now in the current NASM collection.\nSeveral rovers were created for testing, training, or validation purposes. The engineering mockup is on display at the  Museum of Flight  in  Seattle, Washington . The Qualification Test Unit is on display at the  National Air and Space Museum  in  Washington, D.C.  The rover used for vibration testing is on display in the Davidson Saturn V Center at the  U.S. Space & Rocket Center  in  Huntsville, Alabama . Additional test units are on display at the  Johnson Space Center  in  Houston, Texas , and the  Kennedy Space Center Visitors Complex  in  Cape Canaveral, Florida . Replicas of rovers are on display at the  National Museum of Naval Aviation  in  Pensacola, Florida , the  Evergreen Aviation & Space Museum  in  McMinnville, Oregon , and the  Kansas Cosmosphere and Space Center  in  Hutchinson, Kansas . A replica on loan from the Smithsonian Institution is on display at the  Mission: Space  attraction at  Epcot  at the  Walt Disney World Resort  near  Orlando, Florida .\nFlight and mid-deck training hardware will be taken from the  Johnson Space Center  and will go to the National Air and Space Museum and the  National Museum of the U.S. Air Force . The full fuselage mockup, which includes the payload bay and aft section but no wings, is to go to the  Museum of Flight  in Seattle. Mission Simulation and Training Facility's fixed simulator will go to the  Adler Planetarium  in Chicago, and the motion simulator will go to the  Texas A&M  Aerospace Engineering Department in College Station, Texas. Other simulators used in Shuttle astronaut training will go to the  Wings of Dreams Aviation Museum  in Starke, Florida and the  Virginia Air and Space Center  in Hampton, Virginia.\nAfter 2,350 hours and 1,691 flights the aircraft was withdrawn from use in 1969 and placed in storage. On May 26, 1972 Boeing donated the 367-80 to the  Smithsonian Air and Space Museum , which had designated it one of the 12 most significant aircraft of all time. For the next 18 years the aircraft was stored at a  \"desert boneyard\"  now called the  309th Aerospace Maintenance and Regeneration Group  (AMARG) at  Davis-Monthan Air Force Base  near  Tucson ,  Arizona  before being retrieved by Boeing in 1990 for restoration. The Dash 80's final flight was to  Dulles International Airport  near  Washington, D.C.  on August 27, 2003. Repainted to its original yellow and brown Boeing livery, it was put on display at the  Steven F. Udvar-Hazy Center , an annex of the  Smithsonian Institution 's  National Air and Space Museum , located adjacent to  Dulles Airport  in Chantilly, Virginia.\nIn the 1980s, veterans groups engaged in a call for the Smithsonian to put the aircraft on display, leading to an acrimonious debate about exhibiting the aircraft without a proper historical context. The cockpit and nose section of the aircraft were exhibited at the  National Air and Space Museum  (NASM) in downtown Washington, D.C., for the bombing's 50th anniversary in 1995, amid controversy. Since 2003, the entire restored B-29 has been on display at NASM's  Steven F. Udvar-Hazy Center . The last survivor of its crew,  Theodore Van Kirk , died on July 28, 2014, at the age of 93.\nOut of the five fully functional shuttle orbiters built, three remain. Enterprise, which was used for atmospheric test flights but not for orbital flight, had many parts taken out for use on the other orbiters. It was later visually restored and was on display at the  National Air and Space Museum 's  Steven F. Udvar-Hazy Center  until April 19, 2012. Enterprise was moved to New York City in April 2012 to be displayed at the  Intrepid Sea, Air & Space Museum , whose Space Shuttle Pavilion opened on July 19, 2012.  Discovery replaced Enterprise at the  National Air and Space Museum 's  Steven F. Udvar-Hazy Center . Atlantis formed part of the Space Shuttle Exhibit at the  Kennedy Space Center  visitor complex and has been on display there since June 29, 2013 following its refurbishment.\nAdditionally, the National Air and Space Museum Library features special collections housed in both the Dewitt Clinton Ramsey Room and the Aerospace Legacy Materials Collection Gift Collection (ALM Collection). Located in the National Air and Space Museum's Mall location, the Dewitt Clinton Ramsey Room houses rare books, serials, oral histories, vertical files, and the Bella Landauer Collection of sheet music. Housed in the Smithsonian Institution Libraries’ Research Annex in Landover, MD, the ALM Collection is a growing body of largely  grey literature  in the form of government manuals, reports, studies, and surveys capturing the history and evolution of civil aviation..\nIn the  United States ,  NASA , which led the US space agencies, responded to ISY with the completion or creation of many important space programs, including numerous collaborations with other domestic and international space agencies. A total of twelve programmes were launched, the most in any year up to that point. NASA focused particularly on projects — such as the  Mars Observer , which studied the atmosphere and climate of  Mars  — that examined the possibility of sustaining human life outside Earth, as well as those exploring problems that existed on Earth at the time. ISY was also recognized with the opening of a new exhibit, entitled \"Where Next, Columbus?\" at the  National Air and Space Museum .\nIn 1989, Air France signed a letter of agreement to donate a Concorde to the  National Air and Space Museum  in Washington D.C. upon the aircraft's retirement. On 12 June 2003, Air France honoured that agreement, donating Concorde F-BVFA (serial 205) to the Museum upon the completion of its last flight. This aircraft was the first Air France Concorde to open service to Rio de Janeiro, Washington, D.C., and New York and had flown 17,824 hours. It is on display at the Smithsonian's  Steven F. Udvar-Hazy  Center at  Dulles Airport .\nFrom 1985 to 2003, Enterprise was stored at the  Smithsonian 's hangar at  Washington Dulles International Airport  before it was restored and moved to the Smithsonian's newly built  National Air and Space Museum   Steven F. Udvar-Hazy Center  at Washington Dulles, where it was the centerpiece of the space collection. On April 12, 2011, NASA announced that , the most traveled orbiter in the fleet, would be added to the collection once the  Shuttle fleet was retired . On April 17, 2012, Discovery was transported by  Shuttle Carrier Aircraft  to Dulles from  Kennedy Space Center , where it made several passes over the Washington D.C. metro area.\nAfter N703NA was retired from test operations, it was donated to the Smithsonian  National Air and Space Museum  in Washington, D.C.  The XV-15 was flown cross-country from Fort Worth, Texas to the museum before being decommissioned for display.  It is now on display at the  Steven F. Udvar-Hazy Center  at  Washington Dulles International Airport .\nHe 219 A-2 Werknummer 290 202 is undergoing restoration in the collection of the  Smithsonian   National Air and Space Museum  in  Washington, D.C. ,  USA . The  fuselage  has been put on display at the  Steven F. Udvar-Hazy Center  by Dulles Airport, however, the wings were not attached as of late August 2016. The wings had been stored at the  Paul Garber Facility  in Silver Hill, Maryland. The repainted wings were displayed during the January 30, 2016 open house in the restoration hangar paint shack. , the completely restored fuselage and tail surfaces, along with the aircraft's partially restored DB 603 engines and nacelles (possibly as Heinkel-designed specific,  Kraftei  unitized powerplant installations) displayed nearby, can be seen displayed near the museum's  Dornier Do 335  and  Arado Ar 234 , the only surviving examples of each aircraft existing in 21st century aviation museums anywhere, and which were aircraft that accompanied WkNr. 290 202 across the Atlantic over 60 years ago. By August 2014 the wing structure (without control surfaces fitted) had been essentially restored, and was ready for the trip to the NASM's Udvar-Hazy shops to join the fuselage and engine nacelles there, with replacement Hirschgeweih VHF-band radar antenna components to be fabricated, based on a preserved example located in Europe and loaned to the NASM for replication, as part of the ongoing restoration process.\nMary Feik retired from the  National Air and Space Museum ’s (NASM) Paul E. Garber Restoration Facility as a Restoration Specialist. She restored antique and classic aircraft and has participated in the construction of reproduction  World War I  aircraft, helping restore the  National Air and Space Museum ’s 1910  Wiseman-Cooke  aircraft, a WWI Spad XIII fighter,  Betty Skelton's   Little Stinker  and a 1930  Northrop   \"Alpha\"   mail plane . Feik's personal  Short Winged Piper  is undergoing restoration for donation to an air museum.\nThe present  National Air and Space Museum  building opened in 1976. Most important, Garber, as first curator and devotee, helped to assemble the most impressive collection of historic aircraft in the world for the Institution.\nThe Command Module Columbia is displayed at the  National Air and Space Museum , Washington, D.C. It is in the central Milestones of Flight exhibition hall in front of the Jefferson Drive entrance, sharing the main hall with other pioneering flight vehicles such as the  Wright Flyer , the  Spirit of St. Louis , the  Bell X-1 , the  North American X-15 ,  Mercury  spacecraft  Friendship 7 , and  Gemini 4 . Armstrong's and Aldrin's space suits are displayed in the museum's Apollo to the Moon exhibit. The quarantine trailer, the flotation collar, and the righting spheres are displayed at the Smithsonian's  Steven F. Udvar-Hazy Center  annex near  Washington Dulles International Airport  in Virginia.\nThe record setting V-8 motorcycle is now in the  Smithsonian's   National Air and Space Museum . The Air and Space museum lent it to the  Guggenheim  for the 1998  The Art of the Motorcycle  exhibition in New York.\nIn May 2007, a full-scale model of the telescope was assembled for display at the  Smithsonian Institution 's  National Air and Space Museum  on the  National Mall ,  Washington D.C.   The model was intended to give the viewing public a better understanding of the size, scale and complexity of the satellite, as well as pique the interest of viewers in science and astronomy in general. The model is significantly different from the telescope, as the model must withstand gravity and weather, so is constructed mainly of aluminum and steel measuring approximately  and weighs .\nThe National Air and Space Museum Film Archives, part of the Archives Division at the  National Air and Space Museum ,  Smithsonian Institution , holds over 20,000 films documenting the history of  aviation  and  space flight .\nThe museum claims to be \"the only aviation museum and research center situated at a major airport and the only facility with a primary emphasis on contributions of  civil aviation  to the history and development of  Southern California \". There are other museums at major airports, however, including the  Udvar-Hazy Center  of the  National Air and Space Museum  adjacent to  Washington Dulles Airport , the  Royal Thai Air Force Museum  at  Don Muang Airport , the  Suomen ilmailumuseo  ( Finnish Aviation Museum ) at  Helsinki-Vantaa Airport , the  Frontiers of Flight Museum  at  Dallas Love Field , the  Tulsa Air and Space Museum & Planetarium  at  Tulsa International Airport  and others.\nThe Washington Post  reported on 3 November 2007 that the Air and Space Museum's collections committee, an advisory group on the acquisition and transfer of aircraft, had voted 5–4 on 28 September 2007 for deaccessioning The Swoose, and transfer it to the  National Museum of the United States Air Force  in Dayton, Ohio. The panel forwarded its decision to Gen. John R. \"Jack\" Dailey, the museum director, and Donald S. Lopez Sr., the deputy director, who subsequently decided to stand by the committee's recommendation. \"There were good arguments on both sides,\" said Dailey, who had requested a collections review to alleviate a storage crunch at the aforementioned Paul Garber Restoration Facility, where The Swoose has been stored since 1961. The Swoose has never been in a plan to be displayed, Dailey said. A recommended condition of this transfer was that the National Museum of the United States Air Force transfer ownership of a restored B-17 to the National Air and Space Museum's  Udvar V. Hazy  site for display, as that museum lacks a B-17. The matter was discussed by the governing board of the Dayton museum, and with the recent arrival of the B-17F  Memphis Belle  it was decided that continued display of the Museum's  B-17G Shoo Shoo Baby  would be unnecessary. Upon completion of the restoration and display of the Swoose, Shoo Shoo Baby will be transferred to the Washington D.C. museum for display (Memphis Belle is not expected to be completed until 2015). This decision raised some concerns among the staff and patrons of the Dayton museum, as \"Shoo Shoo Baby\" is one of the world's finest restored examples of a B-17G, and has been a popular exhibit at the museum for many years. It was eventually pointed out that with the display of the Swoose and eventual display of the Memphis Belle the National Museum of the United States Air Force will possess the world's two most historically significant B-17s, and another B-17G model can easily be obtained when funds and space become available.\nThe National Air and Space Museum of the  Smithsonian Institution , also called the NASM, is a museum in  Washington, D.C. . It holds the largest collection of historic  aircraft  and  spacecraft  in the world. It was established in 1946 as the National Air Museum and opened its main building on the  National Mall  near  L'Enfant Plaza  in 1976.  In 2014, the museum saw approximately 6.7 million visitors, making it the fifth most visited museum in the world.\nOn September 16, 1959 the  United States Air Force  released the XJ49 engine to the  National Air Museum  (now the National Air and Space Museum), and is now in storage at their  Silver Hill, Maryland  facility.\nEnola Gay , AAF Serial Number 44-86292, was another \"Silverplate\" conversion for the 393rd Bomb Squadron,  509th Composite Group . On 6 August 1945 it dropped the \" Little Boy \"  uranium  atomic bomb on  Hiroshima , Japan.  For many years it was in storage at Paul Garber facility at  National Air and Space Museum  (NASM),  Washington, D.C.  It was recently re-assembled after a lengthy restoration and is currently displayed at the Smithsonian's  Steven F. Udvar-Hazy Center  at  Dulles International Airport .\nAt the end of the space shuttle program the SCA was used to deliver the retired orbiters from the Kennedy Space Center to their museums. Discovery was delivered to the  Udvar-Hazy Center  of the  Smithsonian Institution 's  National Air and Space Museum  in  Chantilly, Virginia , near Washington, D.C. on April 19, 2012.  On April 17, 2012, Discovery was flown atop a Shuttle Carrier Aircraft escorted by a NASA T-38 Talon chase aircraft in a final farewell flight.  The 747 and Discovery flew over Washington, D.C. and the metropolitan area around 10 am and arrived at Dulles around 11 am. The flyover and landing were widely covered on national news media.\nThe three most popular museums in the area are the Air and Space Museum, the National Museum of American History, and the National Museum of Natural History.\nBoeing is underwriting this interactive exhibition that explores the marvels of aerospace innovation, design and technology. The global tour will debut Aug. 1, 2015, at Smithsonian's National Air and Space Museum in Washington, D.C.A worldwide tour will follow.oeing is underwriting this interactive exhibition that explores the marvels of aerospace innovation, design and technology. The global tour will debut Aug. 1, 2015, at Smithsonian's National Air and Space Museum in Washington, D.C.\nAbove and Beyond Traveling Exhibit. Boeing is underwriting this interactive exhibition that explores the marvels of aerospace innovation, design and technology. The global tour will debut Aug. 1, 2015, at Smithsonian's National Air and Space Museum in Washington, D.C.A worldwide tour will follow.bove and Beyond Traveling Exhibit. Boeing is underwriting this interactive exhibition that explores the marvels of aerospace innovation, design and technology. The global tour will debut Aug. 1, 2015, at Smithsonian's National Air and Space Museum in Washington, D.C.\nWhy Space Exploration is Important to the United States. A version of this essay was first presented at the National Society of Black Engineer's Annual Conference luncheon in Pittsburgh, PA this past April. One of the hardest questions that is often asked of us rocket scientists is why is space exploration important?. Even JFK tried to answer this question many years ago.\nThe National Air & Space Museum explores the invention, history, science, and technology of aviation and space flight. The Anacostia Museum has a special exhibit: The Real McCoy, African-American Invention and Innovation, 1619-1930 and the Remembering Gallery's exhibit: American Inventors and Inventions.\nOur Museum in Washington, DC and the Udvar-Hazy Center in Chantilly, VA display hundreds of the world's most significant aviation and space artifacts. Each location offers a distinct experience. Choose a location to learn more and plan your visit.\nA great list of things to do when you visit Washington, D.C. 1  Visit the Capitol Building. 2  Look at the Washington Monument. 3  Tour The White House. 4  Visit the Hirshhorn Museum and Sculpture Garden. 5  Explore flight at the Smithsonian National Air and Space Museum.\nVisiting the Smithsonian National Air & Space Museum. Blast off at one of the nationâ\u0080\u0099s most popular museums. Glimpse the 1903 Wright Flyer, run your hands over moon rock and experience the larger-than-life world of aviation and space travel at the National Air and Space Museum.\nVisiting the Smithsonian National Air & Space Museum. A museum that goes above and beyond. Glimpse the 1903 Wright Flyer, run your hands over moon rock and experience the larger-than-life world of aviation and space travel at the National Air and Space Museum.\nThe Wright brothers' invention is so technically and culturally significant that the National Air and Space Museum in Washington, D.C., keeps the Wright Flyer on permanent display. For more information on inventors Orville and Wilbur Wright and their airplane invention, please visit:Time 100: The Wright Brothers. Inventors of the Week: Orville and Wilbur Wright. Wright Brothers & the Invention of the Aerial Age.hough only five people were there to witness the flight, the invention would eventually become one of the most important of the twentieth century â\u0080\u0093 one that would unite people throughout the United States and the world. Inventors Orville and Wilbur Wright took a great interest in flight and invention from an early age.\nThe Smithsonian National Air and Space Museum is a true place of wonder in Washington DC. Whether you want to avoid the rain showers or get out of the June sun. It doesnâ\u0080\u0099t matter what is happening with the weather outside, the Smithsonian National Air and Space Museum will take you to a whole new world.\nAsk An Explainer; About the Exhibit; How Things Fly Smithsonian National Air and Space Museum\nThe National Air and Space Museum of the Smithsonian Institution, also called the NASM, is a museum in Washington, D.C.. It holds the largest collection of historic aircraft and spacecraft in the world.\nThe Bell X-1, designated originally as XS-1, was a joint National Advisory Committee for Aeronautics-U.S. Army Air Forces-U.S. Air Force supersonic research project built by the Bell Aircraft Company.-1-1 at the National Air and Space Museum. 1  X-1-1, Air Force Serial Number 46-062, is currently displayed in the Milestones of Flight gallery of the National Air and Space Museum in Washington, DC, alongside the Spirit of St. Louis and SpaceShipOne.\nThe National Air and Space Museum in Washington, DC has thousands of objects on display, including the 1903 Wright Flyer, Charles Lindbergh's Spirit of St. Louis, and a lunar rock you can touch. In addition to our exhibition galleries, you may want to visit the Albert Einstein Planetarium, Lockheed Martin IMAXÂ® Theater, and the Public Observatory on the east terrace.\nWashington, DC's most popular museum - Smithsonian National Air and Space Museum. â\u0080\u009cWashington, DC's most popular museumâ\u0080\u009d Review of Smithsonian National Air and Space Museum. Owner description: The most popular of the Smithsonian museums features the Wright Brothers' 1903 Flyer and Lindbergh's Spirit of St. Louis. One can easily understand why so many people come to the museum. Countless pieces of aviation history are displayed here.\nYou are here. Visit. The National Air and Space Museum in Washington, DC has thousands of objects on display, including the 1903 Wright Flyer, Charles Lindbergh's Spirit of St. Louis, the Apollo 11 Command Module Columbia, and a lunar rock you can touch.\nThe National Air and Space Museum is the largest of 19 museums included in the Smithsonian Institution. The Museum's Director is assisted by three Associate Directors, who oversee Research and Curatorial Affairs; Management and Public Programs; and External Affairs.\nNeil Armstrong's widow finds artifacts from moonwalk in a closet. Neil Armstrong's famous moon walk is commemorated at the National Air and Space Museum. The Apollo 11 command module, now on display at the National Air and Space Museum, was one of three parts of the Apollo spacecraft.\nSteven F. Udvar-Hazy Center - National Air and Space Museum, , 14390 Air and Space Museum Parkway, Chantilly, VA 20151, (202) 357-2200. Located near Dulles International Airport, this Smithsonian museum (which is locally called the Dulles Air and Space Museum) opened in 2003 to house many illustrious air/spacecraft that would not fit into the 1976 museum in the National Mall.\nThe Best Museums In D.C. That Aren't On The National Mall. There's no question that D.C. is a museum town. Situated just off the National Mall, dozens of free Smithsonian Museumsâ\u0080\u0094such as the National Air & Space Museum, the Museum of Natural History, and othersâ\u0080\u0094attract millions of visitors to D.C. every year.\nNeil Armstrong's famous moon walk is commemorated at the National Air and Space Museum. The Apollo 11 command module, now on display at the National Air and Space Museum, was one of three parts of the Apollo spacecraft. An American flag is part of the display at the Smithsonian's National Air and Space Museum.\nNational Air and Space Museum Lowers â\u0080\u009cSpirit of St. Louisâ\u0080\u009d to Ground Level. For the first time in more than 20 years, the Smithsonianâ\u0080\u0099s National Air and Space Museum has lowered Charles Lindberghâ\u0080\u0099s Ryan NYP â\u0080\u009cSpirit of St. Louisâ\u0080\u009d to the floor.", "key": "54_3", "timestamp": "2020-06-23 21:18:59.120566", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}