{"input_text": "Health effects include eye, nose, and  throat irritation ; headaches, loss of coordination, nausea; and damage to the liver, kidney, and central nervous system. Some organics can cause cancer in animals; some are suspected or known to cause cancer in humans. Key signs or symptoms associated with exposure to VOCs include conjunctival irritation, nose and throat discomfort, headache, allergic skin reaction,  dyspnea , declines in serum  cholinesterase  levels, nausea, vomiting, nose bleeding, fatigue, dizziness.\nIn recent years, the United States has experienced an increase in the number of cases of throat cancer caused by HPV type 16. Throat cancers associated with HPV have been estimated to have increased from 0.8 cases per 100,000 people in 1988 to 2.6 per 100,000 in 2004. Researchers explain these recent data by an increase in oral sex. Moreover, findings indicate this type of cancer is much more prevalent in men than in women, something that needs to be further explored. Currently, two immunizations, Gardasil and Cervarix, are recommended to girls to prevent HPV-related cervical cancer, but not as a precaution against HPV-related throat cancer.\nAwareness of one’s HPV status is crucial: it is estimated that 75-80% of sexually active men and women in the U.S. will be exposed to the HPV virus at some point in their lives. HPV is the cause of  genital wart s, and high-risk HPV can cause  cervical cancer  in women and  oropharyngeal (back of throat) cancer  in men. High-risk HPV viruses also cause cancer of the vagina and anus.\nAnother study in  The New England Journal of Medicine  suggests a  correlation  between oral sex and  throat cancer . It is believed that this is due to the transmission of HPV, a virus that has been implicated in the majority of cervical cancers and which has been detected in throat cancer tissue in numerous studies. The study concludes that people who had one to five oral sex partners in their lifetime had approximately a doubled risk of throat cancer compared with those who never engaged in this activity and those with more than five oral sex partners had a 250 percent increased risk.\nHuman papillomavirus es (HPV) are another particularly common cancer-causing virus.  HPV is well known for causing  genital warts  and essentially all cases of  cervical cancer , but it can also infect and cause cancer in several other parts of the body, including the  larynx ,  lining of the mouth, nose, and throat ,  anus , and  esophagus .  The  Papanicolaou smear  (\"Pap\" smear) is a widely used cancer screening test for cervical cancer.  DNA-based tests to identify the virus are also available.\nThe ash cloud led Argentina to declare a state of emergency for farmers as the prolonged eruption's continued effect on the 2 million head of sheep that graze in southern Argentina.  Chubut  and  Río Negro Province s had suffered five years of drought, and the ash destroyed the little pastureland still serviceable. 750,000 sheep suffered the consequences, and Rio Negro officials said 60,000 head of cattle also were \"at risk.\"The Livestock had suffered major heart attacks and got throat cancer, which made them die. Whereas there appears to be no published support for the existence of heart attacks or throat cancer as a consequence from the exposure to ashes and causing death, there are at least 2 phenomena which play a role. For one, the physical reduction of available forage (on top of the prevailing general drought conditions) has resulted in lack of forage, and therefore, starvation with all its consequences. This was accelerated by the rapid wear of teeth from the abrasive action of ashes, and thus a reduced efficiency to forage. The second reason is that these ashes cause fluoride intoxication in herbivores, with many different symptoms, and confirmed in sheep, cattle and horses.\nSexually transmitted forms of HPV account for about 25% of cancers of the mouth and upper throat (the oropharynx). The latter commonly present in the  tonsil  area, and HPV is linked to the increase in oral cancers in nonsmokers. Engaging in anal or oral sex with an HPV-infected partner may increase the risk of developing these types of cancers. Oral infection with several types of HPV, in particular type 16, have been found to be associated with  HPV-positive oropharyngeal cancer , a form of  head and neck cancer . This association is independent of  tobacco  and  alcohol  use. In the United States, HPV is expected to replace tobacco as the main causal agent for oral cancer, and the number of newly diagnosed, HPV-associated head and neck cancers is expected to surpass that of cervical cancer cases by 2020.\nIn November 2010, Douglas's doctors put him on a special weight-gain diet due to excessive weight loss that had left him weak. On January 11, 2011, he said in an interview that the tumor was gone, though the illness and aggressive treatment had caused him to lose thirty-two pounds. He noted that he would require monthly screenings because of a high chance of recurrence within two to three years. In June 2013, Douglas told  The Guardian  that his type of cancer is caused by  HPV , transmitted by  cunnilingus , leading some media to report this as well. His spokesman denied these reports and portrayed Douglas's conversation with The Guardian as general and not referring specifically to his own diagnosis. Although Douglas described the cancer as  throat cancer , it was publicly speculated that he may actually have been diagnosed with  oropharyngeal cancer . In October 2013, Douglas said he had suffered from tongue cancer, not throat cancer. He announced it as throat cancer upon the advice of his physician, who felt it would be unwise to reveal that he had tongue cancer given its negative prognosis and potential for disfigurement, particularly because the announcement came immediately before Douglas's promotional tour for  Wall Street: Money Never Sleeps .\nAfter Raiola began experiencing pain in her throat in March 2015, doctors diagnosed her with strep throat and placed her on antibiotics. When the pain continued, she went to an ear, nose and throat specialist, who detected a tumor and scheduled her for immediate surgery. In April 2015, the tumor and  lymph node s on the left side of her neck were removed during an eight-hour operation. In May 2015, the lymph nodes on the right side of her neck were also removed. Though she was thought to be cancer-free following the surgeries, a throat scan in December revealed that the cancer had returned. It was later revealed that the cancer had spread to her lungs and brain. By January 2016, the tumors no longer responded to the  chemotherapy  and continued to grow. The family was advised that they would need to start  immunotherapy  the following week. Raiola stated during an interview that the cancer was caused by her forty years of smoking. She said, \"If you're smoking, quit now, and if you've never smoked, don't start.\"\nNinety percent  of cases of  head and neck cancer  (cancer of the mouth, nasal cavity, nasopharynx, throat and associated structures) are due to squamous cell carcinoma.\nSmoking harms nearly every organ inthe body, and adolescents who smoke have higher risks of developing healthissues sooner in life, rather than later. Smoking regardless of age causes healthissues including  lung cancer ,  throat cancer ,  mouth cancer ,  heart disease ,  heart attacks , stroke s,  lung diseases , diseases affecting the eyes, gums,  blood vessel s, bonesand gut, and countless others.\nHuman papillomavirus infection is an  infection  by human papillomavirus (HPV). Most HPV infections cause no symptoms and resolve spontaneously. In some, they persist and result in  wart s or  precancerous lesions . The precancerous lesions increase the risk of cancer of the  cervix ,  vulva ,  vagina ,  penis ,  anus ,  mouth, or throat . Nearly all  cervical cancer  is due to HPV with two types, HPV16 and HPV18, accounting for 70% of cases. Between 60 and 90% of the other cancers are also linked to HPV. HPV6 and HPV11 are common causes of  genital wart s and  respiratory papillomatosis .\nBloodgood was quick to make use of  X-ray s, discovered in 1895, to investigate bone tumors.He was an early adopter of irradiation as a cancer treatment.He was awarded a gold medal by the  Radiological Society of North America  for his use of X-rays and  radium  to study, diagnose and treat malignant bone tumors.Bloodgood found that \" giant-cell sarcoma \" were bone tissue reactions to irritants rather than malignant growths, and could be cured by  curettage  rather than by amputating the limb.Bloodgood thought that the correlation of mouth and throat cancer with tobacco user could be due at least in part to irritation of the tissues by some substance in the tobacco, which would be aggravated by poor oral hygiene.  He said in 1932 that \"the modern woman who keeps her teeth clean and in good shape teaches men how one should smoke with a minimal risk of cancer.\"\nOropharyngeal squamous cell carcinomas  is a type of  head and neck cancer  that begins in the oropharynx, the middle part of the throat that includes the soft palate, the base of the tongue, the tonsils, and the side and back wall of the throat. Squamous cell cancers of the tonsils are more strongly associated with  human papillomavirus  infection than are cancers of other regions of the head and neck.\nHolman died on Friday December 2, 2005 in  Lakewood, New Jersey  at the age of 75. Wayne Pomanowski, a friend of Frank, stated that Holman died while being treated for throat cancer. Mr. Holman was a cigar smoker for years which led to his apparent death from throat cancer.\nLung cancer  is the most common cancer in the world, both in terms of cases (1.6 million cases; 12.7% of total cancer cases) and deaths (1.4 million deaths; 18.2% of total cancer deaths).  Lung cancer is largely caused by tobacco smoke.  Risk estimates for lung cancer in the United States indicate that tobacco smoke is responsible for 90% of lung cancers.  Other factors are implicated in lung cancer, and these factors can interact synergistically with smoking so that total attributable risk adds up to more than 100%.  These factors include occupational exposure to carcinogens (about 9-15%), radon (10%) and outdoor air pollution (1-2%).  Tobacco smoke is a complex mixture of more than 5,300 identified chemicals.  The most important carcinogens in tobacco smoke have been determined by a “Margin of Exposure” approach.  Using this approach, the most important tumorigenic compounds in tobacco smoke were, in order of importance, acrolein, formaldehyde, acrylonitrile, 1,3-butadiene, cadmium, acetaldehyde, ethylene oxide, and isoprene.  Most of these compounds cause DNA damage by forming DNA adducts or by inducing other alterations in DNA.  DNA damages are subject to error-prone DNA repair or can cause replication errors.  Such errors in repair or replication can result in mutations in tumor suppressor genes or oncogenes leading to cancer.\nIn 1999, Tanner received a 'Golden Quill Award' for 'Lifetime Achievement in the Arts'. Apart from a prolific career as a cartoonist, Tanner co-wrote several books on black and white art.  He made an animated film called Letter To A Vandal and was an actor and set designer for the New Theatre from 1946 until 1955. As a child he appeared in a number of  films including  comedian   George Wallace 's Gone to the Dogs, Our Gang, an RTA commercial co-starring  Gloria Dawn  and  Forty Thousand Horsemen . In 1986, he worked as a  voice coach  for Sir  Donald Pleasence  for the film  Ground Zero , which starred  Colin Friels . Pleasence's character in the movie was a scientist who had contracted  throat cancer , following  British nuclear tests at Maralinga . Tanner, a throat cancer sufferer, was pleased to help Pleasence learn to operate a Servox speech aid for his role.\nA bacterial infection - eg a strep throat Cancer - eg cancerâ\u0080¦ of the throat. Are SOME causes of a sore throat. IF you are concerned about your throat or health, you should go and see a qualified medical practitioner (a Doctor) for an examination, diagnosis and possible treatment. (MORE)\nSecondhand smoke is smoke that is exhaled by smokers and smoke emitted from the burning end of a lit cigarette, cigar, or pipe. It causes more than 7,000 lung cancer deaths each year in persons who do not smoke. It can also lead to lung conditions and heart disease.moking, including secondhand smoke, is the leading cause of lung cancer. Other cancers. Not only does smoking increase the risk of lung and oral cancer, it also increases the risk of other respiratory system cancers including cancer of the nose, sinuses, voice box, and throat.\nSmoking, including secondhand smoke, is the leading cause of lung cancer. Other cancers. Not only does smoking increase the risk of lung and oral cancer, it also increases the risk of other respiratory system cancers including cancer of the nose, sinuses, voice box, and throat.moking, including secondhand smoke, is the leading cause of lung cancer. Other cancers. Not only does smoking increase the risk of lung and oral cancer, it also increases the risk of other respiratory system cancers including cancer of the nose, sinuses, voice box, and throat.\nThroat or larynx cancer. Throat cancer is cancer of the vocal cords, larynx (voice box), or other areas of the throat. People who smoke or use tobacco are at risk of developing throat cancer. Drinking too much alcohol over a long time also increases risk. Smoking and drinking alcohol combined lead to an increased risk for throat cancer. Most throat cancers develop in adults older than 50. Men are more likely than women to develop throat cancer.\nCan you get throat cancer at age 25? A: A person can get throat cancer at age 25, but it is very rare for this to happen, according to eMedicineHealth. Throat cancer usually develops in those over the age of 45, and the risk of contracting throat cancer increases with age. Continue Reading.\nCigar and pipe smoking causes: 1  Bladder cancer. 2  Esophageal cancer. 3  Laryngeal (voice box) cancer. 4  Lip cancer. 5  Lung cancer. 6  Mouth cancer. 7  Throat cancer. 8  Tongue cancer.\nSmoking Causes Mouth and Throat Cancer. Smoking can affect the health of your mouth and throat. As well as the obvious effects such as unsightly stains on your teeth and bad breath, smoking is the major cause of cancers of the mouth, throat, oesophagus, pharynx, larynx (voice box), tongue, lips and salivary glands.\nMichael Douglas: oral sex caused my throat cancer. Michael Douglas has said that his throat cancer was caused by oral sex. The Oscar-winning star went into detail about the cause of his illness for the first time in an interview with the Guardian.\nMichael Douglas has said that his throat cancer was caused by oral sex. Michael Douglas said the cancer followed his contraction of HPV Photo: AP.\nThroat cancer occurs when cells in your throat develop genetic mutations. These mutations cause cells to grow uncontrollably and continue living after healthy cells would normally die. The accumulating cells can form a tumor in your throat. It's not clear what causes the mutation that causes throat cancer. But doctors have identified factors that may increase your risk.\nA virus spread during oral sex is now the main cause of throat cancer in people under 50, scientists have warned. They say the human papilloma virus spread during unprotected sex is to blame for a disturbing rise in potentially deadly oral cancers in the last few decades.\nAnother reason to suspect that Douglas's throat cancer is oropharyngeal cancer is his statement that the cancer probably was caused by smoking and drinking. Smoking is a major cause of oropharyngeal cancer, Har-El tells WebMD. Drinking alcohol, as far as the statistics can tells us, is not as bad by itself.\n1 Smokeless tobacco products are a major source of cancer-causing nitrosamines and a known cause of human cancer. 2  They increase the risk of developing cancer of the mouth and throat, esophagus (swallowing tube), and pancreas. Tobacco use accounts for at least 30% of all cancer deaths, causing 87% of lung cancer deaths in men, and 70% of lung cancer deaths in women. ( 2 Source: Cancer Facts & Figures 2014).\n1 Pipes: Pipe smoking causes lung cancer and increases the risk of cancers of the mouth, throat, larynx, and esophagus (9, 15, 16). 2  Hookahs or waterpipes (other names include argileh, ghelyoon, hubble bubble, shisha, boory, goza, and narghile): A hookah is a device used to smoke tobacco. Pipes: Pipe smoking causes lung cancer and increases the risk of cancers of the mouth, throat, larynx, and esophagus (9, 15, 16). 2  Hookahs or waterpipes (other names include argileh, ghelyoon, hubble bubble, shisha, boory, goza, and narghile): A hookah is a device used to smoke tobacco.\nCauses of throat cancer. The exact cause of throat cancer is not clear. However, certain risk factors lead to an increased risk of throat cancer, such as cigarette smoking, human papillomavirus (HPV) infection, and exposure to toxic substances like asbestos or large quantities of alcohol.\nHPV: The Human Papilloma Virus is now thought to be the main cause of throat cancer in people under 50, scientists have warned. HPV is best known as the cause of around 70 per cent of cervical cancers. Since 2008, girls have been vaccinated against the virus aged 12 and 13 in schools.\nMen are at greater risk to throat cancer as smoking and alcohol intake are factors that trigger this kind of cancer. However, people with severe or chronic acid reflux are at risk of throat cancer as well. The cause of throat cancer is the cell mutations within oneâ\u0080\u0099s throat.\nThroat cancer risk factors. As with many cancers, the risk of developing throat cancer increases with age, with most people being over the age of 65. Men are two to three times more likely than women to develop throat cancer in their lifetime.\nAnother reason to suspect that Douglas's throat cancer is oropharyngeal cancer is his statement that the cancer probably was caused by smoking and drinking.  Smoking is a major cause of oropharyngeal cancer, Har-El tells WebMD. Drinking alcohol, as far as the statistics can tells us, is not as bad by itself.\nThroat anatomy. Throat cancer occurs when cells in your throat develop genetic mutations. These mutations cause cells to grow uncontrollably and continue living after healthy cells would normally die. The accumulating cells can form a tumor in your throat.It's not clear what causes the mutation that causes throat cancer. Hypopharyngeal cancer (laryngopharyngeal cancer) begins in the hypopharynx (laryngopharynx) â\u0080\u0094 the lower part of your throat, just above your esophagus and windpipe.\nCervical cancer is a sexually transmitted disease (STD) caused by human papilloma virus (HPV). Cancers caused by HPV include cancer of the anus, cervix, vagina, vulva, and throat.ervical cancer is a sexually transmitted disease (STD) caused by human papilloma virus (HPV). Cancers caused by HPV include cancer of the anus, cervix, vagina, vulva, and throat.\nFor a minority of cases, the virus doesnâ\u0080\u0099t go away and can cause serious health problems. These include genital warts and warts in the throat (known as recurrent respiratory papillomatosis, or RRP). HPV can also cause cervical cancer and other cancers of the genitals, head, neck, and throat. The types of HPV that cause warts are different from the types that cause cancer. As such, having genital warts caused by HPV does not mean that you will develop cancer. Cancers caused by HPV often donâ\u0080\u0099t show symptoms until the cancer is in later stages of growth.\nThroat cancer occurs when cells in your throat develop genetic mutations. These mutations cause cells to grow uncontrollably and continue living after healthy cells would normally die. The accumulating cells can form a tumor in your throat. It's not clear what causes the mutation that causes throat cancer.\nHPV infection is caused by a virus. More than 100 types of HPV have been found. Some types cause genital warts and some can lead to cervical cancer. Types 6 and 11 cause most genital warts.Other types such as 16 and 18 are high-risk and can cause abnormal cell changes on the cervix.ow the infection is spread (transmission). HPV is spread by direct contact. 1  The virus can be spread to or from the genitals, anus, mouth, or throat during sexual activities. 2  But warts in the mouth or throat are extremely rare. 3  Condoms can lower your risk of getting genital warts.\nCancers linked to alcohol include: 1  Mouth cancer. 2  Pharyngeal cancer (upper throat) 3  Oesophageal cancer (food pipe) 4  Laryngeal cancer (voice box) 5  Breast cancer. 6  Bowel cancer. 7  Liver cancer.\nHPV does not cause health problems for most people. However, certain types of genital HPV can cause cervical, anal, vaginal, vulvar and throat cancers in women. HPV can also cause throat, anal and penile cancers in men. Other types of HPV can cause genital warts â\u0080\u0093 growths around the vagina, penis or anus.\nWhat Are Laryngeal and Hypopharyngeal Cancers? Laryngeal and hypopharyngeal cancers start in the lower part of the throat. Cancer starts when cells in the body begin to grow out of control. Cells in nearly any part of the body can become cancer, and can spread to other areas of the body. To learn more about how cancers start and spread, see What Is Cancer?\nHPV is also associated with several less common cancers, such as vaginal and vulvar cancers in women, and anal and oropharyngeal (back of the throat, including base of tongue and tonsils) cancers in both men and women. HPV can also cause genital warts and warts in the throat.\nOral sex CAUSES throat cancer, new research reveals after Michael Douglas blames HPV for illness. Researchers have found that practising oral sex can increase the risk of developing the diseases 22 fold.\nMouth and Throat Cancer Causes. Today the understanding of the cause of cancers- especially those of the oropharynx- has changed dramatically. Historically most cancer of the head and neck was attributed to tobacco and alcohol use. Today we know that this explanation is both incomplete and often inaccurate.\nYou Can Get Throat Cancer From Oral Sex. On Sunday, in an interview with the Guardian, actor Michael Douglas revealed that his throat cancer was not caused by tobacco and alcohol, but by HPV, which was transmitted through oral sex. He has since called the statement a misunderstanding, but itâ\u0080\u0099s still true: you can get throat cancer from HPV.\nHead and neck cancer includes cancers of the mouth, nose, sinuses, salivary glands, throat, and lymph nodes in the neck. Most begin in the moist tissues that line the mouth, nose and throat. Using tobacco or alcohol increases your risk.\n* Extracts of certain Asphalts have been shown to cause cancer in animals. * Asphalt fumes can irritate the eyes on contact. * Breathing Asphalt fumes can irritate the nose, throat and lungs causing coughing, wheezing and/or shortness of breath.* Contact can irritate and cause severe burns of the skin and may cause dermatitis and acne-like lesions.* Exposure to Asphalt fumes can cause headache, dizziness, nausea and vomiting. * Long-term contact can cause skin pigment change which is made worse by sunlight exposure.* Cutback and Rapid Curing Asphalt are FLAMMABLE and FIRE HAZARDS. * Asphalt is derived from Petroleum. Asphalt and Coal Tar Pitch are different. Breathing Asphalt fumes can irritate the nose, throat and lungs causing coughing, wheezing and/or shortness of breath. * Contact can irritate and cause severe burns of the skin and may cause dermatitis and acne-like lesions.\n1 Some types of HPV may cause genital warts. 2  These are called low-risk types of HPV. 3  Some types of HPV may cause cell changes that sometimes lead to cervical cancer and certain other genital and throat cancers. 4  These are called high-risk types.5  This page discusses these high-risk types.es, high-risk types of genital HPV can cause cancer of the cervix, vagina, vulva, anus, penis, and throat. The type of cancer HPV causes most often is cervical cancer. Most HPV infections go away by themselves and don't cause cancer. But abnormal cells can develop when high-risk types of HPV don't go away.\nHead and neck cancer includes cancers of the mouth, nose, sinuses, salivary glands, throat, and lymph nodes in the neck. Most begin in the moist tissues that line the mouth, nose and throat. Using tobacco or alcohol increases your risk. In fact, 85 percent of head and neck cancers are linked to tobacco use, including smoking and smokeless tobacco.\nHuman papillomavirus (HPV) is the virus that causes cervical cancer in women and genital warts in men and women. The HPV vaccine effectively prevents infection with the HPV types responsible for most cervical cancers and can also prevent genital warts.PV infection usually causes no symptoms, but can cause genital warts and anal cancer in both women and men. HPV can also cause throat cancer. In women, HPV infection can cause cells in the cervix to grow abnormally. In a small fraction of women, these HPV-induced changes will develop into cervical cancer.\nWhy Adults Should Get the HPV Vaccine. HPV infection is extremely common; most sexually active people will be infected with HPV at some point in life. HPV infection usually causes no symptoms, but can cause genital warts and anal cancer in both women and men.HPV can also cause throat cancer.In women, HPV infection can cause cells in the cervix to grow abnormally. In a small fraction of women, these HPV-induced changes will develop into cervical cancer.PV infection usually causes no symptoms, but can cause genital warts and anal cancer in both women and men. HPV can also cause throat cancer. In women, HPV infection can cause cells in the cervix to grow abnormally. In a small fraction of women, these HPV-induced changes will develop into cervical cancer.\nOne of the top causes of throat cancer is smoking. Smoking, and chewing tobacco products is the number one culprit. Drinking too much alcohol can also play it's part. A diet lacking in fruits and vegetables, and human papilloma virus also have tendencies to promote the development of cancer in your throat.\nThroat cancer symptoms and signs include hoarseness, a lump in the neck, sore throat, cough, problems breathing, bad breath, earache, and weight loss. Learn about the causes of throat cancer, including smoking and excess alcohol consumption. Read about throat cancer treatment, types, survival rates, and prognosis.\nSmoking Causes Mouth and Throat Cancer. Smoking can affect the health of your mouth and throat. As well as the obvious effects such as unsightly stains on your teeth and bad breath, smoking is the major cause of cancers of the mouth, throat, oesophagus, pharynx, larynx (voice box), tongue, lips and salivary glands.1, 2 The longer you smoke, and the more you smoke, the greater the risk of these cancers. 2.s well as the obvious effects such as unsightly stains on your teeth and bad breath, smoking is the major cause of cancers of the mouth, throat, oesophagus, pharynx, larynx (voice box), tongue, lips and salivary glands. 1, 2 The longer you smoke, and the more you smoke, the greater the risk of these cancers. 2.\nThey also can cause penile cancers, anal cancers, and throat cancers. Recent studies have also shown that there may even be an association between HPV and lung cancer. Smoking, of course, is a major cause of lung cancer in the Western world. However, it is not the only cause of lung cancer.\nOropharyngeal cancers (cancers of the middle part of the throat, including the soft palate, the base of the tongue, and the tonsils): About 70% of oropharyngeal cancers are caused by HPV. In the United States, more than half of cancers diagnosed in the oropharynx are linked to HPV type 16 . Rarer cancers: HPV causes about 65% of vaginal cancers, 50% of vulvar cancers, and 35% of penile cancers . Most of these are caused by HPV type 16. High-risk HPV types cause approximately 5% of all cancers worldwide .\nLip, tongue, other parts of the mouth, throat, esophagus, stomach and lung are the most common. Smoking can cause, mouth, lung, eye, heart, and all sorts of different types â\u0080¦ of cancer. Lung cancer is the biggest risk. You can also get mouth, eye, heart, and a hole in your throat. 1: Lung cancer. 2: Throat cancer.\nThey are linked to some cancers of the mouth and throat, too. Again, although HPVs have been linked to these cancers, most people infected with HPV never develop these cancers. Smoking, which is also linked with these cancers, may work with HPV to increase cancer risk.Other genital infections may also increase the risk that HPV will cause cancer.hey are linked to some cancers of the mouth and throat, too. Again, although HPVs have been linked to these cancers, most people infected with HPV never develop these cancers. Smoking, which is also linked with these cancers, may work with HPV to increase cancer risk.\n1 Some types of HPV may cause genital warts. 2  These are called low-risk types of HPV. 3  Some types of HPV may cause cell changes that sometimes lead to cervical cancer and certain other genital and throat cancers. 4  These are called high-risk types.5  This page discusses these high-risk types.es, high-risk types of genital HPV can cause cancer of the cervix, vagina, vulva, anus, penis, and throat. The type of cancer HPV causes most often is cervical cancer. Most HPV infections go away by themselves and don't cause cancer.\nHigh-risk HPV can cause various cancers: 1  Cervical cancer. 2  Anal cancer. 3  Some types of oral and throat cancer. 4  Vulvar cancer. 5  Vaginal cancer. 6  Penile cancer.", "key": "31_6", "timestamp": "2020-06-23 21:18:58.962442", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}