{"input_text": "CARTOSAT 2B is an  Earth observation satellite  in a  sun-synchronous orbit  and the fourth of the  Cartosat  series of satellites.  The satellite is the seventeenth satellite in the  Indian Remote Sensing (IRS) satellite  series to be built by the  Indian Space Research Organisation . It was launched along with the 116 kg Algerian satellite, one nano satellite each from Canada and Switzerland, and StudSat, a pico satellite, on 12 July 2010 in a Polar Satellite Launch Vehicle (PSLV) rocket from the spaceport at Sriharikota.\nThe Space Command was the subject of a  60 Minutes  News segment on CBS in April 2015.  When speaking with 60 Minutes reporter  David Martin , commanding General  John E. Hyten  was not able to respond to many of the questions, claiming the information was classified but that the program was doing its part in keeping the global world of GPS satellites and other important global satellite usage peaceful.  To ensure satellite safety, General Hyten confirmed the belief that other countries were developing anti-satellite technology, but that the Space Command Program was developing technologies of their own, including telescopic lasers to better track the paths of satellites.  Reporter David Martin also asked about the new  Boeing X-37  \"space plane\" the US Air Force had been testing.  General Hyten confirmed that it could bring satellites into orbit and bring them back, and that the US Air Force would do everything they could to protect the country and its satellites from the danger that could be brought by anti-satellite technology from China and Russia in the future.  This CBS interview was a peek into the secretive Space Command that protects the billion-dollar US satellites that provide essential global navigation and surveillance.\nIn spite of these initial difficulties, ESP was incorporated on July 14, 1978, for a fee of $91. The trio still had to find a way to broadcast their new sports channel and began their research at United Cable, where they were told about a new means of television distribution,  satellite communication . They were then directed to  RCA , which had experience in satellite communication, having launched  Satcom  into orbit and frequently using the technology in  Europe ; the concept was still new in the United States (satellite delivery was first used for full-time television broadcasts by  HBO  in September 1975), and was not immediately embraced. Al Parinello, who was hired by RCA to promote the new technology, received a phone call from Rasmussen and wanted to meet with him in person. At the meeting, Bill explained they were interested in regional sports broadcasting, however Parinello explained that with satellite communication, their channel could be broadcast across the country. Furthermore, when they were informed that buying a continuous 24-hour satellite feed was less expensive than sending the signal across Connecticut via landlines, they agreed to buy the  transponder  for the satellite.\nAs of 2010, the organization has defined 10 projects on designing, building and launching light satellites, middle class satellites weighing 500–600 kg, research satellites, remote-sensing and telecommunications satellites.\nThe Rand Corporation, Air Force and CIA had long pursued the idea of a Reconnaissance Satellite. Such a program  was under way, Weapon System 117L, which was top secret compartmented. One problem with a reconnaissance was a matter of legality, was there \"freedom of space\" or did a nation's airspace end when space is entered? The National Security Council backed the IGY satellite as it would make good cover for WS117L and set a precedent of freedom of space peaceful civilian satellite. At the same time the NSC stressed that the IGY satellite must not interfere with military programs.  \" The Army's Redstone-based proposal would likely be first ready for a first satellite launch. Its connection with German-born scientist  Wernher von Braun , however, was a public-relations risk. In any case, the Atlas and Redstone ballistic missiles were top-priority military projects, which were not to be slowed by pursuing a secondary space launch mission.  Milton Rosen 's Vanguard was a project at the  Naval Research Laboratory  (NRL), which was regarded more as a scientific than a military organization. Rosen and Richard Porter (IGY satellite chief and head of the American Rocket Society) both lobbied for the Vanguard and against using the Altas or von Braun's rockets. They emphasized the non-military goals of the satellite program. Besides the public-relations aspect, a non-military satellite was considered important, because a discussion of whether overflights of foreign countries by satellites were legal or illegal was to be avoided.\nThis statement shows how important space is to the US military. In the past two Iraqi conflicts, satellites in space, have been used extensively. Satellites are what give the US the edge over its enemies. Before the Gulf War in 1991, the US was alerted to the large presence of Iraqi troops on the border of Kuwait by satellites in space. This allowed the US to prepare a successful counter-attack that eventually wiped out the invading Iraqi forces and made them retreat back into Iraq. Many people have said that military satellites are the key to US military power. This makes perfect sense seeing that many of the missiles that the US has in its arsenal depend on the help of GPS (global positioning system), which in turn depend and can only function in conjecture with satellites in space. So without satellites the US military will lose a huge advantage and will have to fight their battles in a different manner.\nThe first  artificial Earth satellite  was  Sputnik 1 . Put into orbit by the  Soviet Union  on October 4, 1957, it was equipped with an on-board  radio - transmitter  that worked on two frequencies: 20.005 and 40.002 MHz. Sputnik 1 was launched as a step in the exploration of space and rocket development. While incredibly important it was not placed in orbit for the purpose of sending data from one point on earth to another. And it was the first artificial satellite in the steps leading to today's satellite communications.\nThe B-Class satellites were launched from the  Xichang Satellite Launch Center  by  Long March rocket s.\n\"There is widespread recognition of the growing need for engineers and the organizations that employ them to create a new engineering culture that encourages lifelong learning....The National Technological University (NTU) is an important example.  NTU delivers classes from major engineering schools by  satellite  to working professionals in industry.  NTU and Motorola University...have been cited as U.S. 'best practices' in this field.\"\nABS, short for Asia Broadcast Satellite, is a Bermuda-based operator of  communication satellite s. Its services include  satellite-to-home  and  satellite-to-cable  TV distribution,  cellular services , and internet services. The company established telecommunications networks in Africa, Russia, Asia and the Middle East. The service currently covers 80% of the population in the Americas, Africa, Asia Pacific, Europe, the Middle East, Russia, and  Commonwealth of Independent States . The company aims to expand their satellite fleet by two, from six communication satellites to eight satellites, in 2015. As of March 2015, one of the two planned satellites has launched, and is currently moving to the target orbit.\nThe mentioned QZSS TKS technology is a novel satellite timekeeping system which does not require on-board atomic clocks as used by existing navigation satellite systems such as GPS,  GLONASS  or the planned  Galileo  system. This concept is differentiated by the employment of a synchronization framework combined with lightweight steerable on-board clocks which act as transponders re-broadcasting the precise time remotely provided by the time synchronization network located on the ground. This allows the system to operate optimally when satellites are in direct contact with the ground station, making it suitable for a system like the Japanese QZSS. Low satellite mass and low satellite manufacturing and launch cost are significant advantages of this system. An outline of this concept as well as two possible implementations of the time synchronization network for QZSS were studied and published in Remote Synchronization Method for the Quasi-Zenith Satellite System and Remote Synchronization Method for the Quasi-Zenith Satellite System: study of a novel satellite timekeeping system which does not require on-board atomic clocks.\nThe world's first artificial satellite, the  Sputnik 1 , was launched by the  Soviet Union  in 1957. Since then, thousands of satellites have been launched into orbit around the  Earth .  A few large satellites have been launched in parts and assembled in orbit.  Artificial satellites from more than 40 countries have been launched by ten nations.  Over a dozen  space probe s have been placed into orbit around other bodies and become artificial satellites to the Moon,  Mercury ,  Venus ,  Mars ,  Jupiter ,  Saturn , a few  asteroid s, and the  Sun .\nThe actual process of connecting a BGAN terminal to the satellite is fairly straight forward.  The BGAN terminal needs to find its position using GPS, before it can negotiate with the satellite, so a clear view of the sky is necessary to begin with.  Once the GPS position is obtained,  it does not need to do that again unless it is moved to a different region.  Obtaining the initial GPS position can take a few minutes.  The terminal then needs a line-of-sight to the geostationary satellite so a user would normally be outside, and have a general idea of what direction the satellite would be (with a compass if necessary).  Turning the terminal slowly by hand, it will give some indication when the satellite is found.  Then usually with the touch of one button, the terminal auto-negotiates with the satellite and connects.  The average pointing time for a BGAN unit is 2 minutes, under a minute with an experienced user and a good signal.  BGAN is being used in the world today for disaster response,  telemedicine , business continuity, remote site monitoring (telemetry), military use, and recreational use.\nThe Naval Research Laboratory has been a crucial piece of the United States space program.  Project Vanguard , the first American satellite program, tasked NRL with the design, construction and launch of an artificial satellite, which was accomplished in 1958. Vanguard I, designed and built at NRL, was the first solar-powered satellite. As of 2013,  Vanguard I  is still in orbit, making it the longest-lived man-made satellite.  Vanguard II  was the first satellite to observe the Earth's cloud cover and therefore the first meteorological satellite. NRL pioneered the study of the sun Ultraviolet and X-Ray spectrum. Along with Project Vanguard, NRL also designed the first satellite tracking system,  Minitrack , which became the prototype for future satellite tracking networks. NRL's recently declassified  Galactic Radiation and Background  I (GRAB I) was the first U.S.  intelligence satellite , intercepting Soviet radio communications from space. The  Global Positioning System  (GPS) was invented at NRL and tested by NRL prototype satellites  Timation  I and Timation II in 1967 and 1969, and the first operational GPS satellite, Timation IV (NTS-II) was designed and constructed at NRL.\nEncrypting was introduced to prevent people from receiving pay content for free, and nearly every pay channel was encrypted by the mid-to-late 1980s (this did not happen without protest, such as an incident in which a  Florida  satellite dealer  intecepted the signal of HBO  during a film telecast in 1986 to transmit a text-based message over  color bars  objecting to the network's decision to encrypt its feed). Satellite television also began a digital transition, well before over-the-air broadcasting did the same, to increase satellite capacity and/or reduce the size of the receiving antennas; this also made it more difficult for individuals to intercept these signals. Eventually, the industry began to cater to individuals who wanted to continue to receive satellite television (and were willing to pay for it) in two ways: by authorizing the descrambling of the original satellite feeds to the cable television operators, and with new  direct broadcast satellite  television services using their own satellites. These latter services, which began operating in the mid-1990s, offer programming similar to cable television.\nFive separate series of OV satellites were launched. The first satellites were  OV1 , which were carried on  suborbital   Atlas  missile tests, and subsequently placed themselves into orbit by means of an  Altair-2   kick motor .  OV2  satellites were built using parts left over following the cancellation of the  Advanced Research Environmental Test Satellite . Three OV2 spacecraft flew on  Titan IIIC  test flights. The  OV3  satellites were the only ones in the series to be launched on dedicated rockets. Six were launched on  Scout-B  rockets between 1966 and 1967.  OV4  satellites were launched as part of a test flight for the  Manned Orbital Laboratory , with two satellites conducting a communications experiment whilst a third, OV4-3, was the primary payload, a  Boilerplate  mockup of the MOL space station. Two further OV4 satellites, duplicates of the first two, were built but not launched.  OV5  satellites were launched as part of the  ERS  project, as secondary payloads on  Titan IIIC  rockets.\nThe  earth  is constantly being monitored by a great number satellites operating in the earth exploration-satellite service (EESS) or  space research service  (SRS). These artificial  satellite s have onboard  space radio station s from which they gather  data . The data is transmitted back to earth via  feeder link s. This article lists a number of current active  Earth observation satellite s and their  downlink  transmission frequencies.\nThe first six second-generation satellites were launched on October 19, 2010, from the  Baikonur Cosmodrome  in Kazakhstan. The launch used a  Soyuz-2  launch vehicle with a  Fregat  upper stage. These second-generation satellites are expected to provide Globalstar customers with satellite voice and data services until at least 2025. Six more second-generation satellites were launched in July 2011 followed by another six satellites in December 2011.As of July 16, 2012, 18 of 24 new satellites had been launched. Launch of the second generation constellation was completed February 6, 2013, with the launch of the final six satellites using a Soyuz 2-1a launch vehicle. The 24 second-generation spacecraft weighed approximately  each at launch, and are  3-axis stabilized .\nA  Micro-satellite  is defined as any object  orbiting  the earth that has a mass greater than 10 kg and less than 500 kg. This includes man made satellites and natural satellites, like debris. While man made micro-satellites are primarily peaceful, they are easily weaponized. Because of a satellite’s high  relative velocity  to another satellite, any collision would destroy both satellites, and micro-satellites have the advantage of being cheaper, more maneuverable and harder to track.In 2001, a Chinese newspaper stated that the  PRC  was testing a  parasitic  micro-satellite that could latch onto another satellite and destroy it on command. While no evidence has been found to demonstrate  the development of such a parasite system, in 2008 the  BX-1  micro-satellite released by the PRC passed dangerously close to the  International Space Station   at a  relative speed which would have destroyed both objects had they collided. This close call raised awareness of the PRC's ability to use micro-satellites as a  kinetic kill  ASAT system.\nThe first satellite,  Sputnik 1 , was put into orbit around Earth and was therefore in  geocentric orbit . By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude,  inclination  and  eccentricity .\nThis timeline of artificial  satellite s and  space probe s includes unmanned spacecraft including technology demonstrators, observatories, lunar probes, and interplanetary probes. First satellites from each country are included. Not included are most  earth science satellites ,  commercial satellites  or  manned missions .\nMany  artificial satellites  carry retroreflectors to be tracked from  ground stations .Some satellites were built solely for laser ranging.Other satellites include retroreflectors for orbit calibration, such as in  satellite navigation  (e.g., most  GLONASS satellites  and a few  GPS satellites ) as well as in  satellite altimetry  (e.g.,  TOPEX/Poseidon ).Retroreflectors can also be used for inter-satellite laser ranging (e.g.,  GRACE-FO ).\nThe first artificial satellite,  Sputnik 1 , was launched in October 1957. In November,  Laika  became the first animal in orbit.\nThese satellites collect radio emissions ( SIGINT ) from  geostationary orbit s and act as replacements for the older constellation of  Magnum  satellites. Observers estimate the satellites weigh close to 5,200 kg and have very large (estimated 100 m diameter) radio reflecting dishes. NRO L-32, which is seen as the fifth satellite in the series, is according to NRO director  Bruce Carlson  \"(...) the largest satellite in the world\". It is believed that this refers to the diameter of the main antenna, which might be well in excess of . The mission and capabilities of these satellites are highly  classified . Earlier satellites with similar missions, the  Rhyolite/Aquacade  series, were built by  TRW ; it is not known who made the Orion satellites.\nThe medium-scale Broadcasting Satellite for Experimental Purposes (BSE) was planned by Ministry of Posts and Telecommunications (MOPT) and developed by the National Space Development Agency of Japan ( NASDA ) since 1974. After that, the first Japanese experimental broadcasting satellite, called BSE or  Yuri , was launched in 1978.  NHK  started experimental broadcasting of TV program using BS-2a satellite on May, 1984.  The satellite BS-2a was launched in preparation for the start of full scale 2-channel broadcasts.  Broadcasting Satellite  BS-2a was the first national  DBS  (direct broadcasting satellite), transmitting signals directly into the home of TV viewers. Attitude control of the satellite was conducted using the 3 axial method (zero momentum), and design life was 5 years. The TV transponder units are designed to sufficiently amplify transmitted signals to enable reception by small, 40 or 60 cm home-use parabolic  antennas . The satellite was equipped with 3 TV transponders (including reserve units). However, one transponder malfunctioned 2 months after launch (March 23, 1984) and a second transponder malfunctioned 3 months after launch (May 3, 1984). So, the scheduled satellite broadcasting had to be hastily adjusted to test broadcasting on a single channel.Later, NHK started regular service ( NTSC ) and experimental  HDTV  broadcasting using BS-2b on June, 1989. Some Japanese producers of home electronic consumer devices began to deliver  TV sets,  VCR s and even home acoustic systems equipped by built-in satellite  tuners  or  receiver s. Such electronic goods had a specific  BS  logo. On April, 1991, Japanese company  JSB  started pay TV service while BS-3 communication satellite was in use. In 1996 total number of households that receive satellite broadcasting exceeded 10 million. The modern two satellite systems in use in Japan are BSAT and JCSAT; the modern  WOWOW   Broadcasting Satellite  digital service uses BSAT satellites, while other system of digital TV broadcasting  SKY PerfecTV!  uses JCSAT satellites.\nThe Indian space program under the DoS aims to promote the development and application of space science and technology for the socio-economic benefit of the country. It includes two major satellite systems,  INSAT  for communication, television broadcasting and meteorological services, and  Indian Remote Sensing Satellite s (IRS) system for resources monitoring and management. It has also developed two satellite launch vehicles,  Polar Satellite Launch Vehicle  (PSLV) and  Geosynchronous Satellite Launch Vehicle  (GSLV), to place IRS and INSAT class satellites in orbit.\nBoth the  Soviet Union  and the  U.S.  launched artificial  satellite s for this event; the Soviet Union's  Sputnik 1 , launched on October 4, 1957, was the first successful artificial satellite. Other significant achievements of the IGY included the discovery of the  Van Allen radiation belts  by  Explorer 1  and the defining of mid-ocean submarine ridges, an important confirmation of  plate tectonics . Also detected was the rare occurrence of hard solar corpuscular radiation that could be highly dangerous for manned  space flight .\nThe constellation consists of 66 active satellites in orbit required for global coverage, and additional spare satellites to serve in case of failure. Satellites are in  low Earth orbit  at a height of approximately  and  inclination  of 86.4°. Orbital velocity of the satellites is approximately .  Satellites communicate with neighboring satellites via  inter-satellite links. Each satellite can have four inter-satellite links: two to neighbors fore and aft in the same orbital plane, and two to satellites in neighboring planes to either side. The satellites orbit from pole to same pole with an orbital period of roughly 100 minutes. This design means that there is excellent satellite visibility and service coverage even at the North and South poles. The over-the-pole orbital design produces \"seams\" where satellites in counter-rotating planes next to one another are traveling in opposite directions.  Cross-seam inter-satellite link hand-offs would have to happen very rapidly and cope with large  Doppler shifts ; therefore, Iridium supports inter-satellite links only between satellites orbiting in the same direction. The constellation of 66 active satellites has 6  orbital plane s spaced 30 degrees apart, with 11 satellites in each plane (not counting spares). The original concept was to have 77 satellites, which is where the name Iridium came from, being  the element  with the atomic number 77 and the satellites evoking the  Bohr model  image of electrons orbiting around the Earth as its nucleus. This reduced set of 6 planes is sufficient to cover the entire Earth's surface at every moment.\nSpace geodesy is  geodesy  by means of sources external to Earth, mainly  artificial satellites  (in  satellite geodesy ) but also  quasars  (in  very-long-baseline interferometry , VLBI) and the  retroreflectors on the Moon  (in  lunar laser ranging , LLR).\nPersona is a class of  Russia n  reconnaissance satellite s, derived from the  Resurs DK  class of remote sensing satellite, in turn derived from the Soviet  Yantar reconnaissance satellites . The satellites are built by  TsSKB-Progress , and the optics by  LOMO  and the Vavilov State Optical Institute.\nTypically, satellites have a roughly  sinusoidal  ground track.  A satellite with an orbital  inclination  between zero and ninety degrees is said to be in what is called a direct or  prograde orbit , meaning that it orbits in the same direction as the Earth's rotation.  A satellite with an orbital inclination between 90° and 180° (or, equivalently, between -90° and 0°) is said to be in a  retrograde orbit . (Direct orbits are by far the most common for artificial satellites, as the initial velocity imparted by the Earth's rotation at launch reduces the  delta-v  needed to achieve orbit.)\nThe above discussion defines the beta angle of satellites orbiting the Earth, but a beta angle can be calculated for any orbiting three body system: the same definition can be applied to give the beta angle of other objects.  For example, the beta angle of a satellite in orbit around Mars, with respect to the Earth, defines how much of the time the satellite has a line of sight to the Earth - that is, it determines how long the Earth is shining on the satellite and how long the Earth is blocked from view.  That same satellite also will have a beta angle with respect to the Sun, and in fact it has a beta angle for any celestial object one might wish to calculate one for: any satellite orbiting a body (i.e. the Earth) will be in that body's shadow with respect to a given celestial object (like a star) some of the time, and in its line-of-sight the rest of the time.  Beta angles describing non- geocentric  orbits are important when space agencies launch satellites into orbits around other bodies in the Solar System.\nNumerous scientific exploration missions were begun in 2011. In March 2011, the  MESSENGER  probe became the first artificial satellite of the planet  Mercury .  In July, the  Dawn  spacecraft became the first artificial satellite of the  asteroid   4 Vesta . The  Mars Science Laboratory  – at the time, the largest  Mars rover  ever constructed – was launched in November, conducting a successful landing on Mars in August 2012.\nExplorer 3 (international designation 1958 Gamma) was an artificial  satellite  of the  Earth , nearly identical to the first  United States  artificial satellite  Explorer 1  in its design and mission. It was the second successful launch in the  Explorer program .\nCGSM complements numerous satellite and international ground-based programs. The synergies between CGSM and satellite missions, for example, are very important. Satellites measure the plasma processes at work in the  magnetosphere  and  ionosphere  directly using  magnetometer s, and electric field, plasma wave, and particle detectors. These processes, however, are truly multi-scale, with important scale sizes ranging from kilometers or less to tens of thousands of kilometers. Satellite observations are essential because they are our only direct look at the processes of interest. At the same time, the satellites are like \"needles in a haystack\", owing to the enormous scale sizes of the  magnetospheric  system and the fact that all the scales seem to be important in the overall dynamic.\nThe first and historically most important application for communication satellites was in intercontinental  long distance telephony . The fixed  Public Switched Telephone Network  relays  telephone call s from  land line  telephones to an  earth station , where they are then transmitted to a geostationary satellite.  The downlink follows an analogous path.  Improvements in  submarine communications cable s through the use of  fiber-optics  caused some decline in the use of satellites for fixed telephony in the late 20th century.\nSome of these satellites are separated from each other by as little as one tenth of a degree  longitude . This corresponds to an inter-satellite spacing of approximately 73 km.  The major consideration for spacing of geostationary satellites is the beamwidth at-orbit of uplink transmitters, which is primarily a factor of the size and stability of the uplink dish, as well as what frequencies the satellite's  transponder s receive; satellites with discontiguous frequency allocations can be much closer together.\nThere are several major types of reconnaissance satellite.\nMany communication satellites share a given frequency band.  As a signal is transmitted to a particular satellite there is some amount of side lobe or spillover energy that is transmitted to adjacent satellites. At a receive station that has two antennas, one pointed at the primary satellite (the satellite the signal is intended for) and a secondary satellite (a satellite that is receiving side lobe energy), both paths of the signal are received and measured. From a comparison of those paths, two measurements can be made: Differential Time Offset (DTO) and Differential Frequency Offset (DFO). These measurements are often implemented through correlation processing. DTO represents the difference in time that it takes the signal to travel through the two satellites, while DFO represents the difference in frequency the received signals present through the two satellites. The frequency differences observed are due to different Doppler shift resulting from relative satellite motion and differences in the translation frequencies of the two satellite channels.  Channel translation frequencies and downlink Doppler shift and delay can be calibrated out of the measurements by observing transmitters of known location simultaneously on the channels.  This leaves the uplink DTO and DFO as the observables. See 'Reference Signals' below.\nIn the  Solar System , the  Sun  is the primary for all objects that orbit around it. In the same way, the primary of all satellites (be they  natural satellite s (moons) or  artificial satellites ) is the  planet  they orbit. The word primary is often used to avoid specifying whether the object near the center of mass is a planet, a star or any other  astronomical object . In this sense, primary is always used as a  noun .\nMany artificial  satellite s are robotic spacecraft, as are many  lander s and  rover s.\nWhen the satellite's orientation goes out of control, it becomes possible to predict only a trajectory of its pass, at any point of which it can flare up. These satellites are also described as \"tumbling\". This category includes a lot of rotating rocket bodies, some failed Iridium satellites,  ALOS  satellite (which can produce flashes up to −10 mag), etc.The most important and valuable information about tumbling satellites is a period of flashes. It can vary from 0.3–0.5 seconds (rapidly rotating objects) to a minute or more (slowly rotating objects). Other important characteristics are the amplitude of changes in brightness and period of repetition of these changes.\nSatellites are used for many purposes.  Common types include military and civilian  Earth observation satellite s,  communications satellite s,  navigation satellite s,  weather satellite s, and  space telescope s.   Space station s and human  spacecraft  in orbit are also satellites.  Satellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways.  Well-known (overlapping) classes include  low Earth orbit ,  polar orbit , and  geostationary orbit .\nA satellite system is a set of gravitationally bound objects in orbit around a  planetary mass object  or  minor planet . Generally speaking, it is a set of  natural satellites  (moons), although such systems may also consist of bodies such as circumplanetary disks,  ring systems ,  moonlet s,  minor-planet moon s and  artificial satellites  any of which may themselves have satellite systems of their own. Some bodies also possess  quasi-satellite s that have orbits gravitationally influenced by their primary, but are generally not considered to be part of a satellite system. Satellite systems can have complex interactions including magnetic, tidal, atmospheric and orbital interactions such as  orbital resonance s and  libration .  Individually major satellite objects are designated in Roman numerals.  Satellite systems are referred to either by the possessive adjectives of their primary (e.g. \"Jovian system\"), or less commonly by the name of their primary (e.g. \"Jupiter system\").  Where only one satellite is known, or it is a binary orbiting a common centre of gravity, it may be referred to using the hyphenated names of the primary and major satellite (e.g. the \"Earth-Moon system\").\nThere are five major components in a DBS satellite system: the programming source, the broadcast center, the satellite, the  satellite dish , and the  receiver . Satellites used for transmission of television signals are generally in either  naturally  highly  elliptical  (with  inclination  of +/-63.4 degrees and orbital period of about twelve hours, also known as  Molniya orbit ) or  geostationary orbit   above the earth's  equator . Satellite television, like other communications relayed by satellite, starts with a transmitting antenna located at an  uplink  facility. Uplink facilities transmit their signals typically in the C-band frequency range due to their resistance to  rain fade . As a result, uplink satellite dishes are very large, often as much as 9 to 12 metres (30 to 40 feet) in diameter. The increased diameter results in more accurate aiming and increased signal strength at the satellite. The uplink dish is pointed toward a specific satellite and the uplinked signals are transmitted within a specific frequency range, so as to be received by one of the  transponder s tuned to that frequency range aboard that satellite. The transponder then converts the signals to K band, a process known as \"translation,\" and transmits them back to earth to be received by home satellite stations.\nIn April 2007, the first satellite of BeiDou-2, namely Compass-M1 (to validate frequencies for the BeiDou-2 constellation) was successfully put into its working orbit. The second BeiDou-2 constellation satellite Compass-G2 was launched on 15 April 2009. On 15 January 2010, the official website of the BeiDou Navigation Satellite System went online, and the system's third satellite (Compass-G1) was carried into its orbit by a  Long March 3C  rocket on 17 January 2010. On 2 June 2010, the fourth satellite was launched successfully into orbit. The fifth orbiter was launched into space from  Xichang Satellite Launch Center  by an  LM-3I  carrier rocket on 1 August 2010. Three months later, on 1 November 2010, the sixth satellite was sent into orbit by LM-3C. Another satellite, the Beidou-2/Compass IGSO-5 (fifth inclined geosynchonous orbit) satellite, was launched from the Xichang Satellite Launch Center by a Long March-3A on 1 December 2011 (UTC).\nA geocentric orbit or Earth orbit involves any object  orbit ing the  Earth , such as the  Moon  or  artificial satellite s. In 1997 NASA estimated there were approximately 2,465 artificial satellite payloads orbiting the Earth and 6,216 pieces of  space debris  as tracked by the  Goddard Space Flight Center . Over 16,291 previously launched objects have  decayed  into the Earth's  atmosphere .\nSatellite  remote sensing  provides another important source of spatial data. Here satellites use different sensor packages to passively measure the reflectance from parts of the  electromagnetic spectrum  or radio waves that were sent out from an active sensor such as radar. Remote sensing collects raster data that can be further processed using different bands to identify objects and classes of interest, such as land cover.\nA Sun-synchronous orbit (SSO, also called a heliosynchronous orbit) is a  geocentric orbit  that combines  altitude  and  inclination  in such a way that the satellite passes over any given point of the planet's surface at the same local  solar time . Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites. More technically, it is an orbit arranged in such a way that it  precesses  once a year.  The surface  illumination angle  will be nearly the same every time that the satellite is overhead.  This consistent lighting is a useful characteristic for  satellite s that image the Earth's surface in visible or infrared wavelengths (e.g. weather and spy satellites) and for other remote sensing satellites (e.g. those carrying ocean and atmospheric remote sensing instruments that require sunlight).  For example, a satellite in sun-synchronous orbit might ascend across the equator twelve times a day each time at approximately 15:00 mean local time. This is achieved by having the  osculating  orbital plane  precess  (rotate) approximately one degree each day with respect to the  celestial sphere , eastward, to keep pace with the Earth's movement around the  Sun .\nA direct-broadcast satellite (DBS) is a type of artificial  satellite  which usually broadcasts  satellite television  signals for home reception.\nThere are two major classes of communications satellites,  passive  and active. Passive satellites only  reflect  the signal coming from the source, toward the direction of the receiver. With passive satellites, the reflected signal is not amplified at the satellite, and only a very small amount of the transmitted energy actually reaches the receiver.  Since the satellite is so far above Earth, the radio signal is attenuated due to  free-space path loss , so the signal received on Earth is very weak.  Active satellites, on the other hand, amplify the received signal before re-transmitting it to the receiver on the ground. Passive satellites were the first communications satellites, but are little used now. Telstar  was the second active, direct relay communications satellite. Belonging to  AT&T  as part of a multi-national agreement between AT&T,  Bell Telephone Laboratories , NASA, the British  General Post Office , and the  French National PTT  (Post Office) to develop satellite communications, it was launched by NASA from  Cape Canaveral  on July 10, 1962, the first privately sponsored space launch.  Relay 1  was launched on December 13, 1962, and became the first satellite to broadcast across the  Pacific  on November 22, 1963.\nIn 1995, Imparja Television received the  Telstra  Indigenous Business Award for Business of the Year. Also in 1995, Imparja's satellite transmission moved from the  Aussat A-Class satellites  to the  Optus B1  satellite, and the station's licence was renewed.\nWBQC had been pushing for carriage on local cable and satellite providers for many years. In 2005, WBQC swapped channel allocations with  America One -affiliated sister station  WOTH-LP  (channel 38). In 2001, WBQC became a  Class A television station , with the call sign WBQC-CA, in hopes of receiving  must-carry  status on cable providers and protection from displacement by the full-power stations' digital channel allocations. As a Class A station, WBQC had to meet all the requirements of a full-power station. Ultimately, Class A stations did not receive must-carry status, though they did receive protection from displacement. In negotiating with the cable and satellite providers, WBQC claimed \"should-carry\" status, in the absence of federal must-carry recognition.\nLarge commercial dishes of 3.7 m to 13 m diameter can be used to achieve increased rain margins and also to reduce the cost per bit by allowing for more efficient modulation codes. Alternately, larger aperture antennae can require less power from the satellite to achieve acceptable performance.  Satellites typically use  photovoltaic  solar power, so there is no expense for the energy itself, but a more powerful satellite will require larger, more powerful solar panels and electronics, often including a larger transmitting antenna.  The larger satellite components not only increase materials costs but also increase the weight of the satellite, and in general, the cost to launch a satellite into an orbit is directly proportional to its weight.  (In addition, since satellite launch vehicles [i.e. rockets] have specific payload size limits, making parts of the satellite larger may require either more complex folding mechanisms for parts of the satellite like solar panels and high-gain antennas, or upgrading to a more expensive launch vehicle that can handle a larger payload.)\nTechnomate, Vu+, Icecrypt and Sab, multi satellite motorised satellite systems. Motorised satellite systems from the Satellite Superstore UK. Motorised satellite systems from Technomate, Dreambox, Icecrypt, Manhattan.Clear transparent motorised satellite dish systems.High definition HD satellite systems.Blind search satellite systems.otorised satellite systems from the Satellite Superstore UK. Motorised satellite systems from Technomate, Dreambox, Icecrypt, Manhattan. Clear transparent motorised satellite dish systems. High definition HD satellite systems. Blind search satellite systems.\nUniversal Satellites Automatic Location System (USALS), also known (unofficially) as DiSEqC 1.3, Go X or Go to XX is a satellite dish motor protocol that automatically creates a list of available satellite positions in a motorised satellite dish setup.niversal Satellites Automatic Location System (USALS), also known (unofficially) as DiSEqC 1.3, Go X or Go to XX is a satellite dish motor protocol that automatically creates a list of available satellite positions in a motorised satellite dish setup.\nUK. Technomate, Vu+, Icecrypt and Sab, multi satellite motorised satellite systems. Motorised satellite systems from the Satellite Superstore UK. Motorised satellite systems from Technomate, Dreambox, Icecrypt, Manhattan. Clear transparent motorised satellite dish systems. High definition HD satellite systems.Blind search satellite systems.otorised satellite systems from the Satellite Superstore UK. Motorised satellite systems from Technomate, Dreambox, Icecrypt, Manhattan. Clear transparent motorised satellite dish systems. High definition HD satellite systems. Blind search satellite systems.\nSatellites, of course! Satellites are any objects that revolve around (orbit) another object in space. Some satellites are natural, while others are artificial (man-made). The moon is an example of a natural satellite that orbits the Earth. We're going to focus, though, on the man-made satellites. Artificial satellites are machines that humans launch into orbit, usually around the Earth. Artificial satellites can be sent to orbit other planets, too. For example, there are currently satellites orbiting the Moon, the Sun, and several other planets, including Mercury, Venus, Mars, and Saturn.\nThe world was shocked on October 4, 1957, when the USSR launched the first artificial satellite, Sputnik 1. It was the beginning of the space race. The world was shocked on October 4, 1957, when the USSR launched the first artificial satellite, Sputnik 1. It was the beginning of the space race. Sputnik 1: Earth's First Artificial Satellite\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nSatellites are usually classified according to the type of orbit they are in. There are four types of orbit associated with satellites, and the type of orbit dictates a satellite's use.atellites are usually classified according to the type of orbit they are in. There are four types of orbit associated with satellites, and the type of orbit dictates a satellite's use.\nMore World Satellites. 1  Asia Satellite. 2  Mexico Satellite. 3  Caribbean Satellite.  Pacific Ocean 1  Satellite. Atlantic Ocean Tropical Satellite.  Australia 1  Satellite. Africa Satellite.  South America Satellite.\nMore World Satellites. 1  Asia Satellite. 2  Mexico Satellite. 3  Atlantic Ocean Satellite.  Caribbean 1  Satellite. Atlantic Ocean Tropical Satellite.  Australia 1  Satellite. Africa Satellite.  South America Satellite.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon. The world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth.\nClass of satellite orbit. The satellites orbit at different altitudes and tragectories with orbital periods that can range from 90 minutes to days to circle the Earth. The various orbits are used for specific satellite functions.\nOften abbreviated as comsat, a communications satellite is a satellite that has been stationed in space for the purpose of providing telecommunications.Communications satellites are commonly used for mobile phone signals, weather tracking, or broadcasting television programs.Communications satellites are artificial satellites that relay receive signals from an earth station and then retransmits the signal to other earth stations.They commonly move in a geostationary orbit.ommunications satellites are commonly used for mobile phone signals, weather tracking, or broadcasting television programs. Communications satellites are artificial satellites that relay receive signals from an earth station and then retransmits the signal to other earth stations.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon. Sun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets' surface at the same local solar time. 2  Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.\nThere are two major classes of communications satellites, Passive and Active. Passive satellites only redirect (usually via reflection) the signal coming from the source, toward the direction of the receiver. direct broadcast satellite is a communications satellite that transmits to small DBS satellite dishes (usually 18 to 24 inches or 45 to 60 cm in diameter).\nPolar orbiting satellites are an important class of meteorological and geophysical satellite. Typically, these satellites are placed in circular sun-synchronous orbits. Their altitudes usually range from 700 to 800 km, with orbital periods of 98 to 102 minutes.\nWith the ever increasing sophistication of satellites in low. Earth orbit the ability to precisely predict the position and. velocity of the satellite is extremely important. This need. has been amplified in recent years by the development of. Earth observation and meteorological satellites, which.\nA geosynchronous satellite is a satellite that orbits the earth with an orbital period of 24 hours, thus matching the period of the earth's rotational motion. A special class of geosynchronous satellites is a geostationary satellite.\nInstalling your dish. Even if you are capable of tuning your TV and configuring your set-top box, putting up a satellite dish requires some expertise and equipment. Like analogue satellite TV before it, digital satellite television requires a relatively small satellite dish that serves just your household.Some are designed to receive signals from just one satellite, others are designed to handle several satellites.ike analogue satellite TV before it, digital satellite television requires a relatively small satellite dish that serves just your household. Some are designed to receive signals from just one satellite, others are designed to handle several satellites.\nSatellite Communications. Satellite Communications. Satellite communication refers to any communication link that involves the use of an artificial satellite in its propagation path. Satellite communications play a vital role in modern life. There are over 2000 artificial satellites in use.They can be found in geostationary, Molniya, elliptical, and low Earth orbits and are used for traditional point-to-point communications, mobile applications, and the distribution of TV and radio programs.atellite Communications. Satellite Communications. Satellite communication refers to any communication link that involves the use of an artificial satellite in its propagation path. Satellite communications play a vital role in modern life. There are over 2000 artificial satellites in use.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nSatellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways. Well-known classes include low Earth orbit, polar orbit, and geostationary orbit. Chambers 20th Century Dictionary (0.00 / 0 votes) Rate this definition:\nSatellite. In the context of spaceflight, a satellite is an object which has been placed into orbit by human endeavor. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as the Moon. The world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 1,459 artificial satellites orbiting the Earth.\nSatellites can be divided into two kinds, namely: 1  Natural satellites are satellites that already exist in the Solar System without created by Man. Example: Month. 2  Artificial satellites are satellites made by humans and launched using a rocket with a specific purpose. Example: Envisat.\nSatellites can be divided into two kinds, namely: 1  Natural satellites are satellites that already exist in the Solar System without created by Man. 2  Artificial satellites are satellites made by humans and launched using a rocket with a specific purpose.\nThere has been one known artificial satellite orbiting Mercury, known as Messenger.... The planet Mercury does not have any known moons (natural satellites) as of 2014. There has been one known artificial satellite orbiting Mercury, known as Messenger.... The planet Mercury does not have any known moons (natural satellites) as of 2014. There has been one known artificial satellite orbiting Mercury, known as Messenger. Messengerâ\u0080\u0099s mission to Mercury was launched on August 3, 2004 and began an orbit of Mercury in March 2011. In the 1970s, astronomers believed Mercury might have a moon based on large amounts of ultraviolet radiation detected by a National Aeronautics and Space Administration (NASA) spacecraft.\nNASA. Spacecraft are designed to serve a variety of functions. The basic kinds of craft include sounding rockets, artificial satellites and space probes, space stations, and other vehicles for carrying humans through space. Sounding rockets carry scientific instruments into the upper atmosphere to collect data. An artificial satellite is a craft that orbits a larger.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth.Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nView full size image. A satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth).There are dozens upon dozens of natural satellites in the solar system, with almost every planet having at least one moon.here are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth). There are dozens upon dozens of natural satellites in the solar system, with almost every planet having at least one moon.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.he first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nA satellite is any object that moves in a curved path around a planet. The moon is Earth's original, natural satellite, and there are many man-made (artificial) satellites, usually closer to Earth. The path a satellite follows is an orbit, which sometimes takes the shape of a circle.To understand why satellites move this way, we must revisit our friend Newton.he moon is Earth's original, natural satellite, and there are many man-made (artificial) satellites, usually closer to Earth. The path a satellite follows is an orbit, which sometimes takes the shape of a circle. To understand why satellites move this way, we must revisit our friend Newton.\nSatellite radio, also called subscription radio (SR) or digital radio is a satellite-based radio broadcast service. It uses direct broadcasting satellites (DBS) a type of satellite used for consumer services such as radio and television programs.A direct broadcasting satellite is similar to a fixed service satellite (FSS), but offers a higher power output requiring smaller antennas for receiving the signal.t uses direct broadcasting satellites (DBS) a type of satellite used for consumer services such as radio and television programs. A direct broadcasting satellite is similar to a fixed service satellite (FSS), but offers a higher power output requiring smaller antennas for receiving the signal.\n1 Sun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets' surface at the same local solar time. 2  Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.he first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nSatellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways. Well-known (overlapping) classes include low Earth orbit, polar orbit, and geostationary orbit.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit. Artificial satellites originate from more than 40 countries and have used the satellite launching capabilities of ten nations.\n1 Synchronous orbit: An orbit where the satellite has an orbital period equal to the average rotational period (earth's is: 23 hours, 56 minutes, 4.091 seconds) of the body being orbited and in the same direction of rotation as that body. 2  To a ground observer such a satellite would trace an analemma (figure 8) in the sky.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.Artificial satellites originate from more than 40 countries and have used the satellite launching capabilities of ten nations.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.ach of a series of Soviet artificial satellites, the first of which (launched on 4 October 1957) was the first satellite to be placed in orbit.\nThe first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.he first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.\nSatellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways. Well-known (overlapping) classes include low Earth orbit, polar orbit, and geostationary orbit. About 6,600 satellites have been launched.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nAstronomical satellites are those which are used for observation of distant planets, galaxies, and other outer space objects.Astronomical performance from the Earthâ\u0080\u0099s surface is limited by Earthâ\u0080\u0099s atmospheric conditions.otational Behaviour Saturn. There are various types of satellites. They are Astronomical satellites, Communication Satellites, Earth Observation Satellites, Navigation Satellites, Reconnaisance satellite, Solar Power satellites, Weather satellites and Miniaturized satellites.\nClass Project Report: Supervised Classification and Unsupervised Classification 2 1. Introduction One of the main purposes of satellite remote sensing is to interpret the observed data and classify features. In addition to the approach of photointerpretation, quantitative analysis, which uses computer to label each pixel to\nExplorer 1 was the first U.S. satellite and the first satellite to carry scientific instruments. Explorer 1 was the United States' first satellite in space. The 1958 launch of the satellite â\u0080\u0094 twice the size of a basketball â\u0080\u0094 was an important moment for the country, as the Space Race with the Soviet Union was just beginning.\nIn Artificial Satellites. The first artificial satellite was Sputnik 1 and it was launched  into an elliptical low Earth orbit by the Soviet Union October 4 at  19:28:34p.m. in 1957.   The first â\u0080¦ US satellite was Explorer I on January 31, 1958.\nSatellites are objects orbiting a planet. The moon is a natural satellite. Artificial satellites are those put into orbit by man. The first artificial satellite was Sputnik I launched by the Soviet Union in 1957. Now almost fifty years later there are thousands of satellites orbiting the Earth at various heights.\nOrbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth. When it comes to satellites, space engineers have different types of orbits to choose from.Satellites can orbit Earth's equator or go over Earth's North and South Poles. . . or anything in between.They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space. The choice of orbit all depends on the satellite's job.atellites can orbit Earth's equator or go over Earth's North and South Poles. . . or anything in between. They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space. The choice of orbit all depends on the satellite's job.\nA satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth).\nA satellite with an orbital inclination between zero and ninety degrees is said to be in what is called a direct or prograde orbit, meaning that it orbits in the same direction as the Earth's rotation. A satellite with an orbital inclination between 90 and 180 degrees is said to be in a retrograde orbit. satellite with an orbital inclination between zero and ninety degrees is said to be in what is called a direct or prograde orbit, meaning that it orbits in the same direction as the Earth's rotation. A satellite with an orbital inclination between 90 and 180 degrees is said to be in a retrograde orbit.", "key": "50_3", "timestamp": "2020-06-23 21:18:59.101855", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}