{"input_text": "In 1998, about a year after Netflix's founding, the company grew by starting in the  DVD by mail  business. In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and  Blu-ray  rental service. The company expanded internationally with streaming made available to Canada in 2010 and continued growing its streaming service from there; by January 2016, Netflix was available in over 190 countries. Netflix entered the production business in 2013, debuting its first series,  House of Cards . It greatly expanded the production of both film and television series since then, offering \" Netflix Original \" content through its online library of films and television. Netflix is releasing an estimated 126 original series or films in 2016, more than any other network or cable channel.\nRed Envelope Entertainment (originally Netflix First) was a film production and distribution arm of  Netflix , designed to generate content for Netflix's  DVD-by-mail  service. The company produced and/or distributed over 100 films, before ultimately being closed.\nHastings said that when he founded Netflix, he had no idea whether customers would use the service. \"Netflix was originally a single rental service, but the subscription model was one of a few ideas we had—so there was no Aha! moment. Having unlimited due dates and no late fees has worked in a powerful way and now seems obvious, but at that time we had no idea if consumers would even build and use an online queue.\"\nNetflix  is an American global on-demand internet  streaming media  provider, that has distributed a number of exclusive programs, including original series, specials, miniseries, documentaries, and films. Netflix's original productions also include continuations of previously canceled series from other channels, as well as licensing or co-producing content from international broadcasters for exclusive broadcast in other territories, which is also branded in those regions as Netflix original content. Netflix previously produced content through  Red Envelope Entertainment .\nIn June 2008, Netflix announced plans to eliminate its online subscriber profile feature. Profiles allow one subscriber account to contain multiple users (for example, a couple, two roommates, or parent and child) with separate DVD queues, ratings, recommendations, friend lists, reviews, and intra-site communications for each. Netflix contended that elimination of profiles would improve the customer experience. However, likely as a result of negative reviews and reaction by Netflix users, Netflix reversed its decision to remove profiles 11 days after the announcement. In announcing the reinstatement of profiles, Netflix defended its original decision, stating, \"Because of an ongoing desire to make our website easier to use, we believed taking a feature away that is only used by a very small minority would help us improve the site for everyone,\" then explained its reversal: \"Listening to our members, we realized that users of this feature often describe it as an essential part of their Netflix experience. Simplicity is only one virtue and it can certainly be outweighed by utility.\"\nBy 2010, Netflix's streaming business had grown so quickly that within months the company had shifted from the fastest-growing customer of the  United States Postal Service 's  first-class service  to the largest source of Internet streaming traffic in North America in the evening. In November, it began offering a standalone streaming service separate from DVD rentals. On September 18, 2011, Netflix announced its intentions to rebrand and restructure its DVD home media rental service as an independent  subsidiary  called  Qwikster , separating DVD rental and streaming services. Andy Rendich, a 12-year Netflix veteran, was to be CEO of Qwikster. Qwikster would carry  video game s whereas Netflix did not. However, in October 2011, Netflix announced that it would retain its DVD service under the name Netflix and would not, in fact, create Qwikster for that purpose.\nNetflix has been one of the most successful  dot-com ventures . In September 2002,  The New York Times  reported that, at the time, Netflix mailed about 190,000 discs per day to its 670,000 monthly subscribers. The company's published subscriber count increased from one million in the fourth quarter of 2002 to around 5.6 million at the end of the third quarter of 2006, to 14 million in March 2010. Netflix's early growth was fueled by the fast spread of  DVD player s in households; in 2004, nearly two-thirds of United States homes had a DVD player. Netflix capitalized on the success of the DVD and its rapid expansion into United States homes, integrating the potential of the Internet and e-commerce to provide services and catalogs that bricks-and-mortar retailers could not compete with. Netflix also operates an online affiliate program which has helped to build online sales for DVD rentals. The company offers unlimited vacation time for salaried workers and allows employees to take any amount of their paychecks in stock options.\nThe Basics. Netflix is primarily a streaming media service that originated in the U.S. in 1997. It started out as a DVD-by-mail company, and that aspect of the business still exists in North America.\nNetflix is an American entertainment company founded by Reed Hastings and Marc Randolph on August 29, 1997, in Scotts Valley, California.[6] It specializes in and provides streaming media and video-on-demand online and DVD by mail. In 2013, Netflix expanded into film and television production, as well as online distribution.\nNetflix started out as a mail-order DVD rental service, adding instant streaming as a side benefit for some of its subscription plans.\nNetflix previously produced content through Red Envelope Entertainment. Netflix's first self-commissioned original content series House of Cards was released in 2013, and the company has dramatically grown its original content since that time. Netflix released an estimated 126 original series or films in 2016, more than any other single American network or cable channel.\nYou could pay $30 or $40 a month and work out as little or as much as you wanted.. Hastings said that when he founded Netflix, he had no idea whether customers would use the service. Netflix was originally a single rental service, but the subscription model was one of a few ideas we hadâ\u0080\u0094so there was no Aha! moment.\nIt's hard to believe, but Netflix launched and operated for the first five years without spending any significant advertising money. We had two secret weapons. First, we had a meaningful connection with the rabid early DVD adopters on Usenet groups, the equivalent of early 90s bulletin boards and today's blogs.\nYou may have noticed the ubiquitous Netflix pop-under advertisement; it's the reason the company was second in online advertising dollars spent last year. Netflix was originally a single rental service, but the subscription model was one of a few ideas we had--so there was no Aha! moment.\nThese days, Netflix is best known for its streaming video service and original content that wins it plenty of Emmy Award nominations. But the companyâ\u0080\u0099s original business â\u0080\u0093 shipping Blu-ray discs and DVDs to customers via snail mail â\u0080\u0093 is still alive and kicking. Well, at least five days out of the week. In a clear sign of the times, Netflix isnâ\u0080\u0099t shipping discs on Saturdays anymore, and itâ\u0080\u0099s likely saving money as a result.\nNetflix is an amazing digital success story. Starting out more than 20 years ago as a predominantly DVD subscription service by Reed Hastings and Marc Randolph, Netflix was able to pivot along the way and take advantage of rapidly evolving mobile technology and ever-improving internet speeds to become one of the largest video distribution networks on the planet.\nHow does Netflix shipping work? Note: DVDs and the Queue feature are only available in the US. Once you create a list in Your Queue of DVDs or Blu-ray discs you want to watch, we ship them to the address on your account via US Postal Service First Class Mail.\nNetflix Inc. (also known as Netflix, marketed and stylized as NETFLIX) is an American multinational entertainment company founded on August 29, 1997, in Scotts Valley, California, by Reed Hastings and Marc Randolph. It specializes in and provides streaming media and video on demand online and DVD by mail. In 2013, Netflix added film and television production, as well as online distribution. The company is currently headquartered in Los Gatos. In 1998, about a year after Netflix's founding, the company grew by starting in the DVD by mail business. In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and Blu-ray rental service.", "key": "49_2", "timestamp": "2020-06-23 21:18:59.081598", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}