{"input_text": "The largest great white recognized by the  International Game Fish Association  (IGFA) is one caught by Alf Dean in the south Australian waters in 1959, weighing . Several larger great whites caught by anglers have since been verified, but were later disallowed from formal recognition by IGFA monitors for rules violations.\nNew footage has emerged showing what is widely regarded to be the largest great white shark ever caught on camera - Deep Blue. The 20-foot-long predator was first filmed near Mexico's Guadalupe Island in 2013 and featured on Discovery Channel show Jaws Strikes Back.\nA monster male named Apache hauled up off Mexico is the biggest great white shark yet caught, an expedition team reports. A monster male named Apache hauled up off Mexico is the biggest great white shark yet caught, an expedition team reports.\nA diver has filmed what experts believe is the biggest great white shark ever caught on camera - and she's HUGE. The seven metre-long female, known as Deep Blue, stunned the world last year a video was unveiled showing her dwarfing cage divers. It was filmed off the coast of Guadalupe Island, Mexico.\nHowever, most great whites are around 12 to 14 feet (3.6 to 4 meters) long, says Christopher Lowe, a shark biologist at California State University in Long Beach. A 17.9-foot-long (5.5-meter-long) male great white was caught off Guadalupe in fall 2009. (Related: Biggest Great White Shark Caught, Released.) Deep Blue is clearly a very large shark, he says. There may be another reason for that: Instead of the slim, torpedo shape of most white sharks, she's pretty rotund, adds Lowe.\nQuick Answer. According to Discovery Communications, the biggest great white shark ever reported was 23 feet long. It was caught off the coast of Malta by Alfredo Cutajar in 1987, however there is still some debate as to if the measurement was accurate or not. Continue Reading.\nAustralia, 1984. According to National Geographic, the biggest great white ever caught was 5.9m long. The female shark was caught at Ledge Point, Australia, just around the peninsula where Joan of Shark was found. Prince Edward Island 1988.\nScientific name: Carcharodon carcharias. Largest recorded: 26.2ft, 5000lbs. Danger to humans: very high, like the tiger shark, great whites are an apex predator that will eat 'almost anything,' and have the highest recorded number of fatal attacks on humans, despite that they are not the great whites' preferred diet.\nThree of the Biggest Great Whites Ever Caught (and Reliably Measured) According to shark expert J. E. Randall, the largest white shark reliably measured was 6.0 m (19.7 ft), found near Ledge Point, Western Australia in 1987.\n5 of the WORLD'S BIGGEST GREAT WHITE SHARKS ever caught! The video features 5 of the biggest sharks in the world ever caught -- including the biggest shark ever! Great White Shark 5th largest. Date: 1992. Location: South Australia. Caught by: Dion Gilmore. Length: 5.2m (17ft). Weight: 1520kg (3351lb). Additional info: Shark caught during a Daiwa tackle promotion.\nGreat whites average 12-16 feet long. The biggest great white shark on record was 23 feet long, weighing about 7,000 pounds. Females are larger than males, as with most sharks. Shark pups can be over 5 feet long at birth. This Hand Puppet, however, is just 24 inches long.\nThe biggest Great White Shark on record was 23 feet so Great Whites can probably just get up to 23 feet 35 to 40 feet Great White Sharks usually reach or exceed 20 feet in length. The largest on record was a 36 foot individual caught in the 1870s off the coast of Southern Australia.\nWhen measured, the shark was found to be in excess of 21 feet and weighed over 7,000 pounds, which would make it the largest great white shark on record. But not all scientists trust the measurements taken that day, and the true size and weight of El Monstruo have been debated ever since.\nThe largest weight of a whale shark registered is 47,000 pounds or 21.5 tonnes. From there, weights are smaller and change according with the species. Male bull sharks weight around 200 pounds while female bull sharks can reach up to 290 pounds. The largest tiger shark captured weight was 1,450 pounds. The great white shark weight ranges from 1,500 lb. to 2,500 lb. Links to other pages in this site. Why Do The Great White Sharks Attack Humans? Where Does A Whale Shark Live? What Is A Whale Shark? How Much Do Sharks Weight? How Do Sharks Know When Something Is Food Or Not?\nThree of the Biggest Great Whites Ever Caught (and Reliably Measured) According to shark expert J. E. Randall, the largest white shark reliably measured was 6.0 m (19.7 ft), found near Ledge Point, Western Australia in 1987. In 1988, David McKendrick of Alberton, Prince Edward Island, caught a female of similar length: 6.1 m (20 ft) long.\nBiologist Mauricio Hoyos Padilla posted a Facebook video of what he claims is the biggest great white shark ever filmed: An approximately 20-foot (6-meter) long female dubbed Deep Blue. According to the California Department of Fish and Game, great white sharks can grow up to 21 feet (6 meters) long. However, most great whites are around 12 to 14 feet (3.6 to 4 meters) long, says Christopher Lowe, a shark biologist at California State University in Long Beach. A 17.9-foot-long (5.5-meter-long) male great white was caught off Guadalupe in fall 2009. (Related: Biggest Great White Shark Caught, Released.) Deep Blue is clearly a very large shark, he says.\nWhat's the largest ever great white shark to be recorded? On average, female great whites are 4.6 to 4.9m long, although the male sharks don't grow as big, measuring up at around 3.4 to 4.0m. Alf Dean caught the largest great white recorded by the International Game Fish Association in the south Australian waters in 1959. The sea predator weighed a staggering 1,208 kg (2,663 lb). It's believed that anglers have since caught bigger sharks, but these have not been officially confirmed.", "key": "32_6", "timestamp": "2020-06-23 21:18:58.989595", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}