{"input_text": "The Galileo Gambit gained public attention during the 2012 United States presidential campaign, when Texas governor  Rick Perry  expressed skepticism about  global warming . Perry suggested that scientists stating \"here is the fact\" did not necessarily imply that this was so, and that \"Galileo got outvoted for a spell.\" The argument is flawed in that being ridiculed does not necessarily correlate with being right and that many people who have been ridiculed in history were, in fact, wrong. Similarly,  Carl Sagan  has stated that while they laughed at Columbus and the Wright Brothers, \"they also laughed at  Bozo the Clown .\"\nIn the early stages of development, it was tested with GPS as the only  satellite navigation  network, however it is known that the U.S. (and other nations) have methods and devices to interfere the satellite signal ( jamming ), thereby degrading weapon accuracy. In order to improve the resilience against jamming, it was decided to create a guide system, capable of operating with three satellite navigation networks:  GPS  (USA),  Galileo  (Europe) and  GLONASS  (Russia). The software coupled to the SMKB reads simultaneously and individually the three systems and assesses the positioning based on a verification algorithm, which provides greater reliability, because the data are crossed to allow correct positioning.  In addition, the company has developed anti-jamming capability with encrypted software which provides complete system integrity, also enhanced by the use of a highly directive  radiation pattern .Super Tucano aircraft were used during a 2 weeks long trials at which the first in-flight launch of the weapon took place in December 2010 at  Natal Air Force Base . The SMKB-82 was cleared for use with the AMX, F-5, Kfir and Super Tucano by December 2012. Qualification test for SMKB-83 are scheduled to commence in 2013\nThe Global Positioning System (GPS) is a space-based  global navigation satellite system  that provides reliable,  three-dimensional  positioning, navigation, and timing services to worldwide users on a continuous basis in all weather, day and night, anywhere on or near the Earth. 24 satellites orbit around the Earth twice a day, transmitting signaled information to  GPS receivers  that take this information and use triangulation to calculate the user's exact location. Ultimately, the GPS is the descendant of the United States Navy's  Timation  satellite program and the United States Air Force's 621-B satellite program. The invention of GPS was a collaborative and team effort. The basic architecture of GPS was devised in less than a month in 1972 by Colonel  Bradford Parkinson , Mel Birnbaum, Bob Rennard, and Jim Spilker. However, Richard Easton, a son of  Roger Easton  who was the head of the U.S. Navy's Timation program, claims that his father invented GPS and filed U.S. patent #3,789,409 in 1974. Other names listed by Richard Easton are James Buisson, Thomas McCaskill, Don Lynch, Charles Bartholomew, Randolph Zwirn and, \"an important outsider,\" Robert Kern.  Ivan Getting , while working at  Raytheon , envisioned a satellite system similar to MOSAIC, a railroad mobile ballistic missile guidance system, but working more like  LORAN . The GPS program was approved in December 1973, the first GPS satellite was launched in 1978, and by August 1993, 24 GPS satellites were in orbit. Initial operational capability was established in December of that same year while in February 1994, the  Federal Aviation Agency  (FAA) declared GPS ready for use.\nOn 22 August 2014 Arianespace launched the first two Full Operational Capability satellites for the  Galileo satellite navigation  constellation into  Medium Earth orbit . The mission appeared to proceed normally and Arianespace reported the launch to be a success, however analysis of telemetry data provided by  ESA  and  CNES  tracking stations showed that the satellites were injected into an incorrect orbit.\nThe European Union has already started work on a project to create the Galileo positioning system, to break dependence on the  United States   GPS  system. This is in cooperation with ESA as well as other countries.\nOn 2 May 2000, SA was disabled by the President of the United States,  Bill Clinton ; in late 2001 the entity managing the GPS confirmed that they did not intend to enable selective availability ever again. Though Selective Availability capability still exists, on 19 September 2007 the US Department of Defense announced that newer GPS satellites would not be capable of implementing Selective Availability;the wave of Block IIF satellites launched in 2009, and all subsequent GPS satellites, are stated not to support SA. As old satellites are replaced in the  GPS Block IIIA  program, SA will cease to be an option. The modernisation programme also contains standardised features that allow GPS III and Galileo systems to inter-operate, allowing receivers to be developed to utilise GPS and Galileo together to create an even more precise GNSS.\nIn 2007, Tiefensee chaired talks following which EU transport ministers agreed unanimously to end talks with a private consortium contracted to develop the  Galileo  satellite navigation system and to spend €2.4 billion ($3.2 billion) to build it themselves instead.\nAs the launch of Galileo neared, anti-nuclear groups, concerned over what they perceived as an unacceptable risk to the public's safety from Galileo's RTGs, sought a court injunction prohibiting Galileo's launch. RTGs had been used for years in planetary exploration without mishap: the  Lincoln Experimental Satellite s 8/9, launched by the U.S.  Department of Defense , had 7% more plutonium on board than Galileo, and the two  Voyager spacecraft  each carried 80% as much plutonium as Galileo did. However, activists remembered the messy crash of the Soviet Union's nuclear-powered  Cosmos 954  satellite in Canada in 1978, and though was not nuclear-powered, the 1986  Challenger accident  raised public awareness about spacecraft failures. In addition, no RTGs had ever done a non-orbital swing past the Earth at close range and high speed, as Galileo's Venus-Earth-Earth Gravity Assist trajectory required it to do. This created a novel mission failure modality that might plausibly have entailed total dispersal of Galileo's plutonium in the Earth's atmosphere. Scientist  Carl Sagan , for example, a strong supporter of the Galileo mission, said in 1989 that \"there is nothing absurd about either side of this argument.\"\nThe  ESA  has launched the first set of satellites required for the  Galileo GPS network . This is mainly a political decision by the EU to reduce dependence on American military technology and can thus be seen as a political statement. The Galileo system is operated under civilian control, as opposed to GPS which is operated under American military control. It provides more precise navigation and coverage at higher altitudes.\nSince Galileo was designed to provide the highest possible precision (greater than GPS) to anyone, the US was concerned that an enemy could use Galileo signals in military strikes against the US and its allies (some weapons like missiles use GNSSs for guidance). The frequency initially chosen for Galileo would have made it impossible for the US to block the Galileo signals without also interfering with its own GPS signals. The US did not want to lose their GNSS capability with GPS while denying enemies the use of GNSS. Some US officials became especially concerned when Chinese interest in Galileo was reported.\nGalileo is the  global navigation satellite system  (GNSS) that is currently being created by the  European Union  (EU) through the  European Space Agency  (ESA) and the  European GNSS Agency  (GSA), headquartered in  Prague  in the  Czech Republic , with two ground operations centres,  Oberpfaffenhofen  near  Munich  in Germany and  Fucino  in Italy. The €5 billion project is named after the Italian astronomer  Galileo Galilei . One of the aims of Galileo is to provide an indigenous alternative high-precision positioning system upon which European nations can rely, independently from the Russian  GLONASS , Indian  NAVIC , Chinese  Bei Dou  and US  GPS  systems, in case they were disabled by their operators.The use of basic (low-precision) Galileo services will be free and open to everyone. The high-precision capabilities will be available for paying commercial users. Galileo is intended to provide horizontal and vertical position measurements within 1-metre precision, and better positioning services at high  latitude s than other positioning systems.\nThe  Galileo positioning system  is another EU infrastructure project. Galileo is a proposed  Satellite navigation  system, to be built by the EU and launched by the  European Space Agency  (ESA). The Galileo project was launched partly to reduce the EU's dependency on the US-operated  Global Positioning System , but also to give more complete global coverage and allow for greater accuracy, given the aged nature of the GPS system.\nOne of the reasons given for developing Galileo as an independent system was that position information from GPS can be made significantly inaccurate by the deliberate application of universal  Selective Availability  (SA) by the US military. GPS is widely used worldwide for civilian applications; Galileo's proponents argued that civil infrastructure, including airplane navigation and landing, should not rely solely upon a system with this vulnerability.\nIn addition to GPS, other systems are in use or under development, mainly because of a potential denial of access and potential monitoring by the US government.  The Russian Global Navigation Satellite System ( GLONASS ) was developed contemporaneously with GPS, but suffered from incomplete coverage of the globe until the mid-2000s. GLONASS can be added to GPS devices which makes more satellites available and enabling positions to be fixed more quickly and accurately, to within 2 meters  There are also the European Union  Galileo positioning system , China's  BeiDou Navigation Satellite System , the Japanese  Quasi-Zenith Satellite System , and India's  Indian Regional Navigation Satellite System  (NAVIC).\nAn anonymous EU official claimed that the US officials implied that they might consider shooting down Galileo satellites in the event of a major conflict in which Galileo was used in attacks against American forces. The EU's stance is that Galileo is a neutral technology, available to all countries and everyone. At first, EU officials did not want to change their original plans for Galileo, but have since reached a compromise, that Galileo was to use a different frequency. This allowed the blocking or jamming of either GNSS without affecting the other (jam Galileo without affecting GPS, or jam GPS but not Galileo), giving the US a greater advantage in conflicts in which it has the electronic warfare upper hand.\nOn 7 May 2014, the first two FOC satellites landed in Guyana for their joint launch planned in summer Originally planned for launch during 2013, problems tooling and establishing the production line for assembly led to a delay of a year in serial production of Galileo satellites. These two satellites (Galileo satellites GSAT-201 and GSAT-202) were launched on 22 August 2014. The names of these satellites are Doresa and Milena named after European children who had previously won a drawing contest. On 23 August 2014, launch service provider Arianespace announced that the  flight VS09  experienced anomaly and satellites were injected into an incorrect orbit.\nIn 1999, the different concepts of the three main contributors of  ESA   (Germany, France and Italy) for Galileo were compared and reduced to one by a joint team of engineers from all three countries. The first stage of the Galileo programme was agreed upon officially on 26 May 2003 by the  European Union  and the  European Space Agency .The system is intended primarily for civilian use, unlike the more military-orientated systems of the United States (GPS), Russia (GLONASS), and China (Beidou-1/2, COMPASS).  The European system will only be subject to shutdown for military purposes in extreme circumstances (like armed conflict). It will be available at its full precision to both  civil  and military users.\nThe company was the primary construction company for the  Galileo positioning system , tasked with developing and building the satellites and components for the  ground segment  infrastructure of this satellite navigation system. The partner firms committed to not construct competing products for Galileo. However, some competition came from  Surrey Satellite Technology Ltd , which successfully built and launched the first  GIOVE-A  testbed satellite, and which was then awarded a contract for a followon  GIOVE-A2  satellite while the joint venture's  GIOVE-B  satellite remained on the ground awaiting launch. Since that time, the  GIOVE-B  satellite successfully launched, although after the Galileo project had been abandoned by European Satellite Navigation Industries and taken up by the  European Union .\nGalileo is intended to be an EU civilian GNSS that allows all users access to it.  GPS  is a US military GNSS that provides location signals that have high precision to US military users, while also providing less precise location signals to others. The GPS had the capability to block the \"civilian\" signals while still being able to use the \"military\" signal (M-band). A primary motivation for the Galileo project was the EU concern that the US could deny others access to GPS during political disagreements.", "key": "50_6", "timestamp": "2020-06-23 21:18:59.109101", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}