{"input_text": "QB50 is a proposed international network of 50 CubeSats for multi-point, in-situ measurements in the lower  thermosphere  (90–350 km) and re-entry research. QB50 is an initiative of the  Von Karman Institute  and is funded by the European Commission as part of the 7th Framework Programme (FP7). Double-unit (2U) CubeSats (10×10×20 cm) are developed, with one unit (the 'functional' unit) providing the usual satellite functions and the other unit (the 'science' unit) accommodating a set of standardised sensors for lower thermosphere and re-entry research. 35 CubeSats are envisaged to be provided by universities in 19 European countries, 10 by universities in the US, 2 by universities in Canada, 3 by Japanese universities, 1 by an institute in Brazil, and others. Ten 2U or 3U CubeSats are foreseen to serve for in-orbit technology demonstration of new space technologies.\nAAU CubeSat was a  CubeSat  built and operated by students from  Aalborg University  in  Denmark . AAU CubeSat was launched on 30 June 2003 from the  Plesetsk Cosmodrome  on a Russian \" Rockot \"  rocket .\nThree CubeSats were launched on April 25, 2016 together with Sentinel-1B on a Soyuz rocket VS14 launched from Kourou, French Guiana. The satellites were: AAUSAT4 (Aalborg University, Denmark), e-st@r-II (Politecnico di Torino, Italy) and OUFTI-1 (Université de Liège, Belgium). The CubeSats were launched in the framework of the \"Fly Your Satellite!\" programme of the European Space Agency.\nIt was successfully launched on an  Orbital Sciences Corporation   Minotaur I  rocket from  Pad 0B  at the  Mid-Atlantic Regional Spaceport , at 23:55 GMT on 19 May. It was a tertiary payload, with  TacSat-3  as the primary payload and  PharmaSat  as the secondary. Two other CubeSats,  HawkSat I  and  CP6 , were also launched, and together the three satellites were known as the CubeSat Technology Demonstration mission.\nIn 1998,  about 50 students and faculties from 12 universities from the United States and Japan met at a symposium held in Hawaii. It was the first \"University Space Systems Symposium\". Here,  Bob Twiggs , professor emeritus at the  Stanford University , proposed the initial idea of what later would become the nanosatellite projects. That idea was to launch a structure of the size of a soda can into space. Its volume should be around 350 milliliters and the mass, about 500 grams. This led to a project that began in 1999 called ARLISS, involving mostly American and Japanese Universities, carrying out the first launch on September, 11th of that year and continuing each year without interruption.The initial idea, still prevalent today, was to launch 3 satellites of 350 milliliters, or a satellite of greater volume. The means would be a rocket capable of moving 1.8 kilos and of ascending to 4000 meters, opening the door to low cost space flights -about $400.In 2000, the missions were very different: for instance, calculating the opening of a landing system using data provided by the barometer or making use of a  differential GPS  system. The project came to a more complex situation in 2001 when the ComeBack category was added, according to which the satellite should be directed to a particular target. This mission was very successful and, in 2002, students of Space Robotics Lab of the  Tohoku University  went up to 45 meters from the target and, in 2006, this figure dropped to 6 meters.Interest in this type of satellite has been growing and spreading. In 2003, the  University of Tokyo  placed into orbit two satellites  CubeSat , satellites of a size slightly larger than the CanSats, and cube shaped. In recent years, several competitions have been developed following the same concept proposed by Prof.  Bob Twiggs  and reflected in ARLISS both national and internationally.\nWhile nearly all CubeSats are deployed from a launch vehicle or the International Space Station, some are deployed by the primary payloads themselves. For example,  FASTSAT  deployed the  NanoSail-D2 , a 3U CubeSat. This was done again with the  Cygnus Mass Simulator  as the primary payload launched on the maiden flight of the  Antares  rocket, carrying and later deploying four CubeSats. For CubeSat applications beyond Earth's orbit, the method of deploying the satellites from the primary payload will also be adopted. Eleven CubeSats are planned to be launched on the  Space Launch System 's  Exploration Mission 1 , which would place them in the vicinity of the  Moon .  Insight , a planned  Mars   lander , will also bring CubeSats beyond Earth orbit to use them as  relay communications satellites . Known as  MarCO  A and B, they would be the first CubeSats sent beyond the  Earth–Moon system .\nThe second vehicle is a three-stage rocket capable of orbital flight. It is an evolved version of the model ARION-1. It has a mass of 7000 kg and a height of 18 meters and can it can reach 250 km in high orbit. The weight of the payload is between 50 and 150 kg (330 lb) and the first launch for ARION-2 is scheduled  in February 2020. In the same year, the first commercial launch will also take place, with a satellite of 50 kg (110 lb) and with four CubeSat, funded by different universities. The first lunar launch is planned around 2023. The company is planning to situate the future launching platform of the rocket ARION-2 in the Canary Islands.  Canary Islands .\nUniSat-5  is the first satellite designed, built and launched by G.A.U.S.S. Srl, the company that inherits the experience gained with the UniSat program at the  School of Aerospace Engineering  of the  University of Rome “La Sapienza” . The spacecraft was inserted into a near-SSO orbit with an altitude of 634 km at 07:25:48 UTC.The launch of UniSat-5 satellite, boarded on the  Dnepr  rocket, took place on 21 November 2013 from Yasny cosmodrome in Russia, marking an historical event in the world of CubeSats and nanosatellites.  UniSat-5  boarded four  CubeSat s and four  PocketQube s.\nThe term \"CubeSat\" was coined to denote  nanosatellites  that adhere to the standards described in the CubeSat design specification. Cal Poly published the standard in an effort led by aerospace engineering professor Jordi Puig-Suari.  Bob Twiggs , of the Department of Aeronautics & Astronautics at Stanford University, and currently a member of the space science faculty at Morehead State University in Kentucky, has contributed to the CubeSat community. His efforts have focused on CubeSats from educational institutions. The specification does not apply to other cube-like nanosatellites such as the NASA \"MEPSI\" nanosatellite, which is slightly larger than a CubeSat.\nThe Interactive Satellite for Art and Design Experimental Research or INVADER, also known as Cubesat Oscar 77 (CO-77) and Artsat-1 is an artificial satellite for artistic experiments in space. The satellite was built by the  University of Tokyo  in collaboration with  Tama Art University . It has a size of 100x100x100mm (without antennas) and built around a standard 1U  cubesat  bus. The primary satellite payload is an FM voice transmitter. Also, it includes low-resolution CMOS camera and  thermochromic  panels for artistic purposes.\nInstitute of Space Technology on 21 November 2013, launched Pakistan's first  Cubesat satellite ,  iCUBE-1 , onboard  Dnepr launch vehicle  from  Yasny launch base ,  Russia . Its transmitted signal can be heard on VHF band. It has a mass of 1.1 kg & has a volume of 10 cm cube, it houses several sensors to collect data for scientific purposes. iCUBE-1 is a fully autonomous satellite and is capable of maintaining its health via its on-board computer. iCUBE-1 will open up a wide range of future experiments that can be carried on Cubesat in the domain of  imaging ,  microgravity ,  biology ,  nanotechnology , space dynamics,  chemistry ,  space physics  and various other fields. Cubesats can also provide a test bed for developing satellite constellations for specific applications.\nSpokesperson  IST  Raza Butt said that it’s a positive move for technology in  Pakistan .“The world is moving towards miniaturization. The launch cost is significantly low for CubeSats as compared to the bigger satellites. The low cost factor is very attractive for researchers who can test their payloads using these cubesats and then incorporate this technology in their bigger satellites,” he commented.\nDuring the development of the Estonian satellite mission it was decided to make a 1U CubeSat.By standard 1 unit (1U) CubeSat base side length must be 100.0±0.1 millimeters and satellite height must be 113.5±0.1 mm.Mass is also set in CubeSat standard, the highest possible mass for 1U CubeSat is 1300 grams.\nFour CubeSats were deployed from the  Cygnus Mass Simulator , which was launched April 21, 2013 on the maiden flight of Orbital Sciences'  Antares rocket . Three of them are 1U  PhoneSat s built by NASA's  Ames Research Center  to demonstrate the use of  smart phones  as  avionics  in CubeSats. The fourth was a 3U satellite, called Dove-1, built by  Planet Labs .\nSome CubeSats have complicated components or instruments, such as  LightSail-1 , that  pushes their construction cost into the millions, but a basic 1U CubeSat can cost about $50,000 to construct so CubeSats are a viable option for some schools and universities; as well as small businesses to develop CubeSats for commercial purposes.\nG.A.U.S.S. Srl (also known as GAUSS Srl) is an Italian limited liability  private company  specialized in the development and launch of  small satellites ,  CubeSat s and  PocketQube s.\nThe Dynamic Ionosphere CubeSat Experiment (DICE) is a scientific mission consisting of two  Miniaturized Satellites  DICE-1 and DICE-2 flying in formation. The satellites are an unusual 1.5U variant of the  CubeSat  design for microsatellites. Both satellites were launched from  Vandenberg Air Force Base  in October 2011 atop a  Delta II   rocket . This was a multi-payload mission with four other CubeSats,  AubieSat-1 ,  M-Cubed ,  Explorer-1_Prime  and  RAX-2 .\nHayato was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the  H-IIA  202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . K-Sat shared its dispenser with the  Negai ☆  satellite, whilst a second dispenser contained  Waseda-SAT2 . The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nDesiring to shorten the development cycle experienced on OPAL and inspired by the picosatellites OPAL carried, Twiggs set out to find \"how much could you reduce the size and still have a practical satellite\". The picosatellites on OPAL were 10.1×7.6×2.5 cm, a size that was not conducive to covering all sides of the spacecraft with solar cells. Inspired by a 4-inch cubic plastic box used to display  Beanie Babies  in stores, Twiggs first settled on the larger 10-centimeter cube as a guideline for the new (yet-to-be-named) CubeSat concept. A model of a launcher was developed for the new satellite using the same pusher plate concept that had been used in the modified OPAL launcher.  Twiggs presented the idea to Puig-Suari in the summer of 1999 and then at the Japan-U.S. Science, Technology and Space Applications Program (JUSTSAP) conference in November 1999.\nStandard CubeSats are made up of 10×10×11.35 cm units designed to provide 10×10×10 cm or 1 liter of useful volume while weighing no more than  per unit. The smallest standard size is 1U, while 3U+ is the largest being composed of three units stacked lengthwise with an additional 6.4 cm diameter cylinder centered on the long axis and extending 3.6 cm beyond one face.  The Aerospace Corporation  has constructed and launched two smaller form CubeSats of 0.5U for radiation measurement and technological demonstration. In recent years larger CubeSat platforms have been proposed, most commonly 6U (10×20×30 cm or 12×24×36 cm) and 12U (20x20x30 cm or 24x24x36 cm), to extend the capabilities of CubeSats beyond academic and technology validation applications and into more complex science and national defense goals. In 2014 two 6U  Perseus-M  CubeSats were launched for maritime surveillance, those two CubeSats represent the largest CubeSats flown as of 2015. The 2018 launch of the  InSight  lander to Mars, will include two 6U CubeSats called  Mars Cube One  (MarCO).\nIt was successfully launched on an  Orbital Sciences Corporation   Minotaur I  rocket from  Pad 0B  at the  Mid-Atlantic Regional Spaceport , at 23:55 GMT on 19 May. It was a tertiary payload, with  TacSat-3  as the primary payload and  PharmaSat  as the secondary. Two other CubeSats,  AeroCube 3  and  CP6 , were launched on the same rocket, and together the three satellites are known as the CubeSat Technology Demonstration mission.\nArkyd-3  was a 3U  CubeSat  technology demonstrator from  private company   Planetary Resources  (PRI). PRI had packaged a number of the non-optical satellite technologies of its larger  Arkyd-100  telescope satellite—essentially the entire base of the Arkyd-100 satellite model revealed in January 2013, but without the space telescope—into a \"cost-effective box\" of Arkyd 3, or A3, for early in-space  flight test ing as a subscale nanosatellite. The Arkyd-3 testbed satellite was packaged as a 3U CubeSat form-factor of . PRI contracted with  NanoRacks  to take the A3 to the ISS where it was planned to be released from the airlock in the  Kibo module .\nIndian Space Research Organisation  (ISRO) is contributing towards augmenting  ESA   Galileo satellite navigation system  and GPS service in northern Europe by sharing data from the  Indian Regional Navigation Satellite System  (IRNSS). ISRO  Polar Satellite Launch Vehicle  has launched  Miniaturized satellite s of several European universities and opened payload capacity on Indian  CubeSat s to European scientific experiments. India relies on  Arianespace  for the launch of  I-3K -class satellites to geosynchronous transfer orbits.\nA group of UL Lafayette engineering students participating in the Cajun Advanced Picosatellite Experiment (CAPE) built a small artificial  satellite , known as a  CubeSat , that was launched into orbit from the  Republic of Kazakhstan  in 2007. A second satellite, the CAPE-2, was launched into space on the Minotaur 1 rocket in November 2013. The CAPE-2 CubeSat weighed about 2 pounds, had deployable solar panels, and could convert speech to text, tweet messages and send emails.\nCargo in the pressurized compartment includes 30 bags filled with potable water (600 liters), food, crew commodities, CDRA Bed (Carbon Dioxide Removal Assembly), TPF (Two-Phase Flow) experiment unit, PS-TEPC (Position-Sensitive Tissue Equivalent Proportional Chamber) radiation measurement instrument, ExHAM (Exposed Experiment Handrail Attachment Mechanism), HDTV-EF2 hi-def and 4K camera, new J-SSOD (JEM Small Satellite Orbital Deployer), and  CubeSat s ( AOBA-Velox III ,  TuPOD  which comprises two  TubeSat s ( and  OSNSAT ),  EGG ,  ITF-2 ,  STARS-C ,  FREEDOM ,  WASEDA-SAT3 ). Cargo by  NanoRacks  includes  TechEdSat-5 ,  CubeRider ,  RTcMISS , NREP-P DM7, four  Lemur-2 . Additionally, the Blue SPHERES satellite of the MIT Space Systems Laboratory is being returned to the ISS for continued autonomous systems research.\nThe term \"picosatellite\" or \"picosat\" (not to be confused with the  PicoSAT  series of microsatellites) is usually applied to artificial satellites with a wet mass between , although it is sometimes used to refer to any satellite that is under 1 kg in launch mass. Again, designs and proposed designs of these types usually have multiple picosatellites working together or in formation (sometimes the term \"swarm\" is applied). Some designs require a larger \"mother\" satellite for communication with ground controllers or for launching and docking with picosatellites. The  CubeSat  design, with approximately  mass, is an example of a large picosatellite (or minimum nanosat).\nIn 1999,  California Polytechnic State University  (Cal Poly) and  Stanford University  developed the CubeSat specifications to promote and develop the skills necessary for the design, manufacture, and testing of small satellites intended for  low Earth orbit  (LEO) that perform a number of scientific research functions and explore new space technologies. Academia accounted for the majority of CubeSat launches until 2013, when over half of launches were for non-academic purposes, and by 2014 most newly deployed CubeSats were for commercial or amateur projects. CubeSats have been built by large and small companies alike, while other projects have been the subject of  Kickstarter  campaigns.\nThe Miniature X-ray Solar Spectrometer (MinXSS)  CubeSat  was the first launched  National Aeronautics and Space Administration   Science Mission Directorate  CubeSat with a science mission. It was designed, built, and operated primarily by students at the  University of Colorado Boulder  with professional mentorship and involvement from professors, scientists, and engineers in the Aerospace Engineering Sciences department and the  Laboratory for Atmospheric and Space Physics , as well as  Southwest Research Institute ,  NASA   Goddard Space Flight Center , and the  National Center for Atmospheric Research 's  High Altitude Observatory . The mission principal investigator is Dr. Thomas N. Woods and co-investigators are Dr. Amir Caspi, Dr. Phil Chamberlin, Dr. Andrew Jones, Rick Kohnert, Professor Xinlin Li, Professor Scott Palo, and Dr. Stanley Solomon. The student lead ( project manager ,  systems engineer ) was Dr. James Paul Mason, who has since become a Co-I for the  second flight model  of MinXSS.\nIn 2012, Meisei Electric designed and built its first satellite, the  We-Wish   CubeSat . We-Wish, a miniature  infrared  monitoring satellite built using the standardised CubeSat architecture, was developed with the assistance of  amateur radio  operators, and its data was made available to Japanese  high school  students. It was carried to orbit along with several other CubeSats aboard Japan's  Kounotori 3  spacecraft in July 2012, and was launched from the  International Space Station  on 4 October 2012. The CubeSat destructively  deorbit ed as intended on 11 March 2013, after over 150 days of successful operation.\nPLD Space is a Spanish company founded in 2011 with the objective of developing low cost launch vehicles. Currently, the company is developing two models of rockets called ARION-1 and ARION-2 for suborbital and orbital markets. The targets of the company are  CubeSat s,  Micro-g environment  and defense technology. On July 1, 2015, the company accomplished the first test with liquid fuel motor (Propulsion Vertical Test Stand 1 - VTS 1) located in the airport of  Teruel , in  Spain . The first commercial launch is planned in 2018. In December 2015, the company was given an award by the Spanish Scientist Association for their design and development of prototypes, partially recoverable for rockets.\nNASA's CubeSat Launch Initiative has launched more than 46 CubeSats on its ELaNa missions over the last several years, and as of 2016, 57 are manifested for flight over the next few years.  No matter how inexpensive or versatile CubeSats may be, they must hitch rides as secondary payload on large rockets launching much larger spacecraft, at prices starting around $100,000. Since CubeSats are deployed by P-PODs and similar deployment systems, they can be integrated and launched into virtually any launch vehicle. However, some launch service providers refuse to launch CubeSats, whether on all launches or only on specific launches, two examples are  ILS  and  Sea Launch .\nThe Vermont Lunar CubeSat is a  CubeSat   satellite  by  Vermont Technical College  and funded in part by grants from  NASA , Vermont Space Grant Consortium and in part by voluntary donations. The satellite, costing about 50,000  US Dollars  to build - with NASA offering a free launch as part of the ELaNa program - served as a testing model for guidance and navigation pending future launches. The eventual goal of the project is to build a CubeSat capable of orbiting the Moon.\nSmall solar sails have been proposed to accelerate the deorbiting of small artificial satellites from Earth orbits.  Satellites in  low Earth orbit  can use a combination of solar pressure on the sail and increased atmospheric drag to accelerate satellite  reentry .  A de-orbit sail developed at  Cranfield University  is part of the UK satellite TechDemoSat-1, launched in 2014, and is expected to be deployed at the end of the satellite's five-year useful life. The sail's purpose is to bring the satellite out of orbit over a period of about 25 years. In July 2015 British 3U  CubeSat  called  DeorbitSail  was launched into space with the purpose of testing 16 m deorbit structure, but eventually it failed to deploy it. There is also a student 2U CubeSat mission called  PW-Sat2  planned to launch in 2017 that will test 4 m deorbit sail.\nIn addition to the  primary payload , a Dragon cargo capsule resupply space transport mission to the ISS for NASA, SpaceX deployed five  secondary payload   CubeSat s on the CRS-3 Falcon 9 mission. The CubeSats are part of the  ELaNa-V mission  partially funded under \"NASA's Educational Launch of Nanosatellites\" program. These spacecraft were released from four  Poly Picosatellite Orbital Deployer s (PPODs) attached to the second stage of the Falcon 9 following the separation of the Dragon from the second stage:\nThe CubeSat  reference design  was proposed in 1999 by professors  Jordi Puig-Suari  of  California Polytechnic State University  and  Bob Twiggs  of  Stanford University . The goal was to enable  graduate student s to be able to design, build, test and operate in space a  spacecraft  with capabilities similar to that of the first spacecraft,  Sputnik . The CubeSat, as initially proposed, did not set out to become a standard; rather, it became a standard over time by a process of  emergence . The first CubeSats were launched in June 2003 on a  Russia n  Eurockot , and approximately 75 CubeSats had been placed into orbit by 2012.\nWaseda was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the  H-IIA  202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . A second dispenser contained  K-Sat  and the  Negai ☆  satellite. The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nThe first CubeSats were launched into  low-Earth orbit  in June 2003.  , approximately 75 CubeSats have been placed into orbit, and the number is growing rapidly.\nThe following is a list of  CubeSat s,  nanosatellite s used primarily by universities for research missions, typically in  low Earth orbit s. Some CubeSats became  their country's first national satellite .\nThis was a multi-payload mission with five other CubeSats,  M-Cubed ,  AubieSat-1 ,  DICE-1 ,  DICE-2 , and  Explorer-1 .\nTotal Number of CubeSats: 33\nThe secondary payloads were four  CubeSat s that were deployed from the CMS. Three of them were  PhoneSat s, 1U CubeSats built by NASA's  Ames Research Center . These were named  Alexander ,  Graham  and  Bell , after the  inventor of the telephone . The purpose of these three satellites was to demonstrate the use of  smartphone s as  avionics  in CubeSats. They each had a mass of  and were powered by lithium batteries. The fourth nanosat was a 3U CubeSat, called Dove-1, built by Cosmogia Inc. It carried a \"technology development Earth imagery experiment\" using the Earth's magnetic field for attitude control.\nThe Osaka Prefecture University Satellite, or OPUSAT was a technology demonstration  cubesat  built and operated by  Japan 's  Osaka Prefecture University . It had a size of 100x100x100mm (without antennas and solar paddles) and build around a standard 1U  cubesat  bus. The primary satellite purpose is the space testing of the power system based on a  Lithium-ion capacitor . The tests were largely successful, and it finished operation by reentry to Earth atmosphere on 24 July 2014. The OPUSAT is a development successor to “Maido Ichigo” satellite by East Osaka Craftmen Astro-Technology SOHLA in Osaka.\nIn copybook style, the rocket first flung out Oceansat-2 at an altitude of 720 km above the earth in a sun-synchronous orbit (SSO), followed by the four nano satellites - also called Cubesats, each weighing one kg. The remaining two, each weighing eight kg, were attached to the rocket's fourth stage. Of the six nano satellites, four are from Germany, one is from Switzerland and one from Turkey. The seventh is a big one, India's Oceansat-2 weighing 960 kg. Soon after the satellites were put into orbit, Indian Space Research Organisation's (ISRO) satellite tracking centres started monitoring them. This was the 16th PSLV mission.\nOn 23.9.2009 UWE-2 was launched by an Indian  PSLV  rocket (PSLV-C14) together with  Oceansat-2  and three further CubeSats in a polar orbit at 730 km altitude. Successful operations could be initiated.\nLike larger satellites, CubeSats often feature multiple computers handling different tasks in  parallel  including the  attitude control , power management, payload operation, and primary control tasks. COTS attitude control systems typically include their own computer, as do the power management systems. Payloads must be able to interface with the primary computer to be useful, which sometimes requires the use of another small computer. This may be due to limitations in the primary computer's ability to control the payload with limited communication protocols, to prevent overloading the primary computer with raw data handling, or to ensure payload's operation continues uninterrupted by the spacecraft's other computing needs such as communication. Still, the primary computer may be used for payload related tasks, which might include  image processing ,  data analysis , and  data compression . Tasks which the primary computer typically handles include the delegation of tasks to the other computers, attitude control, calculations for  orbital maneuver s,  scheduling , and activation of active thermal control components. CubeSat computers are highly susceptible to radiation and builders will take special steps to ensure proper operation in the high radiation of space, such as the use of the  ECC RAM . Some satellites may incorporate  redundancy  by implementing multiple primary computers, this could be done on valuable missions to lessen the risk of mission failure. Consumer  smartphone s have been used for computing in some CubeSats, such as NASA's  PhoneSat s.\nP-PODs were designed with CubeSats to provide a common platform for  secondary payload s. P-PODs are mounted to a  launch vehicle  and carry CubeSats into orbit and deploy them once the proper signal is received from the launch vehicle. The P-POD Mk III has capacity for three 1U CubeSats, or other 0.5U, 1U, 1.5U, 2U, or 3U CubeSats combination up to a maximum volume of 3U. Other CubeSat deployers exist, with the NanoRacks CubeSat Deployer (NRCSD) on the International Space Station being the most popular method of CubeSat deployment as of 2014. Some CubeSat deployers are created by companies, such as the ISIPOD (Innovative Solutions In Space BV) or SPL (Astro und Feinwerktechnik Adlershof GmbH), while some have been created by governments or other non-profit institutions such as the X-POD ( University of Toronto ), T-POD ( University of Tokyo ), or the J-SSOD ( JAXA ) on the International Space Station. While the P-POD is limited to launching a 3U CubeSat at most, the NRCSD can launch a 6U (10×10×68.1 cm) CubeSat and the ISIPOD can launch a different form of 6U CubeSat (10×22.63×34.05 cm).\nNASA's CubeSat Launch Initiative, created in 2010 provides CubeSat launch opportunities to educational institutions, non-profit organizations and NASA Centers. Since its inception the CubeSat Launch Initiative has launched 46 CubeSats flown on 12 ELaNa Missions from 28 unique organizations and has selected 119 CubeSat missions from 66 unique organizations.  Educational Launch of Nanosatellites (ELaNa) missions have included: BisonSat the first CubeSat built by a tribal college, TJ3Sat the first CubeSat built by a high school and STMSat-1 the first CubeSat built by an elementary school. NASA releases an Announcement of Opportunity in August of each year with selections made the following February.\nThe Japanese Experiment Module Small Satellite Orbital Deployer (J-SSOD) is the first of its kind to deploy small satellites from the International Space Station. The facility provides a unique satellite install case to the Japanese Experiment Module (JEM) Remote Manipulator System (RMS) for deploying small, CubeSat, satellites from the ISS. The J-SSOD holds up to 3 small one-unit (1U, 10 x 10 x 10 centimeters) small CubeSats per satellite install case, 6 in total, though other sizes up to 55 x 55 x 35 cm may also be used. Each pre-packed satellite install case is loaded by crewmembers onto the Multi-Purpose Experiment Platform (MPEP) within the JEM habitable volume. The MPEP platform is then attached to the JEM Slide Table inside the JEM airlock for transfer to the JEMRMS and space environment. The JEMRMS grapples and maneuvers the MPEP and J-SSOD to a predefined deployment orientation and then jettisons the small CubeSat satellites.\nFlock 1 is a US  CubeSat   satellite constellation  launched on 9 January  2014 . The satellite is built in 3U  CubeSat  bus, and each constellation consist of 28 satellites.All instruments are powered by solar cells mounted on the spacecraft body and triple-folded wings, providing approximately 20 W maximal power.\nQIKCom-1 is an amateur radio payload built to take advantage of the previously developed APRS network. Because it flies on a host spacecraft (SIMPL), there were no solar panels or attitude control systems developed (as in previous designs). It continues the PCSat and PSAT missions containing APRS packet radio communications transponders for relaying remote telemetry, sensor and user data from remote users and amateur radio environmental experiments. The data transponder also includes all the telemetry and command and control for a complete CubeSat.\nA CubeSat (U-class spacecraft) is a type of  miniaturized satellite  for  space research  that is made up of multiples of 10×10×11.35 cm cubic units. CubeSats have a mass of no more than 1.33 kilograms per unit, and often use  commercial off-the-shelf  (COTS) components for their  electronics  and structure. CubeSats are most commonly put in orbit by deployers on the  International Space Station , or launched as  secondary payload\nAttitude control  for CubeSats relies on miniaturizing technology without significant performance degradation. Tumbling typically occurs as soon as a CubeSat is deployed, due to asymmetric deployment forces and bumping with other CubeSats. Some CubeSats operate normally while tumbling, but those that require pointing in a certain direction or cannot operate safely while spinning, must be detumbled. Systems that perform attitude determination and control include  reaction wheel s,  magnetorquer s, thrusters,  star tracker s,  Sun sensor s, Earth sensors,  angular rate sensor s, and  GPS receivers and antennas . Combinations of these systems are typically seen in order to take each method's advantages and mitigate their shortcomings.  Reaction wheels  are commonly utilized for their ability to impart relatively large  moments  for any given energy input, but reaction wheel's utility is limited due to saturation, the point at which a wheel cannot spin faster. Examples of CubeSat reaction wheels include the Maryland Aerospace MAI-101 and the Sinclair Interplanetary RW-0.03-4. Reaction wheels can be desaturated with the use of thrusters or magnetorquers. Thrusters can provide large moments by imparting a  couple  on the spacecraft but inefficiencies in small propulsion systems cause thrusters to run out of fuel rapidly. Commonly found on nearly all CubeSats are magnetorquers which run electricity through a  solenoid  to take advantage of Earth's magnetic field to produce a  turning moment . Attitude-control modules and solar panels typically feature built-in magnetorquers. For CubeSats that only need to detumble, no attitude determination method beyond an  angular rate sensor  or electronic  gyroscope  is necessary.\nThe MARS-CAT mission is a two 6U  CubeSat  mission to study Mars' ionosphere. The mission will investigate its plasma and magnetic structure, including transient plasma structures, magnetic field structure, magnetic activity and correlation with solar wind drivers. The Mars transit proposed is piggyback with Mars2020 using a CubeSat Ambipolar Thruster (CAT) burn for Mars orbit insertion and station keeping.\nCUTE-1.7 + APD (Cubical Tokyo Tech Engineering satellite 1.7) or CO-56 (Cubesat- Oscar -56) is an  amateur radio satellite  in the form of a double  CubeSat .  The satellite uses  commercial off-the-shelf  components extensively, in particular, using the  Hitachi  NPD-20JWL  PDA  as a control computer, and using a  USB hub  for sensor communications.  At the end of its mission, the satellite will deploy an  electrodynamic tether  to help it deorbit. It was launched on February 21 2006 on board a Japanese launcher  M-V .\nThe overall objectives are to provide a hands-on project environment for the students at the ITU under faculty guidance. The mission goals are to capture imagery of the  CMOS  payload, and to study the behavior of the passive stabilization system of the CubeSat.\nFUNcube-1 is a complete educational single unit  CubeSat   satellite  with the goal of enthusing and educating young people about radio, space, physics and electronics. It is part of a program which aims to launch more of these educational CubeSats. It is the first satellite with outreach as its primary mission.\nOther publicized Busek technologies include RF  ion engines  and a  resistojet rocket . Another focus is  CubeSat  propulsion, proposed for the 2018  Lunar IceCube  mission.\nNUTS-1 (NTNU Test Satellite) is a  Norwegian  2U  CubeSat  created by the NUTS student satellite project at  NTNU . The  satellite  is currently under development by students from several  engineering  and science disciplines.  It is one of three CubeSats part of the Norwegian student space program ANSAT, the other two are the  CubeStar  and the  HiNCube .  From NTNUs CubeSat projects NUTS-1 is a succssor of the  nCube-1  and nCube-2 projects. The satellite will use a main groundstation located at  NTNU .\n LituanicaSAT-1 is one of the two first  Lithuania n satellites. It was launched along with  the second Cygnus spacecraft  and 28  Flock-1   CubeSat s aboard an  Antares 120  carrier rocket flying from  Pad 0B  at the  Mid-Atlantic Regional Spaceport  on  Wallops Island  to the  International Space Station . The launch was scheduled to occur in December 2013, but later was rescheduled to 9 January 2014. The satellite is broadcasting greetings of Lithuanian president, Mrs.  Dalia Grybauskaitė . The satellite was deployed from the International Space Station via the  NanoRacks   CubeSat Deployer  on February 28, 2014. All LituanicaSAT-1 subsystems have been turned on, tested and proved to be working properly. The mission is considered a complete success by its team of engineers. The mission ended upon the reentry and disintegration of the satellite on July 28, 2014.\nEdison Demonstration of Smallsat Networks (EDSN) is a  CubeSat   Satellite constellation  by  NASA Ames  developed as a technology demonstration of satellite networking. The constellation will consist of 8 identical satellites. The satellites follow the CubeSat specifications for a 1.5U CubeSat.\nCubeSats belong to a class of research spacecraft called  nanosatellite s. The basic cube-shaped satellites measure  on each side, weigh less than , and have a volume of about , although CubeSats are built, and deployed, that are multiples of 10 cm in length.\nThe first CubeSats were launched into  low Earth orbit  in June 2003.  , approximately 75 CubeSats have been placed into orbit, and the number is growing rapidly.\nRoBiSAT represents the second Romanian artificial nanosatellites mission. The mission is composed out of 2 Cubesat 2U type satellites that will be part of the QB50 constellation. They will be sent to the  ISS  at the end of 2016 on the  Cygnus CRS OA-7 .The two nanosatellites, called Robisat 1 and Robisat 2, were built at the Institute of Space Science located in  Magurele ,  Romania .\nCubeSats use  solar cell s to convert solar light to electricity that is then stored in rechargeable  lithium-ion batteries  that provide power during eclipse as well as during peak load times. These satellites have a limited surface area on their external walls for solar cells assembly, and has to be effectively shared with other parts, such as antennas, optical sensors, camera lens, propulsion systems, and access port. Lithium-ion batteries feature high energy-to-mass ratios, making them well suited to use on mass-restricted spacecraft. Battery charging and discharging is typically handled by a dedicated electrical power system (EPS). Batteries sometimes feature heaters to prevent the battery from reaching dangerously low temperatures which might cause battery and mission failure. Missions with higher power requirements can make use of  attitude control  to ensure the solar panels remain in their most effective orientation toward the Sun, and further power needs can be met through the addition and orientation of deployed solar arrays. Recent innovations include additional spring-loaded solar arrays that deploy as soon as the satellite is released, as well as arrays that feature  thermal knife  mechanisms that would deploy the panels when commanded. CubeSats may not be powered between launch and deployment, and must feature a  remove-before-flight  pin which cuts all power to prevent operation during loading into the P-POD. Additionally, a deployment switch is actuated while the craft is loaded into a P-POD, cutting power to the spacecraft and is deactivated after exiting the P-POD.\nSolar sail s (also called light sails or photon sails) are a form of spacecraft propulsion using the  radiation pressure  (also called solar pressure) from stars to push large ultra-thin mirrors to high speeds, requiring no propellant. Force from a solar sail scales with the sail's area, this makes sails well suited for use in CubeSats as their small mass results in the greater acceleration for a given solar sail's area. However, solar sails still need to be quite large compared to the satellite, which means useful solar sails must be  deployed, adding mechanical complexity and a potential source of failure. This propulsion method is the only one not plagued with restrictions set by the CubeSat Design Specification, as it does not require high pressures, hazardous materials, or significant chemical energy. Few CubeSats have employed a solar sail as its main propulsion and stability in deep space, including the 3U  NanoSail-D2  launched in 2010, and the  LightSail-1  in May 2015.  LightSail-2  is scheduled for launch in March 2017, while at least two CubeSats that plan to launch on the  Space Launch System 's first flight in September 2018 are set to use solar sails, the proposed  Near-Earth Asteroid Scout  (NEA Scout) and the  Lunar Flashlight .\nTurkSat-3USat is packed in a three-unit  CubeSat  structure made by Innovative Solutions In Space BV (ISIS) from  Delft ,  Netherlands . It is   wide and  long, and has a mass of about .\nThe NanoRacks CubeSat Deployer (NRCSD) is a device to deploy  CubeSat s into orbit from the  International Space Station .\nCubeSat propulsion has made rapid advancements in the following technologies:  cold gas ,  chemical propulsion ,  electric propulsion , and  solar sail s. The biggest challenge with CubeSat propulsion is preventing risk to the launch vehicle and its primary  payload  while still providing significant capability. Components and methods that are commonly used in larger satellites are disallowed or limited and the CubeSat Design Specification (CDS) requires a waiver for pressurization above 1.2 standard  atmospheres , over 100 Wh of stored chemical energy, and hazardous materials. Those restrictions pose great challenges for CubeSat propulsion systems, as typical space propulsion systems utilize combinations of high pressures, high energy densities, and hazardous materials. Beyond the restrictions set forth by  launch service provider s, various technical challenges further reduce the usefulness of CubeSat propulsion.  Gimbaled thrust  cannot be used in small engines due to the complexity of gimbaling mechanisms, thrust vectoring must instead be achieved by thrusting asymmetrically in multiple-nozzle propulsion systems or by changing the center of mass relative to the CubeSat's geometry with actuated components. Small motors may also not have room for  throttling  methods that allow smaller than fully-on thrust, which is important for precision maneuvers such as  rendezvous . CubeSats which require longer life also benefit from propulsion systems, when used for  orbit keeping  a propulsion system can slow  orbital decay .\nAubieSat-1 ( OSCAR -71) is a  CubeSat  designed, built, and tested by undergraduate  students  at  Auburn University . It was launched from  Vandenberg Air Force Base  October 28, 2011 atop a  Delta II   rocket . This was a multi-payload mission with five other CubeSats,  M-Cubed ,  DICE-1 ,  DICE-2 ,  Explorer-1  and  RAX-2 .\nMaSat-1 (from the words Magyar and Satellite, the first meaning \" Hungarian \" in Hungarian, maszat, pronounced IPA [ˈmɒsɒt], meaning \"smudge\") is the first indigenous Hungarian  satellite , developed and built by students at the  Technical University of Budapest . The 1U  CubeSat -type satellite was launched into  low Earth orbit  on 13 February 2012. The satellite provides telemetric data as well as VGA resolution color images at the 70 cm amateur radio wavelength (437.345 MHz frequency) received at the tracking center at  Budapest . The center was tested on 31 March 2009 with the help of  Charles Simonyi  on board the  International Space Station . With the successful launch of MaSat-1, Hungary became the 47th nation to orbit a satellite. Between 9 and 10 January 2015, the satellite reentered into the atmosphere, so the mission is closed.\nCubeSat s are small, low-cost satellites that are typically launched as secondary payloads on other missions, often built and operated as student projects. Several CubeSat missions have attempted to deploy tethers, so far without success.\nTesting must be performed to achieve all launch provider requirements as well as any additional testing requirements deemed necessary to ensure the safety of the CubeSats and the P-POD. All flight hardware will undergo qualification and acceptance testing. The P-PODs will be tested in a similar manner to ensure the safety and feasibility before the CubeSats will be integrated. All CubeSats have to pass the following tests:\nThe two NextSTEP CubeSat projects had fixed-price contracts with technical and payment milestones and total values for the entire development and operations of $1.4 to $7.9 million per award. The selected companies were:\n, one method of getting CubeSats to  orbit  is to  transport  them aboard a larger spacecraft as part of  a cargo load  to a larger  space station .  When this is done, deploying the CubeSats into orbit as a separate  artificial satellite  requires a special apparatus, such as the NanoRacks CubeSat Deployer. The NRCSD is put into position to be grabbed by one of the ISS’s robotic arms, which then places the CubeSat deployer into the correct position externally mounted to the ISS to be able to release the miniature satellites into proper orbit.\nThe satellite was successfully launched on 13 February 2012 from the  Guiana Space Centre , together with  LARES  and other CubeSat satellites from other European countries.\nA  cold gas thruster  typically stores  inert gas , such as  nitrogen , in a  pressurized tank  and releases the gas through a  nozzle  to produce thrust. Operation is handled by just a single  valve  in most systems, which makes cold gas the simplest useful propulsion technology. Cold gas propulsion systems can be very safe since the gases used do not have to be volatile or  corrosive , though some systems opt to feature dangerous gases such as  sulfur dioxide . This ability to use inert gases is highly advantageous to CubeSats as they are usually restricted from hazardous materials. Unfortunately, only low performance can be achieved with them, preventing high impulse maneuvers even in low mass CubeSats. Due to this low performance, their use in CubeSats for main propulsion is limited and designers choose higher efficiency systems with only minor increases in complexity. Cold gas systems more often see use in CubeSat attitude control.\nTotal Number of CubeSats: 32\nCubeSat  electric propulsion  typically uses electric energy to accelerate propellant to high speed, which results in high  specific impulse . Many of these technologies can be made small enough for use in nanosatellites, and several methods are in development. Types of electric propulsion currently being designed for use in CubeSats include  Hall-effect thruster s,  ion thruster s,  pulsed plasma thruster s,  electrospray thrusters , and  resistojets . Several notable CubeSat missions plan to use electric propulsion, such as NASA's  Lunar IceCube . The high efficiency associated with electric propulsion could allow CubeSats to propel themselves to Mars. Electric propulsion systems are disadvantaged in their use of power, which requires the CubeSat to have larger solar cells, more complicated power distribution, and often larger batteries. Furthermore, many electric propulsion methods may still require pressurized tanks to store propellant, which is restricted by the CubeSat Design Specification.\nOn 5 May 2015,  NASA  announced a program based at the  Kennedy Space Center  dedicated to develop a new class of rockets designed specifically to launch very small satellites: the NASA  Venture Class Launch Services  (VCLS), which will offer a payload mass of 30 kg to 60 kg for each launcher. Five months later, in October 2015, NASA awarded a total of $17.1 million to three separate startup launch companies for one flight each: $6.9 million to  Rocket Lab  ( Electron rocket ); $5.5 million to  Firefly Space Systems  ( Alpha rocket ); and $4.7 million to  Virgin Galactic  ( LauncherOne rocket ). The payloads for the three flights under the VCLS contract have not yet been assigned. Other small satellite launch systems are under development that would carry CubeSats alongside a small payload, including the Neptune series of rockets by  Interorbital Systems ,  Garvey Spacecraft 's Nanosat Launch Vehicle, and the  SPARK  rocket. In addition to conventional launch vehicles, several  air launch to orbit  vehicles are in the works by  Swiss Space Systems ,  Generation Orbit Launch Services , and  Boeing  (in the form of their  Small Launch Vehicle ).\nCuSP is a low-cost 6U  CubeSat  nanosatellite that once deployed, will orbit the Sun, measuring  incoming radiation  that can create a wide variety of effects at Earth, from interfering with radio communications to tripping up satellite electronics to creating electric currents in power grids. The principal investigator for CuSP is Mihir Desai, at the  Southwest Research Institute  in San Antonio, Texas. It will fly as a secondary payload mission on the first flight of the  Space Launch System ,  Exploration Mission 1  (EM-1) scheduled to launch in 2018.\nOn Carl Sagan's 75th birthday (November 9, 2009) the  Planetary Society  announced plans to make three further attempts, dubbed  LightSail-1 , -2, and -3. The new design will use a 32 m Mylar sail, deployed in four triangular segments like NanoSail-D. The launch configuration is a 3U  CubeSat  format, and as of 2015, it is scheduled as a secondary payload for a 2016 launch on the first  SpaceX   Falcon Heavy  launch. The Planetary Society  of the  United States  initiated a short test of an  artificial satellite  \" LightSail-A \" that launched on 20 May 2015. The purpose of the test is to allow a full checkout of the satellite's systems in advance of the main 2016 mission, LightSail-1.\nThe recurring CubeSats programme of the Education Office of the European Space Agency where university students have the opportunity to develop and implement their CubeSat mission with support of ESA specialists. Participating student teams can experience the full life cycle of a spacecraft from designing, building, and testing to eventually, the possibility of launching and operating their CubeSat.\nUses typically involve experiments which can be miniaturized or serve purposes such as  Earth observation  or  amateur radio . Many CubeSats are used to demonstrate spacecraft technologies that are targeted for use in small satellites or that present questionable feasibility and are unlikely to justify the cost of a larger satellite. Scientific experiments with questionable underlying theory may also find themselves aboard CubeSats as their low cost could justify riskier experiments. Biological research payloads have been flown on several missions, with more planned. Several missions to the  Moon  and  Mars  are planned to use CubeSats.\nUCISAT-1 is the first  CubeSat  to be launched by  UCISAT , a student-run CubeSat project at the  University of California, Irvine .\nPurpose: These 28 3U CubeSats are working to build an Earth-observation constellation based solely on CubeSats. The CubeSats contain batteries that provide power to the various systems in each Dove. Each satellite has an optical telescope for acquiring high-resolution images of earth. Each satellites uses an X-band system for the downlink of acquired images and systems telemetry at data rates of 120Mbit/s.\nThe Vermont Tech CubeSat Lab launched its first satellite, the Vermont Lunar CubeSat, a 1U  CubeSat  on November 19, 2013, and was fully functional until reentry on November 21, 2015.  It is still the only successful university satellite from a college or university in New England or the east coast of the U.S.  We are now working on the flight software for  Lunar IceCube  which has a ride to the moon on NASA's  Space Launch System .\nThe  Multi-Application Survivable Tether  (MAST) launched three 1-kg CubeSat modules with a 1-km tether. Two of the CubeSat modules (\"Ted\" and \"Ralph\") were intended as end-masses on the deployed tether, while the third (\"Gadget\") served as a climber that could move up and down the tether.  The experiment used a multi-line \" Hoytether \" designed to be damage–resistant. The objectives of the MAST experiment were to obtain on-orbit data on the survivability of space tethers in the micrometeorite/debris orbital environment, to study the dynamics of tethered formations of spacecraft and rotating tether systems, and to demonstrate momentum-exchange tether concepts. The experiment hardware was designed under a NASA  Small Business Technology Transfer  (STTR) collaboration between  Tethers Unlimited, Inc.  and  Stanford University , with TUI developing the tether, tether deployer, tether inspection subsystem, satellite avionics, and software, and Stanford students developing the satellite structures and assisting with the avionics design, as a part of the University CubeSat program.\nNegai was deployed from a  JAXA Picosatellite Deployer  attached to the second stage of the H-IIA 202 rocket used in the launch of the  Akatsuki  spacecraft towards  Venus . Negai shared its dispenser with the  K-Sat  satellite, whilst a second dispenser contained  Waseda-SAT2 . The three CubeSats separated into  low Earth orbit  during a  coast phase  of the launch, between the first and second burns of the second stage. The rocket then continued to Heliocentric orbit, where it deployed Akatsuki, along with the  IKAROS  and  UNITEC-1  spacecraft.\nDifferent CubeSat components possess different acceptable temperature ranges, beyond which they may become temporarily or permanently inoperable. Satellites in orbit are heated by  radiative heat  emitted from the  Sun ,  Earth , sunlight reflected off Earth, as well as heat generated by the craft's components. CubeSats must also  cool by radiating heat  either into space or into the cooler Earth's surface, if it is cooler than the spacecraft. All of these radiative heat sources and sinks are rather constant and very predictable, so long as the CubeSat's orbit and eclipse time are known.\nMost Read. 1  ExoAnalytic video shows Telkom-1 satellite erupting debris. 2  PSLV launch of navigation satellite fails. 3  Lockheed wonâ\u0080\u0099t protest now two-way race to refresh U.S. nuclear arsenal. 4  North Korean missiles are testing a stressed U.S. defense net. 5  Soyuz launch customers search for cause of cubesat failures.\n(Page excerpted from WIkipedia http://en.wikipedia.org/wiki/CubeSat). A CubeSat is a type of miniaturized satellite for space research that usually has a volume of exactly one liter (10 cm cube), has a mass of no more than 1.33 kilograms, [1] and typically uses commercial off-the-shelf components for its electronics.1U cubesat structure without outer skin.2]. The standard 10Ã\u009710Ã\u009710 cm basic CubeSat is often called a â\u0080\u009c1Uâ\u0080\u009d CubeSat meaning one unit. CubeSats are scalable along only one axis, by 1U increments. CubeSats such as a â\u0080\u009c2Uâ\u0080\u009d CubeSat (20Ã\u009710Ã\u009710 cm) and a â\u0080\u009c3Uâ\u0080\u009d CubeSat (30Ã\u009710Ã\u009710 cm) have been both built and launched.\nCubeSat. 615 pages on this wiki. A CubeSat is a type of miniaturized satellite for space research that usually has a volume of exactly one liter (10 cm cube), has a mass of no more than 1.33 kilograms, and typically uses commercial off-the-shelf electronics components.15 pages on this wiki. A CubeSat is a type of miniaturized satellite for space research that usually has a volume of exactly one liter (10 cm cube), has a mass of no more than 1.33 kilograms, and typically uses commercial off-the-shelf electronics components.\n[2]. The standard 10Ã\u009710Ã\u009710 cm basic CubeSat is often called a â\u0080\u009c1Uâ\u0080\u009d CubeSat meaning one unit. CubeSats are scalable along only one axis, by 1U increments. CubeSats such as a â\u0080\u009c2Uâ\u0080\u009d CubeSat (20Ã\u009710Ã\u009710 cm) and a â\u0080\u009c3Uâ\u0080\u009d CubeSat (30Ã\u009710Ã\u009710 cm) have been both built and launched.2]. The standard 10Ã\u009710Ã\u009710 cm basic CubeSat is often called a â\u0080\u009c1Uâ\u0080\u009d CubeSat meaning one unit. CubeSats are scalable along only one axis, by 1U increments. CubeSats such as a â\u0080\u009c2Uâ\u0080\u009d CubeSat (20Ã\u009710Ã\u009710 cm) and a â\u0080\u009c3Uâ\u0080\u009d CubeSat (30Ã\u009710Ã\u009710 cm) have been both built and launched.\n3U CubeSats which utilize the space are designated 3U+ and may place components in a cylindrical volume centered on one end of the CubeSat. The cylindrical space has a maximum diameter of 6.4 cm and a height no greater than 3.6 cm while not allowing for any increase in mass beyond the 3U's maximum of 4 kg.-PODs are mounted to a launch vehicle and carry CubeSats into orbit and deploy them once the proper signal is received from the launch vehicle. The P-POD Mk III has capacity for three 1U CubeSats, or other 0.5U, 1U, 1.5U, 2U, or 3U CubeSats combination up to a maximum volume of 3U.\nStandard CubeSats are made up of 10Ã\u009710Ã\u009711.35 cm units designed to provide 10Ã\u009710Ã\u009710 cm or 1 liter of useful volume while weighing no more than 1.33 kg (2.9 lb) per unit. The smallest standard size is 1U and 3U is the largest which does not occupy allowed extra volumes.-PODs are mounted to a launch vehicle and carry CubeSats into orbit and deploy them once the proper signal is received from the launch vehicle. The P-POD Mk III has capacity for three 1U CubeSats, or other 0.5U, 1U, 1.5U, 2U, or 3U CubeSats combination up to a maximum volume of 3U.\nThirteen CubeSats are set to launch aboard an Atlas V rocket with the NROL-55 primary payload from Vandenberg Air Force Base on October 8th, 2015.The CubeSat payloads have been provided through NASA's Educational Launch of Nanosatellites (ELaNa) program and the NRO's Mission Integration Directorate (MID).Below is information about each CubeSat including tracking information where available and links to developers' websites.he CubeSat payloads have been provided through NASA's Educational Launch of Nanosatellites (ELaNa) program and the NRO's Mission Integration Directorate (MID). Below is information about each CubeSat including tracking information where available and links to developers' websites.\nThe basic building block of cubesats is a cube measuring 4 inches (10 centimeters) on each side. Satellites that consist of just a single such block are known as 1U (short for one unit) cubesats; those that combine two or three of them are 2U and 3U, respectively.mall and economical cubesats already eye our planet from orbit. But such bantam craft are about to start pushing out into deep space, helping researchers study and explore the moon, asteroids and other distant bodies.\nThe CubeSat Kit is designed to help you complete a successful CubeSat mission in as short a time as possible, and at low cost.Each CubeSat Kit includes: 1  A rugged Development Board that you use in the lab to prototype mission-specific hardware, develop software, test your ideas, measure performance, etc.ll you need beyond the CubeSat kit is a PC with a USB port and a CubeSat-Kit certified C compiler / Integrated Development Environment (IDE). You use the compiler and IDE to develop software for this MCU.\nCubeSats in brief. A CubeSat is a type of very small satellite which is based on a standardized unit of mass and volume.\nCubeSats are miniature satellites that are commonly used in  low Earth orbit for applications such as remote sensing or communications. As engineers become more familiar with the technology, CubeSats are also being considered for flights outside of Earth orbit â\u0080\u0094 particularly to locations such as Mars or Jupiter.\nList of CubeSats. The following is a list of CubeSats, nanosatellites used primarily by universities for research missions, typically in low Earth orbits. Some CubeSats became their country's first national satellite.\nA CubeSat is a type of miniaturized satellite for space research that is made up of multiples of 10Ã\u009710Ã\u009710 cm cubic units. CubeSats have a mass of no more than 1.33 kilograms per unit, and often use commercial off-the-shelf components for their electronics and structure. CubeSats are most commonly put in orbit by deployers on the International Space Station, or launched as secondary payloads on a launch vehicle. In 1999, California Polytechnic State University and Stanford University ...\nWhat are CubeSats? These nanosatellites typically weigh between 1 and 10 kilograms and follow the popular â\u0080\u0098CubeSatâ\u0080\u0099 standard, which defines the outer dimensions of the satellite within multiple cubic units of 10x10x10 cm. For instance, a 3-unit CubeSat has dimensions of 10x10x30 cm and weighs about 3-4 kg.\nSince CubeSats missions are often made to very Low Earth Orbits (LEO), and experience atmospheric reentry after just days or weeks, radiation can largely be ignored and standard consumer-grade electronics may be used. CubeSats are built from four specific types of aluminum alloy to ensure that they have the same coefficient of thermal expansion as the launch vehicle.\nCredit: U.S. Naval Research Laboratory photo. 1  SAN FRANCISCO â\u0080\u0094 Cubesats, once largely regarded as university teaching tools, are attracting the attention of U.S. military officials eager to use the miniature satellites to improve battlefield communications, monitor space weather and gather data from unattended sensors.", "key": "50_7", "timestamp": "2020-06-23 21:18:59.111286", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}