{"input_text": "The dark and reddish asteroid is a member of the  Hilda family , the outermost orbital group of asteroids in the main-belt, that are thought to have originated from the  Kuiper belt . It orbits the Sun at a distance of 3.2–4.7  AU  once every 7 years and 11 months (2,882 days). Its orbit has an  eccentricity  of 0.18 and an  inclination  of 3 °  with respect to the  ecliptic . The asteroid's  observation arc  begins on its discovery night at Turku, the first used observation. As all Hildian asteroids orbit in a 3:2  orbital resonance  with the gas giant Jupiter, meaning that for every 2 orbits Jupiter completes around the Sun, they will complete 3 orbits, this asteroid's orbit does not cross the path of any of the planets and therefore it will not be pulled out of orbit by Jupiter's gravitational field. As a result of this, it is likely that the asteroid will remain in a stable orbit for thousands of years.\nMolniya (, \"Lightning\") was a  military   communications satellite  system used by the  Soviet Union . The satellites were placed into highly  eccentric   elliptical orbit s known as  Molniya orbit s, characterised by an  inclination  of +63.4  degree s and a  period  of around 12 hours. Such orbits allowed them to remain visible to sites in  polar  regions for extended periods, unlike geostationary satellites in  geosynchronous orbit s with a 24-hour orbital period.\nThe primary component, Epsilon Ursae Minoris A, is an  eclipsing   spectroscopic binary .  It is classified as a yellow  G-type   giant  with a mean  apparent magnitude  of +4.21.  In addition to light changes due to eclipses, the system is also classified as an  RS Canum Venaticorum type   variable star  and its brightness varies from magnitude +4.19 to +4.23 with a period of 39.48 days, which is also the orbital period of the binary.  The binary is orbited by a third component, Epsilon Ursae Minoris B, which is an 11th magnitude star, 77  arcsecond s away in the sky.\n3753 Cruithne ( or ) is a  Q-type ,  Aten asteroid  in  orbit  around the  Sun  in 1:1  orbital resonance  with Earth, making it a  co-orbital object . It is an  asteroid  that, relative to Earth, orbits in a bean-shaped orbit that effectively describes a  horseshoe , and that can transition into a  quasi-satellite  orbit. It has been incorrectly called \" Earth's second moon \". Cruithne does not orbit Earth and at times it is on the other side of the Sun. Its orbit takes it inside the orbit of  Mercury  and outside the orbit of  Mars . Cruithne orbits the Sun in about 1 year but it takes 770 years for the series to complete a horseshoe-shaped movement around the Earth.\nEnceladus is one of the major inner satellites of Saturn along with  Dione ,  Tethys , and  Mimas . It orbits at 238,000 km from Saturn's center and 180,000 km from its cloud tops, between the orbits of Mimas and Tethys. It orbits Saturn every 32.9 hours, fast enough for its motion to be observed over a single night of observation. Enceladus is currently in a 2:1 mean-motion  orbital resonance  with Dione, completing two orbits around Saturn for every one orbit completed by Dione. This resonance maintains Enceladus's orbital eccentricity (0.0047), which is known as a forced eccentricity. This non-zero eccentricity results in tidal deformation of Enceladus. The dissipated heat resulting from this deformation is the main heating source for Enceladus's geologic activity. Enceladus orbits within the densest part of  Saturn's E ring , the outermost of  its major rings , and is the main source of the ring's material composition.\nBecause of its orbital inclination of 10.739° to the ecliptic,  is not always forced by the Earth on its horseshoe orbit however but can sometimes slip out of this pattern. It is then caught for a while in the neighbourhood of the Earth. This will next happen in about 600 years i.e. in the 26th century. It will then stay within the small gap in the Earth’s orbit which it does not reach in its previous horseshoe orbit, and will be no further than 0.2  astronomical unit s (30 million km) away from the Earth. There it will slowly circle the Earth almost like a second moon, although it takes one year for a circuit. After 45 years it finally switches back into the horseshoe orbit, until it again stays near the Earth for 45 years around the year 3750 and again in 6400. In these phases in which it stays outside its horseshoe orbit it oscillates in the narrow region along the Earth’s orbit where it is caught, moving back and forth in 15 years. Because it is not bound to the Earth like the Moon but is mainly under the gravitational influence of the Sun, it belongs to the bodies called  quasi-satellite s. This is somewhat analogous to two  cars  travelling side by side at the same speed and repeatedly overtaking one another but which are however not attached to each other. Orbital calculations show that  was in this quasi-satellite orbit for 45 years from about 520 AD but because of its tiny size was too dim to have been seen. It switches approximately cyclically between the two orbital forms, but always stays for 45 years in the quasi-satellite orbit. Outside the time frame from about 520-6500 AD, the calculated orbits become  chaotic  i.e. not predictable, and thus for periods outside this time frame no exact statements can be made.  was the first known  heavenly body  that switches between horseshoe and quasi-satellite orbits.\nThe world's first artificial satellite, the  Sputnik 1 , was launched by the  Soviet Union  in 1957. Since then, thousands of satellites have been launched into orbit around the  Earth .  A few large satellites have been launched in parts and assembled in orbit.  Artificial satellites from more than 40 countries have been launched by ten nations.  Over a dozen  space probe s have been placed into orbit around other bodies and become artificial satellites to the Moon,  Mercury ,  Venus ,  Mars ,  Jupiter ,  Saturn , a few  asteroid s, and the  Sun .\nUsually when someone is referring to an orbit, they are most likely talking about flare orbits. For example, A 1 click forward flare and a 1 click backward flare in quick succession (altogether creating 4 very quick distinct sounds) would be a 1 click orbit. A 2 click forward flare and a 2 click backward flare in quick succession (altogether creating 6 very distinct sounds) would be a 2 click orbit, etc. Orbits can be performed once as a single orbit move, or sequenced to produce a  cyclical  never ending type of orbit sound.\nOther types of orbit in a 1:1 resonance with the planet include  horseshoe orbit s and  tadpole orbit s around the  Lagrangian point s, but objects in these orbits do not stay near the planet's longitude over many revolutions about the star. Objects in horseshoe orbits are known to sometimes periodically transfer to a relatively short-lived quasi-satellite orbit, and are sometimes confused with them. An example of such an object is .\nA geostationary orbit, geostationary Earth orbit or geosynchronous equatorial orbit (GEO) is a circular  orbit   above the Earth's  equator  and following the direction of the Earth's rotation. An object in such an orbit has an  orbital period  equal to the Earth's rotational period (one  sidereal day ) and thus appears motionless, at a fixed position in the sky, to ground observers.  Communications satellite s and  weather satellite s are often placed in geostationary orbits, so that the  satellite antenna s (located on  Earth ) that communicate with them do not have to rotate to track them, but can be pointed permanently at the position in the sky where the satellites are located. Using this characteristic, ocean color satellites with visible and near-infrared light sensors (e.g. the  Geostationary Ocean Color Imager  (GOCI)) can also be operated in geostationary orbit in order to monitor sensitive changes of ocean environments.\nOko consists of two types of early warning satellites -  US-K  and  US-KMO . The older US-K satellites are in highly elliptical  molniya orbit s which give them coverage of the United States at certain times during the day. For full coverage of the US missile grounds four US-K satellites need to be operational and the system can have up to nine of them in orbit at once.  The US-KMO satellites are  geosynchronous  satellites providing continuous coverage. In total,  101 satellites have been launched .\nAn apogee kick motor (AKM) refers to a  rocket motor  that is regularly employed on  artificial satellites  destined for a  geostationary orbit . As the vast majority of geostationary satellite launches are carried out from  spaceport s at a significant distance away from Earth's  equator , the carrier rocket often only launches the satellite into an orbit with a non-zero inclination approximately equal to the  latitude  of the launch site. This orbit is commonly known as a \" geostationary transfer orbit \" or a \"geosynchronous transfer orbit\". The satellite must then provide thrust to bring forth the needed  delta v  to reach a geostationary orbit. This is typically done with a fixed onboard apogee kick motor. When the satellite reaches its orbit's apogee position, the AKM is ignited, transforming the elliptical orbit into a circular orbit, while at the same time bringing the inclination to around zero degrees, thereby accomplishing the insertion into a geostationary orbit. This process is called an \"apogee kick\".\nAmong the remaining irregular moons, Sao and Laomedeia follow prograde orbits, whereas Halimede, Psamathe and Neso follow retrograde orbits. Given the similarity of their orbits, it was suggested that Neso and Psamathe could have a common origin in the break-up of a larger moon. Psamathe and Neso have the largest orbits of any natural satellites discovered in the Solar system to date. They take 25 years to orbit Neptune at an average of 125 times the distance between Earth and the Moon. Neptune has the largest  Hill sphere  in the Solar System, owing primarily to its large distance from the Sun; this allows it to retain control of such distant moons. Nevertheless, Jupiter's  S/2003 J 2  orbits at the greatest percentage of the primary's Hill radius of all the moons in the Solar System on average, and the Jovian moons in the  Carme  and  Pasiphae group s orbit at a greater percentage of their primary's Hill radius than Psamathe and Neso.\nMost commercial  communications satellite s,  broadcast satellite s and  SBAS  satellites operate in geostationary orbits. A  geostationary transfer orbit  is used to move a satellite from  low Earth orbit  (LEO) into a geostationary orbit. The first satellite placed into a geostationary orbit was the  Syncom -3, launched by a  Delta D rocket  in 1964.\nThe  C-type  asteroid, classified as a Cg-type subtype in the  SMASS  taxonomy, orbits the Sun at a distance of 2.8–2.8  AU  once every 4 years and 8 months (1,695 days). Its orbit shows an  eccentricity  of 0.01 and is  tilted  by 10 degrees to the plane of the  ecliptic . It has a  rotation period  of 12 hours and an  albedo  in the range of 0.07 to 0.10, as observed by the Infrared Astronomical Satellite,  IRAS , the Japanese satellite  Akari , and the  Wide-field Infrared Survey Explorer  with its subsequent  NEOWISE  mission.\nThe first satellite,  Sputnik 1 , was put into orbit around Earth and was therefore in  geocentric orbit . By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude,  inclination  and  eccentricity .\nAlthough no other moons of Earth have been found to date, there are various types of  near-Earth objects  in 1:1 resonance with it, which are known as  quasi-satellite s. Quasi-satellites orbit the Sun from the same distance as a planet, rather than the planet itself. Their orbits are unstable, and will fall into other resonances or be kicked into other orbits over thousands of years. Quasi-satellites of Earth include , ,, , , , and  3753 Cruithne . Cruithne, discovered in 1986, orbits the  Sun  in an elliptical orbit but appears to have a  horseshoe orbit  when viewed from Earth. Some went as far to nickname Cruithne \"Earth's second moon\".\nThe orbits of the Halley-type comets suggest that they were originally long-period comets whose orbits were perturbed by the gravity of the giant planets and directed into the inner Solar System. If Halley was once a long-period comet, it is likely to have originated in the  Oort Cloud , a sphere of cometary bodies that has an inner edge of  20,000–50,000 AU . Conversely the Jupiter-family comets are generally believed to originate in the  Kuiper belt , a flat disc of icy debris between 30 AU (Neptune's orbit) and 50 AU from the Sun (in the  scattered disc ). Another point of origin for the Halley-type comets was proposed in 2008, when a  trans-Neptunian object  with a retrograde orbit similar to Halley's was discovered, , whose orbit takes it from just outside that of Uranus to twice the distance of Pluto. It may be a member of a new population of small Solar System bodies that serves as the source of Halley-type comets.\nThe migrations of the giant planets have many impact throughout the Solar System. The planetesimals scattered inward by Neptune enter planet-crossing orbits, initiating the Late Heavy Bombardment. Some of these planetesimals are  jump-captured  as Jupiter trojans during encounters between Jupiter and the ejected ice giant as Jupiter's semi-major axis changes.Others are captured as irregular satellites of the giant planets via  three-body interactions  during encounters between the ejected ice giant and the other planets. These encounters can also  disturb  the orbits of the regular satellites and may be responsible for the inclination of Iapetus's orbit. Saturn's rotational axis is  tilted  when it slowly crosses a spin-orbit resonance with Neptune. While Neptune migrates outward several AU, the hot classical Kuiper disk is  formed  as some planetesimals scattered outward by Neptune are captured in resonances, undergo an exchange of eccentricity vs inclination via the Kozai mechanism, and are released onto higher perihelion, stable orbits. Planetesimals captured in Neptune's 2:1 resonance during this early migration are released when an encounter with the ice giant causes its semi-major axis to jump outward,  leaving behind  a group of low-inclination, low-eccentricity objects with semi-major axes near 44 AU.  As Neptune slowly  approaches  its current orbit objects are left in fossilized high-perihelion orbits in the scattered disk. In the inner Solar System, the rapid separation of the orbits of Jupiter and Saturn  reduces  the excitation of the eccentricities of the inner planets due to resonance sweeping. Modest  changes  in the asteroids orbits also occur, shifting the distribution of eccentricities from that of the Grand Tack model toward the current distribution. Asteroid collisional families can be dispersed as the ice giant crosses the asteroid belt, and planetesimals from the outer belt are  embedded  in the asteroid belt as  P-   and  D-type asteroid s. When the planets reach their present position the innermost part of the asteroid belt is  disrupted  leading to an extended Late Heavy Bombardment of the inner planets by rocky objects.\n. A maximal orbit type is often called a  principal orbit type .\nIt is a  satellite platform  manufactured by  Orbital Sciences Corporation  with an  apogee kick motor  to place a  communications satellite  into  geostationary orbit , a thruster to provide the satellite with  orbital station-keeping  for a 15 year mission, and  solar array s to provide the satellite payload with 5 kW of electrical power.\nThese types of satellites are almost always in  Sun synchronous  and  \"frozen\"  orbits.  The Sun synchronous orbit is in general sufficiently close to polar to get the desired global coverage while the relatively constant geometry to the Sun mostly is an advantage for the instruments.  The  \"frozen\"  orbit is selected as this is the closest to a circular orbit that is possible in the  gravitational field  of the Earth.\nTokovinin (2013) combined spectroscopic and visual data on the system to find the most accurate determination of the binary orbit thus far. While the photometric colours of the secondary are consistent with an early M-dwarf (), it lies above the main sequence, meaning that its luminosity is too high to be a single star. This means that the secondary must actually be two close stars of similar spectral type, themselves orbiting the more massive primary. Two faint absorption lines were weakly detected in the  Hα  line, varying by about 80 km/s over a period of a few days; these are consistent with two M-dwarfs orbiting each other, confirming that the secondary is a close binary. The subsystem consists of two approximately equal-mass red dwarfs orbiting each other every ~3.7 days. Binaries with such close orbits typically maintain high levels of activity for their lifetimes due to their rotational periods being synchronised to their orbital period, so the components of the secondary are the source of the excess energy in the system.\nThe constellation consists of 66 active satellites in orbit required for global coverage, and additional spare satellites to serve in case of failure. Satellites are in  low Earth orbit  at a height of approximately  and  inclination  of 86.4°. Orbital velocity of the satellites is approximately .  Satellites communicate with neighboring satellites via  inter-satellite links. Each satellite can have four inter-satellite links: two to neighbors fore and aft in the same orbital plane, and two to satellites in neighboring planes to either side. The satellites orbit from pole to same pole with an orbital period of roughly 100 minutes. This design means that there is excellent satellite visibility and service coverage even at the North and South poles. The over-the-pole orbital design produces \"seams\" where satellites in counter-rotating planes next to one another are traveling in opposite directions.  Cross-seam inter-satellite link hand-offs would have to happen very rapidly and cope with large  Doppler shifts ; therefore, Iridium supports inter-satellite links only between satellites orbiting in the same direction. The constellation of 66 active satellites has 6  orbital plane s spaced 30 degrees apart, with 11 satellites in each plane (not counting spares). The original concept was to have 77 satellites, which is where the name Iridium came from, being  the element  with the atomic number 77 and the satellites evoking the  Bohr model  image of electrons orbiting around the Earth as its nucleus. This reduced set of 6 planes is sufficient to cover the entire Earth's surface at every moment.\nAn orbit can fail to be closed in two ways. It could be an asymptotically periodic orbit if it  converges  to a periodic orbit.  Such orbits are not closed because they never truly repeat, but they become arbitrarily close to a repeating orbit.An orbit can also be  chaotic .  These orbits come arbitrarily close to the initial point, but fail to ever converge to a periodic orbit.  They exhibit  sensitive dependence on initial conditions , meaning that small differences in the initial value will cause large differences in future points of the orbit.\nWhen we observe the sky, the Sun, Moon, and stars appear to move from  east  to  west  because of the rotation of Earth (so-called  diurnal motion ). However,  orbiter s such as the  Space Shuttle  and many artificial  satellite s appear to move from west to east. These are direct satellites (they actually orbit Earth in the same direction as the Moon), but they orbit Earth faster than Earth itself rotates, and so appear to move in the opposite direction of the Moon.  Mars  has a natural satellite  Phobos , with a similar orbit. From the surface of Mars it appears to move in the opposite direction because its orbital period is less than a Martian day. There are also smaller numbers of truly retrograde artificial satellites orbiting Earth which counter-intuitively appear to move westward, in the same direction as the Moon.\nThe Small Magellanic Cloud contains a large and active population of  X-ray binaries . Recent star formation has led to a large population of massive stars and high-mass X-ray binaries (HMXBs) which are the relics of the short-lived upper end of the  initial mass function . The young stellar population and the majority of the known X-ray binaries are concentrated in the SMC’s Bar.HMXB pulsars are rotating neutron stars in binary systems with Be-type ( spectral type  09-B2,  luminosity class es V–III) or  supergiant  supergiant stellar companions. Most HMXBs are of the Be type which account for 70% in the Milky Way and 98% in the SMC (Coe et al. 2005). The Be-star equatorial disk provides a reservoir of matter that can be accreted onto the neutron star during  periastron  passage (most known systems have large orbital eccentricity) or during large-scale disk ejection episodes. This scenario leads to strings of X-ray outbursts with typical X-ray luminosities L = 10–10 erg/s, spaced at the orbital period, plus infrequent giant outbursts of greater duration and luminosity (see Negueruela 1998 for a review).\nTypically, satellites have a roughly  sinusoidal  ground track.  A satellite with an orbital  inclination  between zero and ninety degrees is said to be in what is called a direct or  prograde orbit , meaning that it orbits in the same direction as the Earth's rotation.  A satellite with an orbital inclination between 90° and 180° (or, equivalently, between -90° and 0°) is said to be in a  retrograde orbit . (Direct orbits are by far the most common for artificial satellites, as the initial velocity imparted by the Earth's rotation at launch reduces the  delta-v  needed to achieve orbit.)\nThe dark  C-type  asteroid orbits the Sun at a distance of 2.4–3.8  AU  once every 5 years and 5 months (1,989 days). Its orbit shows an  eccentricity  of 0.22 and is  tilted  by 22 degrees to the plane of the  ecliptic . It has a  rotation period  of 7.9 hours and an  albedo  between 0.06 and 0.08, based on the surveys carried out by the Infrared Astronomical Satellite,  IRAS , and the Japanese  Akari  satellite.\nHelin was active in planetary science and astronomy at the  California Institute of Technology  and the Jet Propulsion Laboratory for over three decades. In the early 1970s, she initiated the  Palomar Planet-Crossing Asteroid Survey  (PCAS) from  Palomar Observatory . This program is responsible for the discovery of thousands of asteroids of all types including more than 200 in high  inclination  orbits, other asteroids in rare and unique types of orbits, 20 comets, and approximately 30 percent of the  near-Earth asteroid s discovered worldwide.\nA geosynchronous satellite is a  satellite  in  geosynchronous orbit , with an orbital period the same as the Earth's rotation period. Such a satellite returns to the same position in the sky after each  sidereal day , and over the course of a day traces out a path in the sky that is typically some form of  analemma . A special case of geosynchronous satellite is the geostationary satellite, which has a  geostationary orbit  – a circular geosynchronous orbit directly above the Earth's equator. Another type of geosynchronous orbit used by satellites is the  Tundra elliptical orbit .\nAt the time of the fire there were four satellites in the constellation, all  US-K  in  molniya orbit s. The effect of the fire was that control was lost of the satellites for 12 hours. Satellites in molniya orbits need contact from the ground station every 2 or three orbits to maintain their orbital position. The fire caused the loss of four satellites - two satellites were lost immediately ( Kosmos 2340  and  Kosmos 2351 ) and two more ( Kosmos 2368  and  Kosmos 2342 ) within a year due to the negative effect on their orbits.\nA geostationary equatorial orbit (GEO) is a circular geosynchronous orbit in the plane of the Earth's equator with a radius of approximately  (measured from the center of the Earth). A satellite in such an orbit is at an altitude of approximately  above mean sea level. It maintains the same position relative to the Earth's surface. If one could see a satellite in geostationary orbit, it would appear to hover at the same point in the sky, i.e., not exhibit  diurnal motion , while the Sun, Moon, and stars would traverse the skies behind it. The theoretical basis for this novel phenomenon of the sky goes back to Newton's theory of motion and gravity. In that theory, the existence of a geostationary satellite is made possible because the Earth rotates (with respect to an inertial frame in which Newton's laws of motion and gravity hold). However, as a practical device, the geostationary satellite owes much for its realisation to  Arthur C. Clarke  who proposed it during the 20th century and in whose honour the orbit is called a Clarke orbit. Such orbits are useful for  telecommunications satellite s.\nThe natural satellites orbiting relatively close to the planet on  prograde , uninclined circular orbits ( regular satellites ) are generally thought to have been formed out of the same collapsing region of the  protoplanetary disk  that created its primary.  In contrast,  irregular satellite s (generally orbiting on distant,  inclined ,  eccentric  and/or  retrograde  orbits) are thought to be captured  asteroid s possibly further fragmented by collisions. Most of the major natural satellites of the  Solar System  have regular orbits, while most of the small natural satellites have irregular orbits. The  Moon  and possibly  Charon  are exceptions among large bodies in that they are thought to have originated by the collision of two large proto-planetary objects (see the  giant impact hypothesis ). The material that would have been placed in orbit around the central body is predicted to have reaccreted to form one or more orbiting natural satellites. As opposed to planetary-sized bodies,  asteroid moon s are thought to commonly form by this process. Triton is another exception; although large and in a close, circular orbit, its motion is retrograde and it is thought to be a captured  dwarf planet .\nThe weather satellite is a type of  satellite  that is primarily used to monitor the  weather  and  climate  of the  Earth .  Satellites can be  polar orbit ing, covering the entire Earth asynchronously, or  geostationary , hovering over the same spot on the equator.\nThe asteroid is classified as both,  C-type  and  X-type  on the  Tholen scheme . It is a member of the  Hungaria family , which form the innermost dense concentration of asteroids in the Solar System. The body orbits the Sun at a distance of 1.6–2.2  AU  once every 2 years and 8 months (964 days). Its orbit is  tilted  by 25 degrees to the plane of the  ecliptic  and shows an  eccentricity  of 0.15. Contrary to the expected low albedo for dark, carbonaceous CX-type asteroids, the Collaborative Asteroid Lightcurve Link (CALL) assumes a high  albedo  of 0.40 for the body. This is rather typical for the descendants of the  E-belt , a hypothesized population of primordial asteroids, from which the  E-type  Hungarian asteroids with high inclinations and a semi-major axis of 1.9 AU are thought to have originated.\n) is a measurement that is used most notably in  spaceflight . The beta angle determines the percentage of time an object such as a spacecraft in  low Earth orbit  (LEO) spends in direct sunlight, absorbing solar energy. Beta angle is defined as the angle between the  orbit al plane of the spacecraft and the  vector  to the  sun  (i.e., which direction the Sun is shining from). The beta angle is the smaller angle (there are two angles) between the Sun vector (where the Sun is shining from in the sky) and the  plane  of the object's orbit.  Note that the beta angle does not define a unique orbit plane; all satellites in orbit with a given beta angle at a given altitude have the same exposure to the Sun, even though they may be orbiting in completely different planes around the Earth. The beta angle varies between +90° and −90°, and the direction the satellite revolves around the body it orbits determines whether the beta angle sign is positive or negative.  An imaginary observer standing on the Sun defines a beta angle as positive if the satellite in question orbits in a counter clockwise direction and negative if it revolves clockwise. The maximum amount of time that a satellite in a normal low Earth orbit mission can spend in the Earth's shadow occurs at a beta angle of zero.  In such an orbit, the satellite is in sunlight no more than 59% of the time.\nA Resident Space Object (RSO) is a natural or artificial object that orbits another body e.g. Sun Orbiting, Earth Orbiting, Mars Orbiting etc. It is most often used to reference objects that are Earth orbiting. In the case of Earth orbiting the possible orbit classifications for an object are:  Low Earth orbit  (LEO),  Medium Earth orbit  (MEO),  High Earth orbit  (HEO) or   Geosynchronous Earth orbit  (GEO).\nA Molniya orbit (, \"Lightning\") is a type of  highly elliptical orbit  with an  inclination  of 63.4  degree s, an  argument of perigee  of −90 degrees and an  orbital period  of one half of a  sidereal day . Molniya orbits are named after a series of  Soviet / Russia n  Molniya   communications satellite s which have been using this type of orbit since the mid-1960s.\nThe space segment (SS) is composed of the orbiting GPS satellites, or Space Vehicles (SV) in GPS parlance. The GPS design originally called for 24 SVs, eight each in three approximately circular  orbits , but this was modified to six orbital planes with four satellites each. The six orbit planes have approximately 55°  inclination  (tilt relative to the Earth's  equator ) and are separated by 60°  right ascension  of the  ascending node  (angle along the equator from a reference point to the orbit's intersection). The orbital  period  is one-half a  sidereal day , i.e., 11 hours and 58 minutes so that the satellites pass over the same locations or almost the same locations every day. The orbits are arranged so that at least six satellites are always within  line of sight  from almost everywhere on the Earth's surface. The result of this objective is that the four satellites are not evenly spaced (90 degrees) apart within each orbit. In general terms, the angular difference between satellites in each orbit is 30, 105, 120, and 105 degrees apart, which sum to 360 degrees.\nSatellites are used for many purposes.  Common types include military and civilian  Earth observation satellite s,  communications satellite s,  navigation satellite s,  weather satellite s, and  space telescope s.   Space station s and human  spacecraft  in orbit are also satellites.  Satellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways.  Well-known (overlapping) classes include  low Earth orbit ,  polar orbit , and  geostationary orbit .\nA satellite system is a set of gravitationally bound objects in orbit around a  planetary mass object  or  minor planet . Generally speaking, it is a set of  natural satellites  (moons), although such systems may also consist of bodies such as circumplanetary disks,  ring systems ,  moonlet s,  minor-planet moon s and  artificial satellites  any of which may themselves have satellite systems of their own. Some bodies also possess  quasi-satellite s that have orbits gravitationally influenced by their primary, but are generally not considered to be part of a satellite system. Satellite systems can have complex interactions including magnetic, tidal, atmospheric and orbital interactions such as  orbital resonance s and  libration .  Individually major satellite objects are designated in Roman numerals.  Satellite systems are referred to either by the possessive adjectives of their primary (e.g. \"Jovian system\"), or less commonly by the name of their primary (e.g. \"Jupiter system\").  Where only one satellite is known, or it is a binary orbiting a common centre of gravity, it may be referred to using the hyphenated names of the primary and major satellite (e.g. the \"Earth-Moon system\").\n, an  asteroid  discovered on 27 April 2016, is possibly the most stable  quasi-satellite  of  Earth . As it orbits the Sun,  appears to circle around  Earth  as well. It is too distant to be a true  satellite  of Earth, but is the best and most stable example of a quasi-satellite, a type of  near-Earth object . They appear to orbit a point other than Earth itself, such as the orbital path of the NEO  asteroid   3753 Cruithne .  Earth trojan s, such as , are NEOs that orbit the Sun (not Earth) on the same orbital path as Earth, and appear to lead or follow Earth along the same orbital path.\nBefore entry, the meteoroid moved on an eccentric orbit, stretching from just inside the orbit of Jupiter to the orbit of Mercury. The orbit had a shallow inclination and an orbital period suggesting that this meteoroid originated in the 3:1 mean motion resonance with Jupiter. The CM chondrite  Maribo  moved on a similar orbit, but rotated by 120 degrees in the direction of the line of  apsides . The asteroid family that is the source region of CM chondrite-type meteorites is now thought to be located close to the 3:1 mean motion resonance, in low-inclined orbits, and may be the  Eulalia  asteroid family.\nA Sun-synchronous orbit (SSO, also called a heliosynchronous orbit) is a  geocentric orbit  that combines  altitude  and  inclination  in such a way that the satellite passes over any given point of the planet's surface at the same local  solar time . Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites. More technically, it is an orbit arranged in such a way that it  precesses  once a year.  The surface  illumination angle  will be nearly the same every time that the satellite is overhead.  This consistent lighting is a useful characteristic for  satellite s that image the Earth's surface in visible or infrared wavelengths (e.g. weather and spy satellites) and for other remote sensing satellites (e.g. those carrying ocean and atmospheric remote sensing instruments that require sunlight).  For example, a satellite in sun-synchronous orbit might ascend across the equator twelve times a day each time at approximately 15:00 mean local time. This is achieved by having the  osculating  orbital plane  precess  (rotate) approximately one degree each day with respect to the  celestial sphere , eastward, to keep pace with the Earth's movement around the  Sun .\nThere are two types of orbits:  closed (periodic) orbits, and open (escape) orbits. Circular and elliptical orbits are closed. Parabolic and hyperbolic orbits are open.  Radial orbits can be either open or closed.\nScience fiction  has often featured  planet s of binary or ternary stars as a setting, for example George Lucas'  Tatooine  from  Star Wars , and one notable story, \" Nightfall \", even takes this to a six-star system. In reality, some orbital ranges are impossible for dynamical reasons (the planet would be expelled from its orbit relatively quickly, being either ejected from the system altogether or transferred to a more inner or outer orbital range), whilst other orbits present serious challenges for eventual  biosphere s because of likely extreme variations in surface temperature during different parts of the orbit. Planets that orbit just one star in a binary system are said to have \"S-type\" orbits, whereas those that orbit around both stars have \"P-type\" or \" circumbinary \" orbits. It is estimated that 50–60% of binary systems are capable of supporting habitable terrestrial planets within stable orbital ranges.\nKridsadaporn is amongst another group of bodies [Mars-crossing (MC) and/or near-Earth object (NEO) populations] that may have originated from the  main asteroid belt  as fragments injected into a  mean-motion resonance  or  secular resonance , developing increasingly higher orbital eccentricity over time resulting in the  perihelion distance  becoming smaller than the  aphelion distances  of the  inner planets . At their birth, near-earth asteroids (NEAs) and MC orbits are in resonance, and when their orbital eccentricity becomes large enough, to the point that their orbits cross those of the inner planets, their orbits then become modified in a  random-walk fashion . This results in a complex interplay between planetary encounters and resonances which may lead to a range of unexpected outcomes including cometary-type orbits; solar collisions; or, eventual ejection from the  Solar System .\nThe name apogee engine derives from the type of manoeuvre for which the engine is typically used i.e. an in-space  delta-v  change made at the  apogee  of an elliptical orbit in order to circularise it. For  geostationary satellites , this type of  orbital manoeuvre  is performed to transition from a  geostationary transfer orbit  and place the satellite on station in a circular  geostationary orbit . Despite the name, an apogee engine can be used for a range of other manoeuvres such as end-of-life deorbit, earth orbit escape, planetary orbit insertion and planetary descent/ascent.\nFor specific types of orbits, words such as perihelion (for  Sun -centered orbits), perigee (for  Earth -centered orbits), periastron (for orbits around stars) and so on may replace the word periapsis.  See  apsis  for more information.\nThe Moon orbits the Earth, and the Earth orbits the Sun, and the Sun orbits the center of the Milky Way, which orbits within the Local Group, which is a part of the Virgo Supercluster. The motions of objects in the cosmos act like a set of Russian nesting dolls, with things orbiting things, which orbit other things.he Moon orbits the Earth, and the Earth orbits the Sun, and the Sun orbits the center of the Milky Way, which orbits within the Local Group, which is a part of the Virgo Supercluster. The motions of objects in the cosmos act like a set of Russian nesting dolls, with things orbiting things, which orbit other things.\nLikewise, the moon orbits Earth. Many artificial satellites also orbit Earth. When it comes to satellites, space engineers have different types of orbits to choose from. Satellites can orbit Earth's equator or go over Earth's North and South Poles . . . or anything in between. They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space. The choice of orbit all depends on the satellite's job.\nDepending on the job they have to do, we put satellites into different orbits. Some orbit the Sun, but most orbit the Earth. Three very useful types of orbit are a polar orbit, a geostationary orbit (GEO) and a low Earth orbit (LEO). These satellites are in orbit above the Earth's equator. They stay above the same location on Earth. They are used for telecommunications, television transmission and for navigation. Low Earth orbit (LEO) A satellite has a Low Earth Orbit when it orbits somewhere between 300 and 800 km above the Earth's surface. These satellites only take about 90 minutes to go around the Earth. They are ideal for making observations of the Earth's resources.\nSatellites, of course! Satellites are any objects that revolve around (orbit) another object in space. Some satellites are natural, while others are artificial (man-made). The moon is an example of a natural satellite that orbits the Earth. We're going to focus, though, on the man-made satellites. Artificial satellites are machines that humans launch into orbit, usually around the Earth. Artificial satellites can be sent to orbit other planets, too. For example, there are currently satellites orbiting the Moon, the Sun, and several other planets, including Mercury, Venus, Mars, and Saturn.\nSpace Science. ESA > Our Activities > Space Science. Types of orbit. Satellites in geostationary orbit. Spacecraft can be put into a number of different orbits or trajectories following launch, depending on their destination and the science goals of the mission. 1. Orbiting spacecraft.\nThere are essentially three types of Earth orbits: high Earth orbit, medium Earth orbit, and low Earth orbit. Many weather and some communications satellites tend to have a high Earth orbit, farthest away from the surface.nclination is the angle of the orbit in relation to Earthâ\u0080\u0099s equator. A satellite that orbits directly above the equator has zero inclination. If a satellite orbits from the north pole (geographic, not magnetic) to the south pole, its inclination is 90 degrees.\nSatellites are usually classified according to the type of orbit they are in. There are four types of orbit associated with satellites, and the type of orbit dictates a satellite's use.atellites are usually classified according to the type of orbit they are in. There are four types of orbit associated with satellites, and the type of orbit dictates a satellite's use.\nTypes of Orbits. What we have just described in the previous section is how a satellite orbits the Earth-it is just like the baseball that goes all the way around the Earth.e can use Kepler's third law to figure out how far out a satellite must be to spend all its time over one part of Earth. The answer is that a satellite has to be placed approximately 22,000 miles (36,000 km) away from the surface of the Earth in order to remain in a GEO orbit.\nSatellites move in a path around the Earth called an orbit. Every satellite must have an orbital path (remember, satellites that travel into deep space to look at distant planets are not true satellites, they are in fact space probes), and the type of path it takes is determined by the physics involved. satellite's orbit works because of a balance between two forces. The orbit is a combination of the satellite's velocity-the speed it is travelling in a straight line-and the force of the Earth's gravitational pull on the satellite.\nAnswered. In Technology.   It first depends on the type of orbit the satellite is in. If it is in a geostationary orbit, you can determine the speed by using the speed of the Earth's rotation at t â\u0080¦ he equator (465m/sec), because a geostationary satellite orbits above the equator at 22,300 miles above.nswered. In Technology.   It first depends on the type of orbit the satellite is in. If it is in a geostationary orbit, you can determine the speed by using the speed of the Earth's rotation at t â\u0080¦ he equator (465m/sec), because a geostationary satellite orbits above the equator at 22,300 miles above.\nThis type of orbit is ideal for many communications and weather satellites. A geostationary orbit has an altitude of 22,240 miles (35,790 km), which results in an orbital speed of 6,880 mph (11,070 km/h). We can also apply the same equation to the orbit of the Earth around the Sun.This orbit is also not a perfect circle, but is pretty close to get a good estimate of the Earth's orbital speed.his type of orbit is ideal for many communications and weather satellites. A geostationary orbit has an altitude of 22,240 miles (35,790 km), which results in an orbital speed of 6,880 mph (11,070 km/h). We can also apply the same equation to the orbit of the Earth around the Sun.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon. Sun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets' surface at the same local solar time. 2  Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.\nA special case of geosynchronous satellite is the geostationary satellite, which has a geostationary orbit â\u0080\u0093 a circular geosynchronous orbit directly above the Earth's equator. Another type of geosynchronous orbit used by satellites is the Tundra elliptical orbit.Geosynchronous satellites have the advantage of remaining permanently in the same area of the sky, as viewed from a particular location on Earth, and so permanently within view of a given ground station.f a geosynchronous satellite's orbit is not exactly aligned with the Earth's equator, the orbit is known as an inclined orbit. It will appear (when viewed by someone on the ground) to oscillate daily around a fixed point.\nGeostationary means that a satellite is orbiting the earth directly over the same place all the time. This type of satellite is usually used for communications satellites. Polar orbit means that a satellite orbits the earth over both poles as sweeps different parts of the planet on each orbit.This type of orbit is generally used by mapping satellites.t has to have zero inclination, which means the orbital path is directly over the equator all the time, and it has to be at just the right altitude so that the orbital period is 24 hours. This causes the satellite to hover over one spot on the Earth. Polar orbit has a 90 degree inclination and passes over the pole.\nSatellite orbits. There are a number of definitions associated with various different types of satellite orbits: 1  Geocentre: When satellites orbit the Earth, either in a circular or elliptical orbit, the satellite orbit forms a plane that passes through the centre of gravity or geocentre of the Earth.or a very low orbit of around 100 miles a velocity of about 17500 miles per hour is needed and this means that the satellite will orbit the Earth in about 90 minutes. At an altitude of 22 000 miles a velocity of just less than 7000 miles per hour is needed giving an orbit time of about 24 hours.\nThere are essentially three types of Earth orbits: high Earth orbit, medium Earth orbit, and low Earth orbit. Many weather and some communications satellites tend to have a high Earth orbit, farthest away from the surface. satellite that orbits directly above the equator has zero inclination. If a satellite orbits from the north pole (geographic, not magnetic) to the south pole, its inclination is 90 degrees. Orbital inclination is the angle between the plane of an orbit and the equator.\nSatellite Communications. Satellite Communications. Satellite communication refers to any communication link that involves the use of an artificial satellite in its propagation path. Satellite communications play a vital role in modern life. There are over 2000 artificial satellites in use.They can be found in geostationary, Molniya, elliptical, and low Earth orbits and are used for traditional point-to-point communications, mobile applications, and the distribution of TV and radio programs.atellite Communications. Satellite Communications. Satellite communication refers to any communication link that involves the use of an artificial satellite in its propagation path. Satellite communications play a vital role in modern life. There are over 2000 artificial satellites in use.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThere are essentially three types of Earth orbits: high Earth orbit, medium Earth orbit, and low Earth orbit. Many weather and some communications satellites tend to have a high Earth orbit, farthest away from the surface.Satellites that orbit in a medium (mid) Earth orbit include navigation and specialty satellites, designed to monitor a particular region.any weather and some communications satellites tend to have a high Earth orbit, farthest away from the surface. Satellites that orbit in a medium (mid) Earth orbit include navigation and specialty satellites, designed to monitor a particular region.\nAstronomers call this orbit eccentric because Pluto follows an orbit that traces out an elongated ellipse around the Sun. Plutoâ\u0080\u0099s orbit is also highly inclined. This means that it doesnâ\u0080\u0099t orbit within the same plane as the rest of the Solar System. Instead, Pluto orbits at an angle of 17-degrees.For part of its orbit, Pluto is above the plane of the ecliptic (where the other planets orbit) and other times itâ\u0080\u0099s below that plane.Because the orbit of Pluto varies so widely, it can switch places with Neptune, orbiting closer to the Sun.nstead, Pluto orbits at an angle of 17-degrees. For part of its orbit, Pluto is above the plane of the ecliptic (where the other planets orbit) and other times itâ\u0080\u0099s below that plane. Because the orbit of Pluto varies so widely, it can switch places with Neptune, orbiting closer to the Sun.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 1,459 artificial satellites orbiting the Earth.\nThere has been one known artificial satellite orbiting Mercury, known as Messenger.... The planet Mercury does not have any known moons (natural satellites) as of 2014. There has been one known artificial satellite orbiting Mercury, known as Messenger.... The planet Mercury does not have any known moons (natural satellites) as of 2014. There has been one known artificial satellite orbiting Mercury, known as Messenger. Messengerâ\u0080\u0099s mission to Mercury was launched on August 3, 2004 and began an orbit of Mercury in March 2011. In the 1970s, astronomers believed Mercury might have a moon based on large amounts of ultraviolet radiation detected by a National Aeronautics and Space Administration (NASA) spacecraft.\nThe different types of orbits are: 1)Low Earth Orbits:This orbit is high enough to miss all the mountains and also high enough that the atmospheric drag won't bring it right back to the surface. ISS follows a Low Earth Orbit. 2)Highly Elliptical Orbits: Perigee is the closest point and apogee is the farthest point from earth..\nOrbits 'R' Us! Orbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth. When it comes to satellites, space engineers have different types of orbits to choose from. Satellites can orbit Earth's equator or go over Earth's North and South Poles . . . or anything in between. They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space.\nNOAA's operational weather satellite system is composed of two types of satellites: geostationary operational environmental satellites (GOES) for short-range warning and now-casting and polar-orbiting satellites for longer-term forecasting.\nNOAA's operational environmental satellite system is composed of two types of satellites: geostationary operational environmental satellites (GOES) for short-range warning and now-casting, and polar-orbiting environmental satellites (POES) for longer-term forecasting.\nOrbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth.When it comes to satellites, space engineers have different types of orbits to choose from.rbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth.Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nView full size image. A satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth).There are dozens upon dozens of natural satellites in the solar system, with almost every planet having at least one moon.here are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth). There are dozens upon dozens of natural satellites in the solar system, with almost every planet having at least one moon.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.he first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\n1 Sun-synchronous orbit: An orbit which combines altitude and inclination in such a way that the satellite passes over any given point of the planets' surface at the same local solar time. 2  Such an orbit can place a satellite in constant sunlight and is useful for imaging, spy, and weather satellites.he first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nTYPES OF ORBITS, OR WHY SATELLITES ARE WHERE THEY ARE 31. Figure 5.1.The shaded disc is that portion of the orbital plane lying within an. inclined circular orbit. If the Earth did not rotate, the line where the shaded disc. meets the Earthâ\u0080\u0099s surface would be the ground track of the satellite.\n1 Synchronous orbit: An orbit where the satellite has an orbital period equal to the average rotational period (earth's is: 23 hours, 56 minutes, 4.091 seconds) of the body being orbited and in the same direction of rotation as that body. 2  To a ground observer such a satellite would trace an analemma (figure 8) in the sky.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nA satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth).ost satellites also work in this zone. Geostationary orbit is the best spot for communications satellites to use, however. This is a zone above Earth's equator at an altitude of 35,786 km (22,236 mi).\nFlying hundreds of kilometers above the Earth, the International Space Station and other orbiting satellites provide a unique perspective on our planet. (NASA Photograph S126-E-014918. ). There are essentially three types of Earth orbits: high Earth orbit, medium Earth orbit, and low Earth orbit.ost scientific satellites, including NASAâ\u0080\u0099s Earth Observing System fleet, have a low Earth orbit. One way of classifying orbits is by altitude. Low Earth orbit starts just above the top of the atmosphere, while high Earth orbit begins about one tenth of the way to the moon.\nMost scientific satellites, including NASAâ\u0080\u0099s Earth Observing System fleet, have a low Earth orbit. One way of classifying orbits is by altitude. Low Earth orbit starts just above the top of the atmosphere, while high Earth orbit begins about one tenth of the way to the moon.(NASA illustration by Robert Simmon). The height of the orbit, or distance between the satellite and Earthâ\u0080\u0099s surface, determines how quickly the satellite moves around the Earth.ost scientific satellites, including NASAâ\u0080\u0099s Earth Observing System fleet, have a low Earth orbit. One way of classifying orbits is by altitude. Low Earth orbit starts just above the top of the atmosphere, while high Earth orbit begins about one tenth of the way to the moon.\nSatellite orbits vary greatly, depending on the purpose of the satellite, and are classified in a number of ways. Well-known (overlapping) classes include low Earth orbit, polar orbit, and geostationary orbit. About 6,600 satellites have been launched.\nThe relative sizes and type of orbit are similar to the Plutoâ\u0080\u0093Charon system. In physics, an orbit is the gravitationally curved path of an object around a point in space, for example the orbit of a planet about a star or a natural satellite around a planet. Normally, orbit refers to a regularly repeating path around a body, although it may occasionally be used for a non recurring trajectory or a path around a point in space.\nThe relative sizes and type of orbit are similar to the Plutoâ\u0080\u0093Charon system. In physics, an orbit is the gravitationally curved path of an object about a point in space, for example the orbit of a planet about a star or a natural satellite around a planet. Orbits of planets are typically elliptical, and the central mass being orbited is at a focal point of the ellipse.\nOrbits 'R' Us! Orbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth. When it comes to satellites, space engineers have different types of orbits to choose from. Satellites can orbit Earth's equator or go over Earth's North and South Poles . . . or anything in between.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nThe weather satellite is a type of satellite that is primarily used to monitor the weather and climate of the Earth. Satellites can be polar orbiting, covering the entire Earth asynchronously, or geostationary, hovering over the same spot on the equator.Meteorological satellites see more than clouds and cloud systems.he weather satellite is a type of satellite that is primarily used to monitor the weather and climate of the Earth. Satellites can be polar orbiting, covering the entire Earth asynchronously, or geostationary, hovering over the same spot on the equator. Meteorological satellites see more than clouds and cloud systems.\nPlanets that orbit just one star in a binary system are said to have S-type orbits, whereas those that orbit around both stars have P-type or  circumbinary  orbits. It is estimated that 50â\u0080\u009360% of binary systems are capable of supporting habitable terrestrial planets within stable orbital ranges.\nCredit: NASA. A satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth). There are dozens upon dozens of natural satellites in the solar system, with almost every planet having at least one moon.\nThe elliptical orbit is often called the Highly Elliptical Orbit, HEO. As a result of this many satellites are placed in elliptical orbits, especially where certain attributes are required. For example it does not require the orbits to be equatorial like the geostationary orbit. This means that polar and high latitude areas can be covered with highly elliptical orbits, HEO. The satellite elliptical orbit gives a number of coverage options that are not available when circular orbits are used.\nLike the Earth, Jupiter was a planet with moons orbiting it. Galileo took the Jupiter system to be like a miniature solar system. These four satellites are called the Galilean satellites in honor of their discoverer. In order of increasing distance from Jupiter they are Io, Europa, Ganymede and Callisto.The largest of the Galilean satellites (and the largest moon in the solar system) is Ganymede. At 5262 km across, Ganymede is larger than Mercury but because Ganymede orbits a planet, it is classified as a moon. Ganymede orbits Jupiter in 7.15 days.ike the Earth, Jupiter was a planet with moons orbiting it. Galileo took the Jupiter system to be like a miniature solar system. These four satellites are called the Galilean satellites in honor of their discoverer. In order of increasing distance from Jupiter they are Io, Europa, Ganymede and Callisto.\nOrbits 'R' Us! When we talk about how Earth and the other planets travel around the Sun, we say they orbit the Sun. Likewise, the moon orbits Earth. Many artificial satellites also orbit Earth. When it comes to satellites, space engineers have different types of orbits to choose from.Satellites can orbit Earth's equator or go over Earth's North and South Poles. . . or anything in between.They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space. The choice of orbit all depends on the satellite's job.atellites can orbit Earth's equator or go over Earth's North and South Poles. . . or anything in between. They orbit at a low altitude of just a few hundred miles above Earth's surface or thousands of miles out in space. The choice of orbit all depends on the satellite's job.\nHow far up in space are satellites?   The altitude varies according to the type of satellite. * Low Earth Orbit satellites are up to 1240 miles or 2000km high. * Medium Earth Orbit satellites fit betweenâ\u0080¦ the Low and High Earth Orbit satellite altitudes. * High Earth Orbit satellites above 22240 miles or 35786 km.\nA satellite is an object in space that orbits or circles around a bigger object. There are two kinds of satellites: natural (such as the moon orbiting the Earth) or artificial (such as the International Space Station orbiting the Earth).\nLet's start at the left-hand side. On this particular diagram, planets, like Neptune, have nearly circular orbits (little change in range from the Sun) with low inclination. So Neptune's orbit makes a very short, thick, black slash near 30 AU. Kuiper belt objects usually have elliptical orbits with higher inclinations. More vertical loops indicate more circular orbits. Shorter loops indicate less-inclined orbits. The most up-and-down and least-tall of the loops are for Quaoar and Varuna. These are classical Kuiper belt objects, with nearly circular orbits ranging from 40-45 AU. They're doing their own thing, with, apparently, little influence from Neptune. All the other bodies on this diagram are in various orbital resonances with Neptune.\nThere are 4 types of orbits, they are: 1. GEO (Geo-stationary earth orbit) 2. MEO (medium earth orbit) 3. LEO (Low earth orbit) and. 4. HEO (Highly elliptical orbit)\nMEO satellite (medium earth orbit satellite) A medium earth orbit (MEO) satellite is one with an orbit within the range from a few hundred miles to a few thousand miles above the earth's surface. Satellites of this type orbit higher than low earth orbit (LEO) satellites, but lower than geostationary satellites. Download this free guide.\nFlying hundreds of kilometers above the Earth, the International Space Station and other orbiting satellites provide a unique perspective on our planet. (NASA Photograph S126-E-014918.) There are essentially three types of Earth orbits: high Earth orbit, medium Earth orbit, and low Earth orbit.\nGeostationary orbit basics. As the height of a satellite increases, so the time for the satellite to orbit increases. At a height of 35790 km, it takes 24 hours for the satellite to orbit.This type of orbit is known as a geosynchronous orbit, i.e. it is synchronized with the Earth.eostationary orbit basics. As the height of a satellite increases, so the time for the satellite to orbit increases. At a height of 35790 km, it takes 24 hours for the satellite to orbit.\nA satellite with an orbital inclination between zero and ninety degrees is said to be in what is called a direct or prograde orbit, meaning that it orbits in the same direction as the Earth's rotation. A satellite with an orbital inclination between 90 and 180 degrees is said to be in a retrograde orbit. satellite with an orbital inclination between zero and ninety degrees is said to be in what is called a direct or prograde orbit, meaning that it orbits in the same direction as the Earth's rotation. A satellite with an orbital inclination between 90 and 180 degrees is said to be in a retrograde orbit.\nA special case of geosynchronous satellite is the geostationary satellite, which has a geostationary orbit â\u0080\u0093 a circular geosynchronous orbit directly above the Earth's equator. Another type of geosynchronous orbit used by satellites is the Tundra elliptical orbit.f a geosynchronous satellite's orbit is not exactly aligned with the Earth's equator, the orbit is known as an inclined orbit. It will appear (when viewed by someone on the ground) to oscillate daily around a fixed point.\n- notes and details about satellite orbits: the basics; different types of satellite orbit; & satellite orbit definitions. There are many different satellite orbits that can be used. The ones that receive the most attention are the geostationary orbit used as they are stationary above a particular point on the Earth.\nCircular and elliptical orbit definitions. A satellites orbit the Earth in one of two basic types of orbit. Circular satellite orbit: For a circular orbit, the distance from the Earth remains the same at all times. Elliptical satellite orbit: The elliptical orbit changes the distance to the Earth.\nThese objects are sometimes called celestial bodies, and they are constantly moving, too. At the center of it all is the Sun. It takes the Sun 25 days to spin, or rotate, completely around. The Earth, which is the third planet from the Sun, takes 24 hours to rotate.This is what causes day and night. As the Earth rotates, it also moves, or revolves, around the Sun. The Earths path around the Sun is called its orbit. It takes the Earth one year, or 365 1/4 days, to completely orbit the Sun.As the Earth orbits the Sun, the Moon orbits the Earth. The Moons orbit lasts 27 1/2 days, but because the Earth keeps moving, it takes the Moon two extra days, 29 1/2, to come back to the same place in our sky.t takes the Earth one year, or 365 1/4 days, to completely orbit the Sun. As the Earth orbits the Sun, the Moon orbits the Earth. The Moons orbit lasts 27 1/2 days, but because the Earth keeps moving, it takes the Moon two extra days, 29 1/2, to come back to the same place in our sky.\nA satelliteâ\u0080\u0099s orbit depends on its speed and distance from Earth. Below, the main orbit types are listed and defined. 1. LEO (Low Earth Orbit) - When a satellite circles close to Earth, itâ\u0080\u0099s in Low Earth Orbit. Satellites in LEO are just 200-300 miles high. Because they orbit so close to the Earth, they must travel very fast (17,000 mph) so the gravity canâ\u0080\u0099t pull them back into the Earthâ\u0080\u0099s atmosphere. a. Polar orbit-A satellite in polar orbit travels a north-south direction.", "key": "50_2", "timestamp": "2020-06-23 21:18:59.099358", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}