{"input_text": "Pinnipeds themselves are subject to predation. Most species are preyed on by the  killer whale  or orca. To subdue and kill seals, orcas continuously ram them with their heads, slap them with their tails and fling them in the air. They are typically hunted by groups of 10 or fewer whales, but they are occasionally hunted by larger groups or by lone individuals. Pups are more commonly taken by orcas, but adults can be targeted as well. Large  shark s are another major predator of pinnipeds—usually the  great white shark  but also the  tiger shark  and  mako shark . Sharks usually attack by ambushing them from below. The prey usually escapes, and seals are often seen with shark-inflicted wounds. Otariids typically have injuries in the hindquarters, while phocids usually have injuries on the forequarters.\nShortfin mako sharks over  have interior teeth considerably wider and flatter than smaller makos, which enables them to prey effectively upon  dolphin s,  swordfish , and other sharks. An amateur videotape, taken in Pacific waters, shows a moribund  pantropical spotted dolphin  whose tail was almost completely severed being circled by a shortfin mako. Makos also tend to scavenge long-lined and netted fish.\nSea lions are preyed on by  killer whale s and large  shark s. At  Monterey Bay , California sea lions appear to be the more common food items for transient mammal-eating killer whale pods. The sea lions may respond to the dorsal fin of a killer whale and remain vigilant, even when encountering resident fish-eating pods. Sea lions are also common prey for  white sharks . They have been found with scars made by attacks from both white sharks and  shortfin mako shark s. Sharks attack sea lions by ambushing them while they are resting at the surface. Sea lions that are attacked in the hindquarters are more likely to survive and make it to the shore.\nSome species of fish are  viviparous . In such species the mother retains the eggs and nourishes the embryos. Typically, viviparous fish have a structure analogous to the  placenta  seen in  mammals  connecting the mother's blood supply with that of the embryo. Examples of viviparous fish include the  surf-perches ,  splitfins , and  lemon shark . Some viviparous fish exhibit  oophagy , in which the developing embryos eat other eggs produced by the mother. This has been observed primarily among sharks, such as the  shortfin mako  and  porbeagle , but is known for a few bony fish as well, such as the  halfbeak  Nomorhamphus ebrardtii.  Intrauterine cannibalism  is an even more unusual mode of vivipary, in which the largest embryos eat weaker and smaller siblings. This behavior is also most commonly found among sharks, such as the  grey nurse shark , but has also been reported for Nomorhamphus ebrardtii.\nApex predators, such as  orca s, which can consume seals, and  shortfin mako shark s, which can consume swordfish, make up the fifth trophic level.  Baleen whale s can consume zooplankton and krill directly, leading to a food chain with only three or four trophic levels.\nLongfin mako sharks are  predator s that feed on small  schooling   bony fish es and  cephalopod s. Whether this shark is capable of elevating its body temperature above that of the surrounding water like the other members of its family is uncertain, though it possesses the requisite physiological adaptations. Reproduction in this species is  aplacental viviparous , meaning the  embryo s hatch from eggs inside the  uterus . In the later stages of development, the unborn young are fed nonviable eggs by the mother ( oophagy ). The litter size is typically two, but may be as many as eight. The longfin mako is of limited  commercial value , as its meat and fins are of lower quality than those of other pelagic sharks; it is caught unintentionally in low numbers across its range. The  International Union for Conservation of Nature   has assessed this species as  vulnerable  due to its rarity, low reproductive rate, and continuing  bycatch  mortality.\nThe shortfin mako shark feeds mainly upon  cephalopods  and bony fish including  mackerel s,  tuna s,  bonito s, and  swordfish , but it may also eat other sharks,  porpoise s,  sea turtle s, and  seabirds . They hunt by lunging vertically up and tearing off chunks of their preys' flanks and fins. Makos swim below their prey, so they can see what is above and have a high probability of reaching prey before it notices. In Ganzirri and Isola Lipari,  Sicily , shortfin makos have been found with  amputated   swordfish  bills impaled into their head and gills, suggesting swordfish seriously injure and likely kill them. In addition, this location, and the late spring and early summer timing, corresponding to the swordfish's  spawning  cycle, suggests they hunt while the swordfish are most vulnerable, typical of many predators.\nShortfin mako sharks consume 3% of their weight each day and take about 1.5–2.0 days to digest an average-sized meal. By comparison, the  sandbar shark , an inactive species, consumes 0.6% of its weight a day and takes 3 to 4 days to digest it. An analysis of the stomach contents of 399 male and female mako sharks ranging from  suggest makos from  Cape Hatteras  to the  Grand Banks  prefer  bluefish , constituting 77.5% of their diet by volume. The average capacity of the stomach was 10% of the total weight. Shortfin mako sharks consumed 4.3% to 14.5% of the available bluefish between  Cape Hatteras  and  Georges Bank .\nThe longfin mako has large eyes and is attracted to cyalume sticks (chemical lights), implying that it is a visual hunter. Its diet consists mainly of small, schooling bony fishes and squids. In October 1972, a 3.4-m-long female with the broken bill from a  swordfish  (Xiphius gladias) lodged in her abdomen was caught in the northeastern Indian Ocean; whether the shark was preying on swordfish as the shortfin mako does, or encountered the swordfish in some other aggressive context is not known. Adult longfin makos likely have no natural predators, while young individuals may fall prey to larger sharks.\nAnswer: In a race among the sharks, the shortfin mako shark (Isurus oxyrinchus) would be the winner. The robust, streamlined shortfin mako shark is reported to have been clocked at 22 mph, although some sources say it can reach up to 60 mph.This may be because it is capable of chasing even quicker fish, the sailfish and swordfish, which can reach speeds over 60 mph (when leaping).The mako can also perform giant leaps of up to 20 feet out of the water. Sources: 1  R. Aidan Martin.he robust, streamlined shortfin mako shark is reported to have been clocked at 22 mph, although some sources say it can reach up to 60 mph.\nshark week the fastest shark in the ocean the shortfin mako shark is the fastest shark in the ocean this toothy torpedo can swim at speeds of up to 60 mph has a tail like a tuna fish its favorite prey01 58he shortfin mako shark is the fastest shark in the ocean this toothy torpedo can swim at speeds of up to 60 mph has a tail like a tuna fish its favorite prey 01 58\nanswer in a race among the sharks the shortfin mako shark isurus oxyrinchus would be the winner the robust streamlined shortfin mako shark is reported to have been clocked at 22 mph although some sources say it can reach up to 60 mphthis may be because it is capable of chasing even quicker fish the sailfish and swordfish which can reach speeds over 60 mph when leapinghe robust streamlined shortfin mako shark is reported to have been clocked at 22 mph although some sources say it can reach up to 60 mph this may be because it is capable of chasing even quicker fish the sailfish and swordfish which can reach speeds over 60 mph when leaping\nLongfin mako sharks, Isurus paucus, likely feed on pelagic squids and schooling fishes. The diet of shortfin makos is relatively well known and includes a wide variety of teleosts (bony fishes) and cephalopods.\nBlue sharks eat a significant amount of squid, while tiger sharks are known to eat sea turtles. Smooth dogfish sharks eat crabs and lobsters, and hammerhead sharks prefer stingrays. Some sharks that are quick and large enough also hunt sea mammals. Great white sharks, tiger sharks and mako sharks have been known to eat sea lions, seals, dolphins, porpoises and sea birds. They also prey on large fish like mackerel and tuna. The largest shark, the whale shark, doesn't hunt for its food.\n2.5 - 4.2 m (8 - 13 feet) Shortfin Makos are slightly smaller than Longfin makos. The largest Longfin mako accurately measured had a length of 13.7 feet. Diet: Fish. The diet of a Mako shark is almost entirely fish, smaller sharks, and sometimes squid.\n1. Shark. This means any type of meat eating shark such as Longfin Mako, Shortfin Mako, Blacktip, or common Thresher shark. Because sharks are at or near the top of the food chain, they consume other types of fish as their main source of food.", "key": "32_10", "timestamp": "2020-06-23 21:18:59.000124", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}