{"input_text": "The business model of GameFly is similar to the  DVD-by-mail  subscription service  Netflix  and  Blockbuster online . GameFly sends games to subscribers for a monthly fee. Over 8,000 titles are available.\nNetflix , an online  movie streaming  website founded in 1997, is an example of how an online business has affected a B&M businesses such as  video rental store s. After Netflix and similar companies became popular, traditional DVD rental stores such as  Blockbuster LLC  went out of business. Customers preferred to be able to instantly watch movies and TV shows using \"streaming\", without having to go to a physical rental store to rent a DVD, and then return to the store to give the DVD back. \"The rapid rise of  online film streaming  offered by the likes of  Lovefilm  and Netflix made Blockbuster's video and DVD [rental] business model practically obsolete.' There has been an increase in online retailers in the 2000s, as people are using  e-commerce  (online sales) to fulfill basic needs ranging from grocery shopping to book purchases. Sales through mobile devices such as  tablet computer s and  smartphone s have also risen in the 2000s: \"While total online sales rose 18% year-on-year in December to £11.1 [B], according to the latest figures [January 2014] from e-tail industry body IMRG and advisory firm Capgemini, sales via mobile devices doubled to £3 [B].'\nIn fall 2006, Blockbuster signed a deal with The Weinstein Company that gave it the exclusive rental rights to the studio's films beginning on January 1, 2007. This agreement forced Netflix to obtain copies from mass merchants or retailers, instead of directly from the studio. Netflix has speculated that the effect of the Blockbuster-Weinstein agreement could result in higher rental costs and/or fewer copies of the studio's movies, which would limit the number of each movie's DVDs that would be available to subscribers at any one time. , Netflix continues to make available Weinstein movies, including  Unknown ,  School For Scoundrels  and  Harsh Times , among others. The  first-sale doctrine  allows Netflix and other video rental businesses to offer movies released by The Weinstein Company.\nThe company had utilized company-owned distribution facilities, in addition to claiming a nationwide network of independent video retailers (IVRs) to service both pay-per-rental and subscription customers. While in business, its main competitors were  Netflix.com  and  Blockbuster.com . Intelliflix gained notoriety by being the only major DVD-rental company that offered  adult movies  and game rentals in the same subscription.\nBlockbuster Video  entered the United States online market in August 2004, with a US$19.95 monthly subscription service. This sparked a  price war ; Netflix had raised its popular three-disc plan from US$19.95 to US$21.99 just prior to Blockbuster's launch, but by October, Netflix reduced this fee to US$17.99. Blockbuster responded with rates as low as US$14.99 for a time, but, by August 2005, both companies settled at identical rates. On July 22, 2007, Netflix dropped the prices of its two most popular plans by US$1.00 in an effort to better compete with Blockbuster's online-only offerings. On October 4, 2012,  Dish Network  scrapped plans to make Blockbuster into a Netflix competitor. (Dish bought the ailing Blockbuster, LLC in 2011 and will continue to license the brand name to franchise locations, and keep its \"Blockbuster on Demand\" video streaming service open.)\nIn 2000, Netflix offered to be acquired by  Blockbuster  for $50 million, but the offer was declined. Netflix initiated an  initial public offering  (IPO) on May 29, 2002, selling 5.5 million shares of  common stock  at the price of  US$ 15.00 per share. On June 14, 2002, the company sold an additional 825,000 shares of common stock at the same price. After incurring substantial losses during its first few years, Netflix posted its first profit during fiscal year 2003, earning US$6.5 million profit on revenues of US$272 million. In 2005, 35,000 different film titles were available, and Netflix shipped 1 million DVDs out every day.\nAs of April 2010, the movie is available on DVD at  Blockbuster Video ,  Redbox  and  Netflix .\nOn August 11, 2004, Blockbuster introduced a  DVD-by-mail  service in the U.S. to compete with the established market leader,  Netflix .\nNetflix  ended 2008 with 9.39 million customers.   Blockbuster Video  claimed 1 million online customers in August 2005, 2 million by March 2006, and finished the first quarter of 2007 with 3 million. There are no recent published numbers for Blockbuster Online since 2007.  Walmart  briefly entered the market as well, but withdrew in 2005 and now has a cross-promotional agreement with  Netflix .\nBlockbuster has been the exclusive rental chain for  The Weinstein Company  movies since January 1, 2007, although due to the  First Sale Doctrine , other rental stores and online DVD rental-by-mail companies, like  Netflix , could still rent DVDs released by The Weinstein Company.\nPachter has also commented on the entertainment industry more generally.  In 2005, he recommended selling Netflix stock and buying Blockbuster stock, predicting that Blockbuster would hold the video-on-demand market.\nThe standard business model for video rental stores had traditionally been to pay a large flat fee per video, approximately $65, and offer unlimited rentals for the lifetime of the medium itself.  Sumner Redstone , whose Viacom conglomerate then owned Blockbuster, personally pioneered a new revenue-sharing arrangement for video in the mid-1980s. Blockbuster obtained videos for little cost and kept a 60 percent rental fee, paying the other 40 percent to the studio, and reporting rental information through  Rentrak . In addition to benefiting from a lower initial price, Blockbuster also capitalized on the fact that movies were generally not available for purchase at affordable price points during initial release periods. Thus customers had a choice to rent, wait, or buy the film on tape at the much higher  Manufacturer's Suggested Retail Price  targeted at other rental chains and film enthusiasts, which at that time ranged between $70–$100 per title.\nAmong other growth techniques, Michalowicz argues the leap frogging strategy of significantly pushing ahead in one \"area of innovation\", either price, convenience or quality.  Michalowicz shows examples of this, including the rise and fall of  Blockbuster ,  Netflix  and  Redbox .\nIn March 2013, Franchise Entertainment Group's CEO, Paul Uniacke told  Sunshine Coast Daily  in response to a local  Maroochydore  outlet closing that, \"I'm not happy that Maroochydore has gone. It's not something we like to see, absolutely there is a human cost to what's happening here.\" He went on to add, \"the worst thing that happens in a  rationalisation  is losing stores and losing good people. We've been up on the Coast with Blockbuster for a number of years and with Video Ezy for about 20 years.\" Uniacke said that Video Ezy/Blockbuster was not alone in facing Australian post- Global Financial Crisis  retail conditions, leaving Video Ezy Express rental kiosks to fill the void left by closed stores. He said, \"but mark my words, you will see us back in a short space of time. We don't want to leave that territory without the brand too long, we want to stay strong.\" Adding, \"and they are lined up out the door to run kiosks in there, so you will see Blockbuster, or maybe Video Ezy kiosks flowing through there.\" But in the same interview he admitted, \"absolutely we will have less stores, but I don't want to do away with them because they form a valuable part of the business.\"\nIn March 2010, Blockbuster announced that it intended to sell all operations in Europe.  The company once had an Irish subsidiary,  Xtravision , which did not operate under the Blockbuster  brand name . Blockbuster sold Xtravision at a loss in August 2009 to Birchhall Investments Limited.\nDish Network put its Blockbuster acquisition to work by making available Dish Movie Pack for Dish Network subscribers and  Sling TV  for non-Dish Network subscribers. Blockbuster also has agreements that allow it to receive movies 28 days before  Netflix  and  Redbox  which could encourage customers to use these services.\n\"Many of you have asked about the return of “Zane’s Sex Chronicles” on Cinemax for a third season and I realize that a lot of you ordered the channel just for me. Again, I appreciate you. I wanted to let you know that there will not be a third season. Also, the second season is not scheduled to be released on DVD at this time. But, you can still purchase the first season on Amazon.com or rent it from Blockbuster or NetFlix. For those of you who got really caught up in the characters, there is a tie-in book for the series that digs deeper into their backgrounds and relationships. It is entitled “Zane’s Sex Chronicles,” exactly like the show.\"\nAs well as discovery, the Jinni website included  Internet television , the  online streaming  of film and TV, mostly only available in the US, e.g. via  Hulu . Jinni also linked to other sites that rent or sell  DVDs  or offer downloading or streaming for a fee, such as  Netflix ,  Amazon  and  Blockbuster .\nThe company surpassed  Blockbuster  in 2007 in number of U.S. locations, passed 100 million rentals in February 2008, and passed 1 billion rentals in September 2010.  Competitors include  Netflix  and  Blockbuster . In Q2 2011, kiosks accounted for 36 percent of the disc rental market, with 38 percent of that attributable to rent-by-mail services and 25 percent to traditional stores, according to the  NPD Group . As of Q2 2011, 68 percent of the U.S. population lived within a five-minute drive of a Redbox kiosk. The numbers for Q2 2013 shows that the Redbox rentals had surpassed 50 percent of the total disc rentals in the country.\nBlockbuster's U.S. online operation started with around 10 warehouses; further expansions every year brought that number to 41, plus more than 1400 stores in the Blockbuster Online network. Most Blockbuster independent franchises did not honor the Total Access program. The company had 1.5 million subscribers at the end of the third quarter of 2006. Blockbuster's move to follow the business pattern with its online rentals as was established by Netflix prompted Netflix to sue Blockbuster for patent infringement. Blockbuster counter sued with a counterclaim alleging deceptive practices with its patent which it alleged was designed to maintain an illegal monopoly. The suits were eventually settled, and while the terms were not disclosed it was later reported that Netflix recorded a settlement payment from Blockbuster of $4.1 million in the second quarter of 2007.\nNetflix and Blockbuster largely avoid offering  pornography , but several \"adult video\" subscription services were inspired by Netflix, such as  SugarDVD  and  WantedList .\nOn April 4, 2006, Netflix filed a  patent infringement  lawsuit in which it demanded a  jury trial  in the  United States District Court for the Northern District of California , alleging that Blockbuster's  online DVD rental  subscription program violated two patents held by Netflix. The first  cause of action  alleged Blockbuster's infringement of U.S. Patent No. 7,024,381 (issued April 4, 2006; only hours before the lawsuit was filed) by copying the \"dynamic queue\" of DVDs available for each customer, Netflix's method of using the ranked preferences in the queue to send DVDs to subscribers, and Netflix's method permitting the queue to be updated and reordered. The second cause of action alleged infringement of Patent No. 6,584,450 (issued June 24, 2003), which covers in less detail the subscription rental service as well as Netflix's methods of communication and delivery. The dispute ended a year later, on June 25, 2007, with both companies declining to disclose the terms of their legal settlement, except for a statement by Blockbuster that it would not have a major impact on its future financial performance. Blockbuster also said that the company planned to close 282 stores that year to shift focus to its online service. The company had already closed 290 stores in 2006.\nDuring a company-wide conference call on April 30, 2010, it was announced that all U.S. Hollywood Video, Movie Gallery, and GameCrazy stores would file for  Chapter 7 bankruptcy  in May 2010 and wind down business. Analysts generally believe that Movie Gallery & Hollywood Video's unprofitability, caused by competition from  Blockbuster Inc.  and online retailers such as  Netflix  and  Redbox , was one of the major factors in the company's decision to close the retail chain.\nOn August 26, 2010, news media reported that Blockbuster was planning to file a pre-packaged Chapter 11 bankruptcy in mid-September. In light of this news, the company's chief financial officer (CFO), Tom Casey, resigned on September 11. He was replaced by Dennis McGill, formerly CFO of Safety-Kleen Systems, Inc. On September 23, 2010, Blockbuster filed for  Chapter 11 bankruptcy protection  due to challenging losses, $900 million in debt and strong competition from  Netflix ,  Redbox , and  video on-demand services.  Movie Gallery/Hollywood Video  had filed for  Chapter 7 bankruptcy liquidation  earlier in 2010 for similar reasons.\nBlockbuster LLC (formerly Blockbuster Entertainment, Inc.), known as Blockbuster, was an American-based provider of home movie and video game rental services through  video rental shop s,  DVD-by-mail ,  streaming ,  video on demand , and cinema theater. At its peak in 2004, Blockbuster consisted of nearly 60,000 employees and over 8,000 stores. As a result of various factors including competition from  Netflix ,  Redbox , and  video on demand  services, Blockbuster lost significant revenue and filed for bankruptcy protection on September 23, 2010.  On April 6, 2011, the company and its remaining 1,700 stores were bought by satellite television provider  Dish Network .  While the Blockbuster brand has mostly been retired, Dish still maintains some Blockbuster franchise agreements, with approximately 12 stores remaining.\nNetflix's streaming catalog is not as large as Netflix's disc catalog, and it does not include immediate access to new, big-ticket home-video releases that you can rent through pay-per-use services like Redbox, Blockbuster, iTunes, and VUDU.\nBlockbuster's CEO once passed up a chance to buy Netflix for only $50 million. 1  Jul.  That's because back in 2000, Reed Hastings approached former Blockbuster CEO John Antioco and asked for $50 million to give away the company he founded â\u0080\u0094 Netflix.\nThe answers to those two questions are yes and no. Netflix is often credited for killing the video rental store business model. With the recent bankruptcy of BlockBuster Video, the biggest rental organization in the world at one time, that claim seems reasonable. Now it's girding itself to become a dominant player online.\nHereâ\u0080\u0099s the real story: in 2006 and 2007, Blockbuster had Netflix on the ropes and Netflix CEO Reed Hastings was asking them to acquire his company. No, Blockbuster didnâ\u0080\u0099t fail because of the competition; it failed because of boardroom infighting and one of the most disastrous CEO changes in American business history. At a conference call with analysts in 2007, Netflix CEO Reed Hastings mentioned Blockbuster 22 times. He admitted they had not yet formulated a plan to stop Blockbuster stealing their customers at the rate of a million a year. He said Blockbuster had thrown everything at them but the kitchen sink.\nNetFlixNetFlix invented the online dvd rental service back in 1999 and is still the leader. But Intelliflix is blazing new trails by offering over 60,000 Movies and Video Game rentals with annual plans starting at half the price of any other dvd rental service. BlockBuster is now agressively trying to take customers away from NetFlix with lower pricing and by leveraging their 4500 retail stores.\nWe chose Netflix for its convenience and variety of features. The main competitors fall in 3 categories: brick and mortar video rental stores (BlockBuster and Hollywood Video), online video rentals (BlockBuster Total Access), and one day DVD rentals from a kiosk (like RedBox and BlockBuster).nline video streaming and other Netflix features. Netflix offers several price options, all but one of which are unlimited plans, which offer you unlimited DVDs sent to your home and unlimited online movie rentals via streaming.\nAssessment of cost function estimation methods by using the attached Netflix and Blockbuster Financial Data spreadsheet (attached) to develop cost function estimates for both Netflix and Blockbuster using the following methods: - Account classification. - High-low. - Regression analysis methods.\nEstimating Cost Functions for Blockbuster and Netflix. ... (0.07) 0.01 Estimating Cost Functions for Blockbuster and Netflix Assessment of. cost function estimation methods by using the attatched Netflix and Blockbuster ...\nDevelop cost function estimates for Netflix and Blockbuster using : Account classification. High-low. Regression analysis methods.\nWith Blockbuster's movie cache now in Dish's cellar and Blockbuster already having a video streaming service, Dish can make up some ground on Netflix. If Dish can properly combine Blockbuster's on demand service with Dish Network's existing service, we may see customers switch over to Dish. However, once again, the problem comes back to pricing. Will Dish be able to offer the same, or better prices compared with Netflix?\nDish Network Corp., which acquired Blockbuster in 2011, announced that it will be closing all of the remaining 300 Blockbuster retail stores in the U.S. by early-January 2014.In January of 2013, Blockbuster took the first steps in the process when it shut down 300 stores nationwide.hysical media has been replaced by Internet streaming services, including Netflix and Hulu, or cable video on-demand services. However, Clayton said Blockbuster as a brand isn't dead and will live on in just the sort of digital business that has put the stores and DVD mail service out of business.\nBlockbuster was caught flat-footed by many of these changes. It could have purchased Netflix for $50 million in 2000, but passed. As Netflix rose, Blockbuster's attempts to compete on Netflix's terms -- especially through the mail -- foundered.he action was long expected. Blockbuster had been closing stores for years, as is obvious from the yawning vacancies still present in many of those very same strip malls. The chain was done in by Netflix, streaming video and a world of Internet options. Reaction from that Internet was, of course, swift and pithy.\nBlockbuster lost $13 million last quarter. When Blockbuster declared bankruptcy in 2010, Dish Network swooped in within a year to acquire the video rental chain for $320 million. The plan was that by using the footprint of those stores, Dish could sell mobile devices to stream Blockbuster movies.ish Network, Blockbuster's parent company, has given up on trying to take out Netflix or any of its video rental rivals. jlmaral. Growing up, Blockbuster was the place to go to get videos. When I was a kid, weâ\u0080\u0099d drive down to the now-shuttered big, bright corner store in Santa Monica to pick out movies to watch.\nDIRECTV. just ask. reliable service. DIRECTV â\u0080¢ 2 answers. Try connecting ur receiver to an inthernet connection then, go to directv app store and look for the netflix app. But, directv has not joing netflix, blockbuster or redbox.Only dish network has the capability to do with blockbuster and only because they own it.IRECTV. just ask. reliable service. DIRECTV â\u0080¢ 2 answers. Try connecting ur receiver to an inthernet connection then, go to directv app store and look for the netflix app. But, directv has not joing netflix, blockbuster or redbox.\nOver 3,000 Blockbuster employees will be laid off as a result of the store closings. Blockbuster began shutting down some of its stores as early as 2009, losing customers to Netflix's DVD-by-mail service and other online video streaming services, such as iTunes.\nIn 2012, Blockbuster began offering DVD-by-mail services and video streaming on its website. However, in an interview with Bloomberg in October 2012, Dish CEO Charlie Bergen said the company would abandon its plans to compete head-to-head with Netflix.\nThe Brain Behind Netflix. The way Americans watch movies has changed dramatically in the last few years because of the man who thought up, and started up a company called Netflix. Now more and more of us rent movies by mail. As correspondent Lesley Stahl reports, Netflix today rakes in about $50 million a month and other companies, like Blockbuster, are trying to get in on the action. Netflix was started by a math teacher-turned-software tycoon.", "key": "49_3", "timestamp": "2020-06-23 21:18:59.083574", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}