{"input_text": "Best and worst time to go to Washington, D.C. The best time to visit Washington, D.C., is in September after Labor Day, as both temperatures and tourist crowds decrease from their respective summer peaks.\nBest Times to Visit Washington D.C. The best times to visit Washington, D.C., are from September to November and March to May. In the autumn, the sweltering summer is gone, taking with it most of the high-season tourists. All that's left are crisp breezes and changing leaves, which, by the way, look great against all those marble monuments.\nShare: Facebook Tweet Google+. The best times to visit Washington, D.C., are from September to November and March to May. In the autumn, the sweltering summer is gone, taking with it most of the high-season tourists.\nThe Lincoln Memorial Reflecting Pool with the Washington Monument reflected in and rising above it in the late afternoon. The Lincoln Memorial Reflecting Pool seen from the Lincoln Memorial. Ice covering the Lincoln Memorial Reflecting Pool after the First North American blizzard of 2010.\nThe best times to visit Washington, D.C., are from September to November and March to May. In the autumn, the sweltering summer is gone, taking...\nThe best times to visit Washington, D.C., are from September to November and March to May. In the autumn, the sweltering summer is gone, taking with it most of the high-season tourists. All that's left are crisp breezes and changing leaves, which, by the way, look great against all those marble monuments.\nOther than the National Independence Day Parade, the other most anticipated event is the Washington DC fireworks. The fireworks begin around 9:15 pm and are launched from the Lincoln Memorial Reflecting Pool. Lighting up the sky over the Washington Monument, these fireworks are especially patriotic.\nBest and worst time to go to Washington, D.C. The best time to visit Washington, D.C., is in September after Labor Day, as both temperatures and tourist crowds decrease from their respective summer peaks. The worst time to visit unfortunately coincides with one of the area's biggest draws, the Cherry Blossom Festival at the end of March to early April.", "key": "54_6", "timestamp": "2020-06-23 21:18:59.127137", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}