{"input_text": "In 1957 the first Earth-orbiting artificial  satellite ,  Sputnik 1 , was launched; in 1961 on  12 April  the first human trip into space was successfully made by  Yury Gagarin ; and many other Soviet and Russian  space exploration records  ensued, including the first  spacewalk  performed by  Alexey Leonov , the first space exploration  rover   Lunokhod-1  and the first  space station   Salyut 1 . Nowadays Russia is the largest satellite launcher and the only provider of transport for  space tourism  services.\nOn the first orbit the  Telegraph Agency of the Soviet Union  (TASS) transmitted: \"As result of great, intense work of scientific institutes and design bureaus the first artificial Earth satellite has been built\". The R-7 core stage, with a mass of 7.5 tonnes and a length of 26 meters, also reached Earth orbit and was visible from the ground at night as a  first magnitude  object following the satellite. Deployable reflective panels were placed on the booster in order to increase its visibility for tracking. The satellite itself, a small, highly polished sphere, was barely visible at sixth magnitude, and thus more difficult to follow optically. A third object, the payload fairing, also achieved orbit.\nThe first  artificial Earth satellite  was  Sputnik 1 . Put into orbit by the  Soviet Union  on October 4, 1957, it was equipped with an on-board  radio - transmitter  that worked on two frequencies: 20.005 and 40.002 MHz. Sputnik 1 was launched as a step in the exploration of space and rocket development. While incredibly important it was not placed in orbit for the purpose of sending data from one point on earth to another. And it was the first artificial satellite in the steps leading to today's satellite communications.\nRussia launches the first artificial satellite, Sputnik 1, into orbit, beginning the space age. The US launches its first satellite, Explorer 1, four months later.\nThe space segment of an artificial  satellite  system is one of its three operational components (the others being the  user  and  ground segment s). It comprises the satellite or  satellite constellation  and the uplink and downlink  satellite link s.\nKorolev was buoyed by the first successful launches of his R-7 rocket in August and September, which paved the way for him to launch his sputnik. Word came that the Americans were planning to announce a major breakthrough at an International Geophysical Year conference at the  National Academy of Sciences  in Washington D.C., with a paper entitled \"Satellite Over the Planet\", on October 6, 1957. Korolev anticipated that von Braun might launch a Jupiter-C with a satellite payload on or around October 4 or 5, in conjunction with the paper. He hastened the launch, moving it to October 4. The launch vehicle for PS-1, was a modified R-7 – vehicle 8K71PS number M1-PS– without much of the test equipment and radio gear that was present in the previous launches. It arrived at the Soviet missile base  Tyura-Tam  in September and was prepared for its mission at  launch site number one . On Friday, October 4, 1957, at exactly 10:28:34 pm Moscow time, the R-7, with the now named  Sputnik 1  satellite, lifted off the launch pad, and placed this artificial \"moon\" into an orbit a few minutes later. This \"fellow traveler,\" as the name is translated in English, was a small, beeping ball, less than two feet in diameter and weighing less than 200 pounds. But the celebrations were muted at the launch control center until the down-range far east tracking station at  Kamchatka  received the first distinctive beep ... beep ... beep sounds from Sputnik 1s radio transmitters, indicating that it was on its way to completing its first orbit. About 95 minutes after launch, the satellite flew over its launch site, and its radio signals were picked up by the engineers and military personnel at Tyura-Tam: that's when Korolev and his team celebrated the first successful artificial satellite placed into Earth-orbit.\nThe world's first artificial satellite, the  Sputnik 1 , was launched by the  Soviet Union  in 1957. Since then, thousands of satellites have been launched into orbit around the  Earth .  A few large satellites have been launched in parts and assembled in orbit.  Artificial satellites from more than 40 countries have been launched by ten nations.  Over a dozen  space probe s have been placed into orbit around other bodies and become artificial satellites to the Moon,  Mercury ,  Venus ,  Mars ,  Jupiter ,  Saturn , a few  asteroid s, and the  Sun .\nIn the context of  spaceflight , a satellite is an artificial object which has been intentionally placed into  orbit . Such objects are sometimes called artificial satellites to distinguish them from  natural satellite s such as Earth's  Moon .\nThe Naval Research Laboratory has been a crucial piece of the United States space program.  Project Vanguard , the first American satellite program, tasked NRL with the design, construction and launch of an artificial satellite, which was accomplished in 1958. Vanguard I, designed and built at NRL, was the first solar-powered satellite. As of 2013,  Vanguard I  is still in orbit, making it the longest-lived man-made satellite.  Vanguard II  was the first satellite to observe the Earth's cloud cover and therefore the first meteorological satellite. NRL pioneered the study of the sun Ultraviolet and X-Ray spectrum. Along with Project Vanguard, NRL also designed the first satellite tracking system,  Minitrack , which became the prototype for future satellite tracking networks. NRL's recently declassified  Galactic Radiation and Background  I (GRAB I) was the first U.S.  intelligence satellite , intercepting Soviet radio communications from space. The  Global Positioning System  (GPS) was invented at NRL and tested by NRL prototype satellites  Timation  I and Timation II in 1967 and 1969, and the first operational GPS satellite, Timation IV (NTS-II) was designed and constructed at NRL.\nTo the surprise of many, the  USSR  launched  Sputnik 1  as the first artificial Earth satellite on October 4, 1957. After several failed Vanguard launches,  Wernher von Braun  and his team convinced President  Dwight D. Eisenhower  to use one of their US Army missiles for the Explorer program (there then being no inhibition about using military rockets to get into space). On November 8, 1957, the US Secretary of Defense instructed the US Army to use a modified  Jupiter-C  rocket to launch a satellite. The US achieved this goal only four months later with Explorer 1, on February 1, 1958, but after  Sputnik 2  in November 3, 1957, making Explorer 1 the third artificial Earth satellite.  Vanguard 1  became the fourth, launched on March 17, 1958. The  Soviet  victory in the \" Space Race \" would be followed by considerable political consequences,one of which was the creation of the US space agency  NASA  on July 29, 1958.\nThe R-7 missile made its maiden voyage from LC-1 on May 15, 1957. On 4 October 1957 the pad was used to launch the world's first artificial satellite,  Sputnik 1 . Manned spaceflights launched from the site include  Yuri Gagarin 's flight,  Valentina Tereshkova 's flight, and numerous other  human spaceflight  missions, including all  Soviet  and  Russia n  manned spaceflights to Mir . The pad was also used to launch  Luna program  spacecraft,  Mars probe program  spacecraft,  Venera program  spacecraft, many  Cosmos satellites  and others. From 1957 through 1966 the site hosted ready-to-launch strategic nuclear ICBMs in addition to spacecraft launches; by the 2000s there were more than 400 launches from the site. The 500th launch from this site was of  Soyuz TMA-18M  on 2 September 2015.\nSputnik I , the first  artificial satellite  of the Earth, was launched by the  Soviet Union  on 4 October 1957, energizing America to do likewise. After the failure of their  Viking  rocket in  its first satellite launch attempt , this mission was taken away from the  U.S. Naval Research Laboratory  and given to the von Braun team at ABMA. On 31 January 1958, America's first satellite,  Explorer I , was placed into orbit. BECO had an involvement in this historic effort, providing support in the design and testing of both the vehicle and the payload.\nThe first artificial satellite used solely to further advances in global communications was a balloon named  Echo 1 . Echo 1 was the world's first artificial communications satellite capable of relaying signals to other points on Earth. It soared  above the planet after its Aug. 12, 1960 launch, yet relied on humanity's oldest flight technology — ballooning. Launched by NASA, Echo 1 was a  aluminised  PET film  balloon that served as a  passive reflector  for radio communications. The world's first inflatable satellite — or \"satelloon\", as they were informally known — helped lay the foundation of today's satellite communications. The idea behind a communications satellite is simple: Send data up into space and beam it back down to another spot on the globe. Echo 1 accomplished this by essentially serving as an enormous mirror, 10 stories tall, that could be used to reflect communications signals.\nThe telescope became operational in October 1957, which was just before the launch of  Sputnik 1 , the world's first artificial satellite. Only the Soviet hierarchy were aware of Sputnik and it was the Lovell Telescope which tracked the satellite. While the transmissions from Sputnik itself could easily be picked up by a household  radio , the Lovell Telescope was the only telescope capable of tracking Sputnik's booster rocket by radar; it first located it just before midnight on 12 October 1957. It also located  Sputnik 2 's carrier rocket at just after midnight on 16 November 1957. Jodrell Bank continued tracking new artificial satellites in the following years, and also doubled up as a long range ballistic missile radar system, a beneficial trait which helped the telescope gain funding from the British government. The Jodrell Bank Observatory is currently operated by the University of Manchester and was nominated for UNESCO World Heritage Status in 2011.\n Goliat is the first artificial satellite developed in  Romania .\nExpendable rockets provided the means for launching artificial  satellite s, as well as  manned spacecraft . In 1957 the  Soviet Union  launched the first satellite,  Sputnik I , and the United States followed with  Explorer I  in 1958. The first manned space flights were made in early 1961, first by Soviet cosmonaut  Yuri Gagarin  and then by American astronaut  Alan Shepard .\nAmateur satellite spotting traces back to the days of early artificial satellites when the  Smithsonian Astrophysical Observatory  launched the  Operation Moonwatch  (1956), a program to enlist amateur  astronomer s in the effort to track  Soviet   sputnik s, in an analogy with the  World War II   Ground Observer Corps  program to spot enemy bombers. Moonwatch was crucial until professional stations were deployed in 1958. The program was discontinued in 1975.\nThe Explorers program was the  United States 's first successful attempt to launch an  artificial satellite . It began as a  U.S. Army  proposal ( Project Orbiter ) to place a scientific satellite into  orbit  during the  International Geophysical Year ; however, that proposal was rejected in favor of the U.S. Navy's  Project Vanguard . The Explorers program was later reestablished to catch up with the  Soviet Union  after that nation's launch of  Sputnik 1  on October 4, 1957. (See:  Sputnik crisis )  Explorer 1  was launched on January 31, 1958. Besides being the first U.S. satellite, it is known for discovering the  Van Allen radiation belt .\nProject Vanguard was a program managed by the  United States   Naval Research Laboratory  (NRL), which intended to launch the first artificial  satellite  into  Earth   orbit  using a  Vanguard rocket  as the  launch vehicle  from  Cape Canaveral Missile Annex , Florida.\nIn October 1957, the Soviet Union launched the world's first artificial satellite, Sputnik.  Scientists at  Johns Hopkins University’s Applied Physics Laboratory  took a series of measurements of Sputniks  doppler shift  yielding the satellite's position and velocity.  This team continued to monitor Sputnik and the next satellites into space, Sputnik II and Explorer I.  In March 1958 the idea of working backwards, using known satellite orbits to determine an unknown position on the Earth's surface began to be explored.  This led to the TRANSIT satellite navigation system.  The first TRANSIT satellite was placed in polar orbit in 1960.  The system, consisting of 7 satellites, was made operational in 1962.  A navigator using readings from three satellites could expect accuracy of about 80 feet.\nBoth the  Soviet Union  and the  U.S.  launched artificial  satellite s for this event; the Soviet Union's  Sputnik 1 , launched on October 4, 1957, was the first successful artificial satellite. Other significant achievements of the IGY included the discovery of the  Van Allen radiation belts  by  Explorer 1  and the defining of mid-ocean submarine ridges, an important confirmation of  plate tectonics . Also detected was the rare occurrence of hard solar corpuscular radiation that could be highly dangerous for manned  space flight .\nSputnik  was the first  artificial satellite . It was launched into an elliptical  low Earth orbit  (LEO) by the  Soviet Union  on 4 October 1957. The launch ushered in new political, military, technological, and scientific developments;  while the Sputnik launch was a single event, it marked the start of the  Space Age . Apart from its value as a technological first, Sputnik also helped to identify the upper  atmospheric layer 's density, through measuring the satellite's orbital changes. It also provided data on  radio -signal distribution in the  ionosphere . Pressurized  nitrogen  in the satellite's false body provided the first opportunity for  meteoroid  detection. Sputnik 1 was launched during the  International Geophysical Year  from  Site No.1/5 , at the 5th  Tyuratam  range, in  Kazakh SSR  (now at the  Baikonur Cosmodrome ). The satellite travelled at 29,000 kilometers (18,000 mi) per hour, taking 96.2 minutes to complete an orbit, and emitted radio signals at 20.005 and 40.002  MHz\nVanguard 1 ( ID : 1958-Beta 2) was the fourth artificial  Earth  orbital  satellite  launched (after  Sputnik 1 ,  Sputnik 2 , and  Explorer 1 ). It was the first satellite to be  solar power ed. Although communication with it was lost in 1964, it remains the oldest manmade satellite still in orbit. It was designed to test the launch capabilities of a three-stage  launch vehicle  as a part of  Project Vanguard , and the effects of the environment on a satellite and its systems in Earth orbit. It also was used to obtain  geodetic  measurements through orbit analysis. Vanguard 1 was described by then- Soviet Premier   Nikita Khrushchev  as, \"The grapefruit satellite.\"\nThe club was very active through the late 1950s and 1960s, with general-interest events such as public open nights, and sections for special purposes such as a very active junior section.  It also worked with professional observers on a number of research projects, including a flare star observing program at the request of the  CSIRO , and measuring transits of artificial satellites across the moon as part of the  Smithsonian Astrophysical Observatory 's \"Project Moonwatch\". After the first  Sputnik  launch on 4 October 1957, a program for observing artificial satellites was set up at very short notice, and it succeeded in being the first group in the world to see the first satellite, Sputnik I, in October 1957 and they went on to record three of the first four Sputnik observations.\n\" Newton's cannonball \", presented as a \"thought experiment\" in  A Treatise of the System of the World , by  Isaac Newton  was the first published mathematical study of the possibility of an artificial satellite.\nThe Bolivarian Agency for Space Activities (Agencia Bolivariana para Actividades Espaciales, ABAE) is an agency of the Ministry of Science, Technology and Innovation (MCTI)of Venezuela responsible for developing and carrying out policies of the National Executive  Venezuela  regarding the pacific use of the  outer space . Originally designated Venezuelan Space Center (CEV), created on November 28, 2005. Then, the requirements grew up and the body was renamed as Bolivarian Agency for Space Activities (ABAE). The purpose of this agency is to design, coordinate and implement the policies of the Venezuelan National Executive, related to the peaceful use of outer space, and act as a decentralized entity specialized in aerospace. Since its creation, it has been working on the launch of the first  artificial satellite  of Venezuela, the Satellite Simon Bolivar ( Venesat-1 ), which became in operational phase on October 29, 2008 and Satellite Miranda ( VRSS-1 ) on September 29, 2012.\nThe first known work on space colonization was  The Brick Moon , a work of fiction published in 1869 by  Edward Everett Hale , about an inhabited artificial satellite.\nNumerous scientific exploration missions were begun in 2011. In March 2011, the  MESSENGER  probe became the first artificial satellite of the planet  Mercury .  In July, the  Dawn  spacecraft became the first artificial satellite of the  asteroid   4 Vesta . The  Mars Science Laboratory  – at the time, the largest  Mars rover  ever constructed – was launched in November, conducting a successful landing on Mars in August 2012.\nExplorer 3 (international designation 1958 Gamma) was an artificial  satellite  of the  Earth , nearly identical to the first  United States  artificial satellite  Explorer 1  in its design and mission. It was the second successful launch in the  Explorer program .\nThe first artificial satellite was  Sputnik 1 , launched by the Soviet Union on October 4, 1957, and initiating the  Soviet   Sputnik program , with  Sergei Korolev  as chief designer (there is a crater on the lunar far side which bears his name). This in turn triggered the  Space Race  between the Soviet Union and the United States.\nFor example, the existence of the  Van Allen radiation belt s was unknown until their discovery by the United States' first artificial satellite,  Explorer 1 . These belts contain radiation trapped by Earth's magnetic fields, which currently renders construction of habitable space stations above 1000 km impractical.Following this early unexpected discovery, a large number of Earth observation satellites have been deployed specifically to explore Earth from a space based perspective. These satellites have significantly contributed to the understanding of a variety of Earth-based phenomena. For instance, the  hole in the ozone layer  was found by an artificial satellite that was exploring Earth's atmosphere, and satellites have allowed for the discovery of archeological sites or geological formations that were difficult or impossible to otherwise identify.\nUnfortunately for the timely success of the satellite project, many of the most experienced people at Martin were shifted to the high-priority  Titan   ICBM  program, and the mature Viking team was largely lost to Project Vanguard.  The resulting shock to US pride and perceptions of national security, when the  Soviet Union  launched  Sputnik 1 , the first artificial earth satellite, on October 4, 1957 (on the much larger  R-7 rocket , developed as an ICBM), combined with the  spectacular launch failure  of the first complete Vanguard test launch December 6, 1957, is well known and recounted elsewhere.  Thus the first US satellite,  Explorer 1 , was launched January 31, 1958 by a substantially larger Army  Jupiter-C  rocket, based on the  Redstone missile , which had been developed by the  Army Ballistic Missile Agency  (ABMA) at Huntsville, Alabama under the leadership of  Wernher von Braun .  The first successful Vanguard satellite launching came on March 17, 1958.  Its payload,  Vanguard 1 , is the oldest satellite currently in orbit.\n1957  Artificial satellite\nFrom 1950 until 1977 he was a professor of Astronomy at  Harvard University , including being the Phillips Professor of Astronomy between 1968 and 1977. During these years (in the early 1950s), he wrote a series of influential papers entitled A Comet Model, published  in  Astrophysical Journal . In these papers, he proposed the \"icy conglomerate\" hypothesis of  comet  composition (later called the \" dirty snowball \" hypothesis). The basic features of this hypothesis were later confirmed; however, the exact amount (and thus the importance) of ices in a comet is an active field of research, with most of the recently obtained data pointing to a low contribution of ices to a comet's mass (dubbed the \" icy dirtball \" hypothesis). He also anticipated the era of  artificial satellite s and organized the members of  Operation Moonwatch  to track them. These groups were the only ones in the US prepared and ready to make observations when the  Soviet Union  unexpectedly launched  Sputnik I  in 1957.  He became director of the  Smithsonian Astrophysical Observatory  when  Loyal Blaine Aldrich  retired in 1955, and remained in this post until 1973.\nUnder Eisenhower's presidency the U.S. developed as a global  nuclear  power. When Russia also developed their  nuclear weapons , fears of mutual annihilation in a  Third World War  intensified. On October 30, 1953, Eisenhower approved the security policy document NSC 162/2, which emphasized nuclear weapons above all other defense means. Nuclear weapons were seen as the most economically feasible means to deter the  Soviet Union  from military action against what then was called the \"Free World.\" Throughout his presidency, Eisenhower insisted on having plans to initiate, fight, and win a nuclear war against the Soviets, although he hoped he would never feel forced to use them. With the 1957 Soviet launch of  Sputnik , the first artificial satellite, America became vulnerable to a surprise nuclear attack by this  new indefensible weapon .\nThe first artificial object sent into space was the Soviet satellite  Sputnik 1 , launched in 1957, which successfully orbited Earth until 4 January the following year. The American probe  Explorer 6 , launched in 1959, was the first satellite to image Earth from space.\nLuna 10  (March 1966) became the first artificial satellite of the Moon.\nThe Soviet probe  Venera 9  entered orbit on October 22, 1975, becoming the first artificial satellite of Venus. A battery of cameras and spectrometers returned information about the planet's clouds, ionosphere and magnetosphere, as well as performing bi-static radar measurements of the surface. The  660 kg (1,455 lb) descent vehicle separated from Venera 9 and landed, taking the first pictures of the surface and analyzing the crust with a gamma ray spectrometer and a densitometer. During descent, pressure, temperature and photometric measurements were made, as well as backscattering and multi-angle scattering ( nephelometer ) measurements of cloud density. It was discovered that the clouds of Venus are formed in three distinct layers. On October 25,  Venera 10  arrived and carried out a similar program of study.\nOperation Moonwatch (also known as Project Moonwatch and, more simply, as Moonwatch) was an amateur science program formally initiated by the  Smithsonian Astrophysical Observatory  (SAO) in 1956. The SAO organized Moonwatch as part of the  International Geophysical Year  (IGY) which was probably the largest single scientific undertaking in history. Its initial goal was to enlist the aid of amateur astronomers and other citizens who would help professional scientists  spot the first artificial satellites . However, until professionally manned optical tracking stations came on-line in 1958, this network of amateur scientists and other interested citizens played a critical role in providing crucial information regarding the world’s first satellites.\nOn 29 July 1955, U.S. President  Dwight D. Eisenhower  announced through his press secretary that the United States would launch an artificial satellite during the  International Geophysical Year  (IGY). A week later, on 8 August, the  Politburo of the Communist Party of the Soviet Union  approved the proposal to create an artificial satellite. On 30 August  Vasily Ryabikov  – the head of the State Commission on  R-7 rocket  test launches – held a meeting where Korolev presented calculation data for a spaceflight trajectory to the Moon. They decided to develop a three-stage version of the R-7 rocket for satellite launches.\nIn July 34 the Soviet Union's  OKB-1  drafted a project to design and build the first Earth satellite, designated ISZ (Artificial Earth Satellite). ISZ was known to its designers as \"Object D.\" Design of Object D had begun in January 1956 with intent to launch it during the  International Geophysical Year . Object D was planned to be the first satellite launched by the Soviet Union but ended up being the third following delays due to problems developing the extensive scientific experiments and their telemetry system.  The new  R-7   intercontinental ballistic missile , also known by its GURVO designation 8K71, was ready to launch before Object D was finished. Worried at the prospect of America launching a satellite before he did,  Sergei Korolev  substituted the relatively simple \"Prosteyshiy Sputnik-1\" meaning \"Simple Satellite 1\", or PS-1, which was labeled  Sputnik 1  by the Soviet Government, as the first satellite to be launched instead. The  Sputnik 2  (PS-2) was also ready and launched earlier than Object D.\nSatellites, of course! Satellites are any objects that revolve around (orbit) another object in space. Some satellites are natural, while others are artificial (man-made). The moon is an example of a natural satellite that orbits the Earth. We're going to focus, though, on the man-made satellites. Artificial satellites are machines that humans launch into orbit, usually around the Earth. Artificial satellites can be sent to orbit other planets, too. For example, there are currently satellites orbiting the Moon, the Sun, and several other planets, including Mercury, Venus, Mars, and Saturn.\nThe first artificial satellite to achieve Earth orbit successfullywas Sputnik-1. It was launched by the USSR on October 4, 1957. It spent about 3months in orbit and was follow â\u0080¦ ed by many other unmanned satellites.The first satellite to carry a human was Vostok, in which YuriGagarin orbited the Earth in 1961. The first artificial satellite was Sputnik I, launched by theSoviet Union on the 4 th of October 1957\nThe first artificial satellite was Sputnik 1. It was the size of a basketball and was made by the USSR (Union of Soviet Socialist Republics) or Russia. It was launched on October 4, 1957.\nThe world was shocked on October 4, 1957, when the USSR launched the first artificial satellite, Sputnik 1. It was the beginning of the space race. The world was shocked on October 4, 1957, when the USSR launched the first artificial satellite, Sputnik 1. It was the beginning of the space race. Sputnik 1: Earth's First Artificial Satellite\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nWith a single shot, the Soviet Union vaulted ahead in the Space Race. The country sent Sputnik, the world's first artificial satellite, into space on Oct. 4, 1957. The small satellite brought the Soviet Union into the technological spotlight and demonstrated that the country was capable of modern feats.ith a single shot, the Soviet Union vaulted ahead in the Space Race. The country sent Sputnik, the world's first artificial satellite, into space on Oct. 4, 1957. The small satellite brought the Soviet Union into the technological spotlight and demonstrated that the country was capable of modern feats.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon. The world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth.\n1 1957 - Launch of the first ICBM, the USSR 's R-7 (8K71) , known to NATO as the SS-6 Sapwood. 2  1957 - The USSR launches Sputnik 1, the first artificial satellite. 3  1958 - The U.S. launches Explorer 1, the first American artificial satellite, on a Jupiter-C rocket. 1958 - US launches their first ICBM, the Atlas-B (the Atlas-A was a test article only). 2  1961 - the USSR launches Vostok 1, Yuri Gagarin reached a height of 327 km above Earth and was the first man to orbit earth.\nThe Moon is the natural satellite of the Earth, so the person who discovered it was probably Ugghhh, the First Caveman. Artificial satellites weren't developed until the 1950'â\u0080¦s, and so the discoverer was one of the Soviet engineers who launched the first Sputnik, the first artificial satellite of the Earth.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nSatellite. In the context of spaceflight, a satellite is an object which has been placed into orbit by human endeavor. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as the Moon. The world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth.Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nThe first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).he first artificial satellite was Sputnik 1, launched by the Soviet Union on October 4, 1957, and initiating the Soviet Sputnik program, with Sergei Korolev as chief designer (there is a crater on the lunar far side which bears his name).\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.he first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.\nA satellite is any object that moves in a curved path around a planet. The moon is Earth's original, natural satellite, and there are many man-made (artificial) satellites, usually closer to Earth. The path a satellite follows is an orbit, which sometimes takes the shape of a circle.To understand why satellites move this way, we must revisit our friend Newton.he moon is Earth's original, natural satellite, and there are many man-made (artificial) satellites, usually closer to Earth. The path a satellite follows is an orbit, which sometimes takes the shape of a circle. To understand why satellites move this way, we must revisit our friend Newton.\nFreebase(0.00 / 0 votes)Rate this definition: Satellite. In the context of spaceflight, a satellite is an object which has been placed into orbit by human endeavor. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as the Moon.\nArtificial satellites are used to study the Earth, other planets, to help us communicate, and even to observe the distant Universe. Satellites can even have people in them, like the International Space Station and the Space Shuttle. The first artificial satellite was the Soviet Sputnik 1 mission, launched in 1957. Since then, dozens of countries have launched satellites, with more than 3,000 currently operating spacecraft going around the Earth.\nIn the context of spaceflight, a satellite is an artificial object which has been intentionally placed into orbit. Such objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit. Artificial satellites originate from more than 40 countries and have used the satellite launching capabilities of ten nations.\nThe first satellite, Sputnik 1, was put into orbit around Earth and was therefore in geocentric orbit. By far this is the most common type of orbit with approximately 2,465 artificial satellites orbiting the Earth. Geocentric orbits may be further classified by their altitude, inclination and eccentricity.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.Artificial satellites originate from more than 40 countries and have used the satellite launching capabilities of ten nations.he world's first artificial satellite, the Sputnik 1, was launched by the Soviet Union in 1957. Since then, thousands of satellites have been launched into orbit around the Earth. Some satellites, notably space stations, have been launched in parts and assembled in orbit.\nThe first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.ach of a series of Soviet artificial satellites, the first of which (launched on 4 October 1957) was the first satellite to be placed in orbit.\nThe first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.he first artificial satellite to be launched was the Russian Sputnik 1, in 1957, and in 1962 the Telstar satellite relayed the first satellite television signal. Sputnik means â\u0080\u0098fellow travellerâ\u0080\u0099 in Russian, while Telstar got its name because it was built by Bell Telephone Laboratories and used for telecommunications.\nSuch objects are sometimes called artificial satellites to distinguish them from natural satellites such as Earth's Moon. In 1957 the Soviet Union launched the world's first artificial satellite, Sputnik 1. Since then, about 6,600 satellites from more than 40 countries have been launched.\nElizabeth Dohrer, SPACE.com Contributor | September 25, 2012 06:55pm ET. The Soviet Union stunned the world on Nov. 3, 1957, with the launch of Sputnik 2. On board the small satellite was a little dog, Laika, the first animal to orbit Earth. However, Laika was not the first animal in space.The United States and the U.S.S.R. had been putting animals atop rockets since 1947.Laika, a mixed-breed dog, was the first living being in orbit.owever, Laika was not the first animal in space. The United States and the U.S.S.R. had been putting animals atop rockets since 1947. Laika, a mixed-breed dog, was the first living being in orbit.\nThe first artificial satellite to orbit the Earth was a Soviet  satellite named Sputnik I. It was launched by the  USSR on October 4, 1957, followed by Sputnik 2 in Novemberâ\u0080¦.\nMan-made objects that orbit the earth in outer space are called artificial satellites. Artificial satellites are launched by rockets, which are also called launch vehicles. Rockets work on the principle of Newtonâ\u0080\u0099s third law of motion. Rockets use a special type of fuel, called a propellant.\nIn 1955, the United States and the Soviet Union announced plans to launch artificial satellitesâ\u0080¦ On Oct. 4, 1957, the Soviet Union launched Sputnik 1, the first artificial satellite. It circled Earth once every 96 minutes and transmitted radio signals that could be received on Earth.\nIn Artificial Satellites. The first artificial satellite was Sputnik 1 and it was launched  into an elliptical low Earth orbit by the Soviet Union October 4 at  19:28:34p.m. in 1957.   The first â\u0080¦ US satellite was Explorer I on January 31, 1958.\nThe first artificial satellite was Sputnik I launched by the Soviet Union in 1957. Now almost fifty years later there are thousands of satellites orbiting the Earth at various heights. There are various kinds of satellites.\nSatellites are objects orbiting a planet. The moon is a natural satellite. Artificial satellites are those put into orbit by man. The first artificial satellite was Sputnik I launched by the Soviet Union in 1957. Now almost fifty years later there are thousands of satellites orbiting the Earth at various heights.\nMOTION OF SATELLITES. A satellite (artificial satellite) is an object put into orbit from the Earthâ\u0080\u0099s surface using a spacecraft such. a rocket or a space shuttle. Satellites are used for a large number of applications and include military. and civilian Earth observation satellites, communications satellites, navigation satellites, weather.\nThe caption reads: The world's first Soviet artificial satellite of the Earth.Sputnik 1 was launched on October 4, 1957. The satellite was 58 cm (about 23 in) in diameter and weighed approximately 83.6 kg (about 183 lb). Each of its elliptical orbits around the Earth took about 96 minutes.", "key": "50_1", "timestamp": "2020-06-23 21:18:59.097000", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}