{"input_text": "The etymology of \"half-smoke\" possibly comes from the original half-pork, half-beef composition, the ingredients and  smoked method  of preparation. Another possible explanation is that the texture and flavor is halfway between smoked sausage and a regular hot dog. Yet another explanation is that it refers to cooks cutting the sausage in half when grilling. Composition of the sausages varies by brand and some brands even make more than one kind. A half-smoke can be half pork, half beef, all beef, or anything in between. It can be steamed instead of smoked. The company thought to be the originator of the sausage, Briggs & Company, was sold by its owner, Raymond Briggs, in 1950 without clarifying the origin of the name. The products sold under the name generally have a genuine or artificial smoke flavoring and coarser texture than a regular hot dog and are the key features that distinguish.\nA  half-smoke  is a \"local sausage delicacy\" found in Washington, D.C. and the surrounding region. Similar to a hot dog, but usually larger, spicier, and with more coarsely-ground meat, the sausage is often half-pork and half-beef, smoked, and served with herbs, onion, and chili sauce.\nIn Washington, D.C. the  half-smoke  is similar to a hot dog, but usually larger, spicier, and with more coarsely-ground meat, the sausage is often half-pork and half-beef, smoked, and served with herbs, onion, and chili sauce.\nThe \"original\" half-smoke is considered to be the sausage distributed by D.C.'s Briggs and Co. meatpackers, originating in around 1950, though Raymond Briggs started selling his half-smokes in about 1930. Eventually, Briggs was sold to another meat distributor, where, by some accounts, the quality of the meat declined.\nWashington D.C is also well known for the  Half Smoke .  It's similar to a hot dog, but usually larger, spicier, and with more coarsely-ground meat, the sausage is often half-pork and half-beef, smoked, and served with herbs, onion, and chili sauce.\nHowever, celebrities at Ben's are not limited to American citizens. In 1998, former DC mayor  Marion Barry  described having traveled to  Ghana  and meeting the  Mayor of Accra , an alumnus of Howard University, whose greeting was, \"Glad to have you in Accra. Is Ben's Chili Bowl still there?\" And when French President Nicolas Sarkozy and his wife Carla Bruni-Sarkozy visited Washington, D.C. in March 2010, they reportedly each had two of Ben's half smokes during their visit to the restaurant.\nBen's Chili Bowl is a landmark restaurant in Washington, D.C., located at 1213  U Street , next to  Lincoln Theatre , in the  Shaw  neighborhood of  northwest  D.C. It is known locally for its  chili dog s,  half-smoke s, and  milkshake s, and has been an integral part of the neighborhood's history since its founding in 1958. It was frequented by both police and protesters during the  1968 Washington, D.C. riots , and is regularly visited by celebrities, such as  Bill Cosby  and  Chris Tucker .\nAnother popular location for half-smokes is the  Weenie Beenie  in  South Arlington ,  Virginia , located near the  Washington & Old Dominion Railroad Regional Park  trail. Founded in 1950, it pre-dates Ben's Chili Bowl. Among newer purveyors is Meats & Foods, on Florida Avenue just east of Ben's Chili Bowl, which makes its own handmade version of the sausage.\nThe most famous regular customer is comedian  Bill Cosby , who took his future wife to Ben's when they were dating. He recalls that he first became a frequent visitor while serving in the Navy and stationed in  Bethesda, Maryland  in 1958, and frequently visited the U Street jazz clubs. Cosby recalls that during some of his visits with  Camille , who was then a student at the  University of Maryland , he would \"eat as many as six half-smokes at a time.\" Cosby returned to Ben's in 1985 to hold a press conference in the restaurant to celebrate the success of his television series,  The Cosby Show . He continues to stop by Ben's while in town for servings of  half-smoke s. A sign posted in the restaurant proclaimed that Bill Cosby is the only person who eats for free at Ben's Chili Bowl. On November 3, 2008, a new sign was posted to add \"the Obama family\".\nNumerous hot dog carts in Washington, D.C., sell steamed half-smokes, with those on  Constitution Avenue  catering to tourists and those on  Pennsylvania Avenue  and many other hot dog carts throughout the downtown area serving  federal  employees . Half-smokes are the \"official dog\" of the  Washington Nationals . The most prominent location is often cited as  Ben's Chili Bowl  in Washington's  U Street  neighborhood, which gained widespread exposure when visited by  Bill Cosby  in the 1980s and later by President-elect  Barack Obama  in 2009.\nThe  Nationals Park   baseball park  in the Navy Yard neighborhood of  Washington, D.C. , the home ballpark for the  Washington Nationals , offers a sandwich prepared with a  half-smoke , Maryland crab dip and Virginia ham called \"The DMV\" as part of its concessions. It was reported in August 2014 that  Byrd Stadium  on the campus of the University of Maryland in  College Park, Maryland  planned to offer a large 1.5 pound soft pretzel baked with crab dip and melted cheese that serves four people as part of its concessions. Byrd Stadium also offers other foods prepared with crab, such as nachos and \"crab fries\".\nBen's menu features the \"original chili half-smoke\" as its \"signature dish\".  It is a one-quarter pound half-pork and half-beef smoked sausage on \"a warm steamed bun,\" topped with mustard, onions and spicy homemade chili sauce. In addition to the pork-beef half-smokes and all pork or all beef hot dogs, the menu also features \"healthy choice\" items such as turkey burgers and turkey hot dogs (\"turkey dogs\"), and vegetarian chili, burgers (\"veggie burgers\"), and hot dogs (\"veggie dogs\").  Chili (both the beef variety and the all-vegetarian variety) is also available in various sizes.  In addition to serving food for customers who eat inside or order for take-out, the restaurant ships food nationwide.", "key": "54_8", "timestamp": "2020-06-23 21:18:59.130935", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}