{"input_text": "When the streaming service first launched, Netflix's disc rental subscribers were given access at no additional charge. Subscribers were allowed approximately one hour of streaming per dollar spent on the monthly subscription (a $16.99 plan, for example, entitled the subscriber to 17 hours of streaming media). In January 2008, however, Netflix lifted this restriction, at which point virtually all rental-disc subscribers became entitled to unlimited streaming at no additional cost (however, subscribers on the restricted plan of two DVDs per month ($4.99) remained limited to two hours of streaming per month). This change came in a response to the introduction of  Hulu  and to  Apple 's new video-rental services. Netflix later split DVD rental subscriptions and streaming subscriptions into separate, standalone services, at which point the monthly caps on Internet streaming were lifted.\nBlockbuster Video  entered the United States online market in August 2004, with a US$19.95 monthly subscription service. This sparked a  price war ; Netflix had raised its popular three-disc plan from US$19.95 to US$21.99 just prior to Blockbuster's launch, but by October, Netflix reduced this fee to US$17.99. Blockbuster responded with rates as low as US$14.99 for a time, but, by August 2005, both companies settled at identical rates. On July 22, 2007, Netflix dropped the prices of its two most popular plans by US$1.00 in an effort to better compete with Blockbuster's online-only offerings. On October 4, 2012,  Dish Network  scrapped plans to make Blockbuster into a Netflix competitor. (Dish bought the ailing Blockbuster, LLC in 2011 and will continue to license the brand name to franchise locations, and keep its \"Blockbuster on Demand\" video streaming service open.)\nIn 2000, Netflix offered to be acquired by  Blockbuster  for $50 million, but the offer was declined. Netflix initiated an  initial public offering  (IPO) on May 29, 2002, selling 5.5 million shares of  common stock  at the price of  US$ 15.00 per share. On June 14, 2002, the company sold an additional 825,000 shares of common stock at the same price. After incurring substantial losses during its first few years, Netflix posted its first profit during fiscal year 2003, earning US$6.5 million profit on revenues of US$272 million. In 2005, 35,000 different film titles were available, and Netflix shipped 1 million DVDs out every day.\nOn August 11, 2004, Blockbuster introduced a  DVD-by-mail  service in the U.S. to compete with the established market leader,  Netflix .\nOn July 12, 2011, Netflix announced that it would separate its existing subscription plans into two separate plans: one covering the streaming and the other DVD rental services. The cost for streaming would be $7.99 per month, while DVD rental would start at the same price. The announcement led to panned reception amongst Netflix's Facebook followers, who posted negative comments on its wall.  Twitter  comments spiked a negative \"Dear Netflix\" trend. The company defended its decision during its initial announcement of the change:\nElephant in the Room is a stand up special by comedian  Patrice O'Neal , released by  Comedy Central . It premiered on February 19, 2011. It is the comedian's only \"hour-length\" special and his first to be released on DVD or CD. The DVD was released by Comedy Central on February 22, 2011. Although the original televised version ran only 42 minutes (an hour with commercials), the full-length edit released on DVD and  Netflix 's streaming service runs at 77 minutes. The DVD includes additional \"deleted scenes\" as well as O'Neal's 2003  Comedy Central Presents , available on DVD for the first time.\nOcnus Productions (creators of Kevin Spencer) sold the rights to the series around May/June 2011 to Netflix. The seasons were therefore removed from Expressmedia.ca where Manufacture-On-Demand DVDs had been available for sale for several years. All 8 seasons were made available in the US on Netflix's streaming service July 15, 2011, although as of December 2011 the show has failed to appear on Netflix's Canadian streaming service. On July 17, 2012, Netflix stopped featuring it altogether. Seasons 1 and 2 were later added on to  Hulu  the same year.\nLike other previous Cartoon Network shows, Samurai Jack DVDs were released by  Warner Home Video  between 2002 and 2007. The DVDs include episode numbers in Roman numerals as they appear at the end of each episode but remain untitled. Season 1 was released on Netflix streaming service in 2013.\nOn January 20, 2015, it was announced that the first five seasons of M*A*S*H would be available on  Netflix 's instant streaming service beginning February 1, 2015. This marked the first time the series was made available on an internet platform. As of July 1, 2015, all 11 seasons were available; syndicated versions of hour-long episodes were utilized for streaming, splitting these shows into two parts. In contrast to the DVD sets, the Netflix streams did not have an option for disabling the laugh track on the soundtrack. On April 1, 2016, M*A*S*H was removed from Netflix due to its contract to stream the series expiring.\nIn 1998, about a year after Netflix's founding, the company grew by starting in the  DVD by mail  business. In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and  Blu-ray  rental service. The company expanded internationally with streaming made available to Canada in 2010 and continued growing its streaming service from there; by January 2016, Netflix was available in over 190 countries. Netflix entered the production business in 2013, debuting its first series,  House of Cards . It greatly expanded the production of both film and television series since then, offering \" Netflix Original \" content through its online library of films and television. Netflix is releasing an estimated 126 original series or films in 2016, more than any other network or cable channel.\nThe initial launches in Canada and in Latin America happened (albeit barely) before Netflix's 2011 controversy in the United States. In September of that year, the company decided to switch to two separate plans (one for streaming and one for DVD), hiked its prices accordingly, and attempted a move to two websites (one for streaming and one for DVD rentals). The change to its business model was accompanied by a loss of approximately one million American users and a plunging stock price. Prior to announcing the change to service stock was valued at just around $300, after the price it plunged to less than $53 a share. Prior to this debacle, Netflix had been having its most successful quarter, mainly due to the decision to expand to Latin America. The company quickly lost all the money it made in the quarter it announced growth to Latin America, was forced to apologize, and rethink its changing model.\nIn July 2011, Netflix announced that subscription prices were changing: that DVD rental prices would drop by 20%, but that the initially free streaming service would now be charged. For many customers this represented a savings, but for the group that both received discs and enjoyed streaming, it would result in a cost increase of up to 60%. The move led to reported customer backlash, cancellations, less than projected subscriber growth, and a decline in stock price. In response, Netflix admitted to poor public relations decisions in announcing the change but kept its policy in place.\nOn September 18, 2011, Netflix announced that it would split out and rebrand its DVD-by-mail service as Qwikster. CEO Reed Hastings justified the decision, stating that \"we realized that streaming and DVD by mail are becoming two quite different businesses, with very different cost structures, different benefits that need to be marketed differently, and we need to let each grow and operate independently.\" It was also announced that the re-branded service would add video game rentals. The decision to split the services was widely criticized; it was noted that the two websites would have been autonomous from each other (with ratings, reviews, and queues not carrying over between them), and would have required separate user accounts. Additionally, the two websites would require separate subscriptions, meaning that a bundle of DVD-by-mail and streaming service now cost US$16 per-month rather than $10.\nNetflix's  video on demand  streaming service, formerly branded as Watch Now, allows subscribers to stream television series and films via the Netflix website on  personal computer s, or the Netflix software on a variety of supported platforms, including  smartphone s and  tablets ,  digital media player s,  video game console s, and  smart TV s According to a  Nielsen  survey in July 2011, 42% of Netflix users used a standalone computer, 25% used the  Wii , 14% by connecting computers to a television, 13% with a  PlayStation 3  and 12% an  Xbox 360 .\nOn October 10, 2011, Netflix announced that it had shelved the planned re-branding in response to customer feedback, and that the DVD-by-mail and streaming services would continue to operate through a single website under the Netflix brand. However, the pricing increase was not reversed.  Netflix stated that it had lost 800,000 subscribers in the fourth quarter of 2011—a loss partially credited to the poor reception of the aborted re-branding.\nOn September 1, 2011, Starz announced that it would not renew its streaming agreement with Netflix, which ended on February 28, 2012; movie titles that are available on DVD from  Sony Pictures , Disney and other studios that maintain pay television distribution deals with Starz were not affected and can be acquired from Netflix by this method. With the expiration of the Netflix deal, film content from studios with which Starz maintains broadcast rights were no longer available for online streaming, particularly as Netflix and certain similar services such as  Vudu  did not have separate streaming rights to films from these individual studios. Prior to the beta launch of its Starz Online service (which became StarzPlay upon its official launch), Starz announced on November 18, 2011 that it was developing a streaming application for mobile devices, allowing the network's subscribers – and in early reports, speculation that possibly non-subscription television subscribers would be allowed as well – to view Starz's series and film content. The app was released on October 9, 2012 for the iPad, iPhone and iPod Touch, and on May 7, 2013 for  Android  devices. An app for the  Xbox 360  was released on December 3, 2013, followed by an app for the  Xbox One  on August 5, 2014 (both are available for no extra charge to  Xbox Live  Gold members).\nAlthough it is not Andrews's first effort as a director—that would be  Touch Me in the Morning , shot in 1999 and released by  Troma Entertainment  on DVD January 2006) -- Trailer Town is the first film Andrews directed to receive national distribution on DVD, through Troma. Andrews started a distribution relationship with Troma after his short film, Dribble, won the top prize at the 2004  Tromadance  Film Festival in January 2004. Trailer Town and Dribble, included as part of The Best of  Tromadance , Volume 3, were both released on DVD by Troma later in 2004. Troma has since released a number of Andrews's films and plans to released a box set with five previously-unreleased features in 2007. Before his deal with Troma, Andrews would distribute the movies himself, mostly through his website. While previously available for on-demand viewing and DVD rental on  Netflix , as of August 2010 Trailer Town was no longer available through Netflix in either DVD or streaming format. As of July 2012 it has returned to Netflix in DVD format.\nSarandos sees Netflix as a digital product, where the balance between distributing physical bits of content versus streaming digital content would be cheaper as both broadband and Netflix grew, i.e., postal economics vs. streaming economics. This was something that Sarandos said he and his team was closely analyzing at a micro fiscal level. The shift away from the DVD business comes from this evaluation of new model focused on streaming, and includes original programming, which is one of the main responsibilities of Sarandos' work at Netflix.\nBeginning in January 2011, seasons one through four were also available on the  Netflix  \" Watch Instantly \" service. As of 1 January 2013, seasons one through four were no longer       available on Netflix, as they unexpectedly did not renew. However, from 11 November 2013 through 5 November 2016, all four seasons were once again available for  online streaming .  The mini-series \"Farscape: The Peacekeeper Wars\" is also available from Netflix on DVD.As of February 2, 2014 HULU also offered two of the 4 seasons on their streaming service as well.\nHome cinema, also called home theater or home theatre, refers to home entertainment audio-visual systems that seek to reproduce a  movie theater  experience and mood using  consumer electronics -grade video and  audio  equipment that is set up in a room or backyard of a private home. In the 1980s, home cinemas typically consisted of a movie pre-recorded on a LaserDisc or VHS tape; a   LaserDisc  or  VHS  player; and a heavy, bulky large-screen  cathode ray tube  TV set. In the 2000s, technological innovations in sound systems, video player equipment and TV screens and  video projector s have changed the equipment used in home theatre set-ups and enabled home users to experience a higher-resolution screen image, improved sound quality and components that offer users more options (e.g., many of the more expensive  Blu-ray  players in 2016 can also  \"stream\"  movies and TV shows over the  Internet  using subscription services such as  Netflix ). The development of Internet-based subscription services means that 2016-era home theatre users do not have to commute to a  video rental store  as was common in the 1980s and 1990s (nevertheless, some movie enthusiasts buy DVD or Blu-ray discs of their favourite content).\nDigimon Adventure was produced by  Toei Animation  and ran for 54 episodes on  Fuji TV  in  Japan  between March 7, 1999 and March 26, 2000.  Saban Entertainment  licensed the series in North America and produced an English-language version which aired on  Fox Kids  between August 14, 1999 and June 24, 2000. The English version featured an original soundtrack and made changes to character names, as well as edits pertaining to certain aspects such as violence to make the series more suitable for younger audiences. The series was released on DVD by  Twentieth Century Fox  (Saban's parent company) in 2000 and by  Buena Vista Home Entertainment  in 2002. A complete DVD boxset of the English dub was released by  New Video  Group on October 9, 2012 in the U.S and was released by  Madman Entertainment  on June 18, 2014 in Australia. Digimon Adventure and its sequel, Digimon Adventure 02, were added to the  Netflix  Instant Streaming service on August 3, 2013 in separate English dubbed and Japanese subtitled versions. The initial subtitles used were incomplete and contained many translation errors, and Toei has responded by gradually replacing the older subtitles with newer, more accurate tracks beginning the day of the initial series upload. The series was removed on August 1, 2015, after nearly two years on Netflix when  Crunchyroll  acquired streaming rights to the English dubbed versions and  Funimation  acquired rights to the English subtitled versions, the English dubbed version of Adventure returned to Netflix while the English subtitled version of Adventure are now exclusive to Funimation.\nThe competition was held by  Netflix , an online  DVD -rental and video streaming service, and was open to anyone not connected with Netflix (current and former employees, agents, close relatives of Netflix employees, etc.) or a resident of  Cuba ,  Iran ,  Syria ,  North Korea ,  Myanmar  or  Sudan . On 21 September 2009, the grand prize of  was given to the  BellKor's Pragmatic Chaos  team which bested Netflix's own algorithm for predicting ratings by 10.06%.\nIn March 2010, after several various partial  VHS  and  DVD  releases,  Image Entertainment  released the complete series as a boxed set in the U.S. with all 26 episodes in a three-DVD set King Arthur and the Knights of Justice: The Complete Animated Series. The whole series was available for free watching through  Internet streaming  at the  Lycos ' SyncTV service. As of 2011, it now available on Kidlet. Between 2012 and 2014, it was available for instant streaming on  Netflix .\nBy 2010, Netflix's streaming business had grown so quickly that within months the company had shifted from the fastest-growing customer of the  United States Postal Service 's  first-class service  to the largest source of Internet streaming traffic in North America in the evening. In November, it began offering a standalone streaming service separate from DVD rentals. On September 18, 2011, Netflix announced its intentions to rebrand and restructure its DVD home media rental service as an independent  subsidiary  called  Qwikster , separating DVD rental and streaming services. Andy Rendich, a 12-year Netflix veteran, was to be CEO of Qwikster. Qwikster would carry  video game s whereas Netflix did not. However, in October 2011, Netflix announced that it would retain its DVD service under the name Netflix and would not, in fact, create Qwikster for that purpose.\nBlockbuster's U.S. online operation started with around 10 warehouses; further expansions every year brought that number to 41, plus more than 1400 stores in the Blockbuster Online network. Most Blockbuster independent franchises did not honor the Total Access program. The company had 1.5 million subscribers at the end of the third quarter of 2006. Blockbuster's move to follow the business pattern with its online rentals as was established by Netflix prompted Netflix to sue Blockbuster for patent infringement. Blockbuster counter sued with a counterclaim alleging deceptive practices with its patent which it alleged was designed to maintain an illegal monopoly. The suits were eventually settled, and while the terms were not disclosed it was later reported that Netflix recorded a settlement payment from Blockbuster of $4.1 million in the second quarter of 2007.\nNetflix has been one of the most successful  dot-com ventures . In September 2002,  The New York Times  reported that, at the time, Netflix mailed about 190,000 discs per day to its 670,000 monthly subscribers. The company's published subscriber count increased from one million in the fourth quarter of 2002 to around 5.6 million at the end of the third quarter of 2006, to 14 million in March 2010. Netflix's early growth was fueled by the fast spread of  DVD player s in households; in 2004, nearly two-thirds of United States homes had a DVD player. Netflix capitalized on the success of the DVD and its rapid expansion into United States homes, integrating the potential of the Internet and e-commerce to provide services and catalogs that bricks-and-mortar retailers could not compete with. Netflix also operates an online affiliate program which has helped to build online sales for DVD rentals. The company offers unlimited vacation time for salaried workers and allows employees to take any amount of their paychecks in stock options.\nOn April 4, 2006, Netflix filed a  patent infringement  lawsuit in which it demanded a  jury trial  in the  United States District Court for the Northern District of California , alleging that Blockbuster's  online DVD rental  subscription program violated two patents held by Netflix. The first  cause of action  alleged Blockbuster's infringement of U.S. Patent No. 7,024,381 (issued April 4, 2006; only hours before the lawsuit was filed) by copying the \"dynamic queue\" of DVDs available for each customer, Netflix's method of using the ranked preferences in the queue to send DVDs to subscribers, and Netflix's method permitting the queue to be updated and reordered. The second cause of action alleged infringement of Patent No. 6,584,450 (issued June 24, 2003), which covers in less detail the subscription rental service as well as Netflix's methods of communication and delivery. The dispute ended a year later, on June 25, 2007, with both companies declining to disclose the terms of their legal settlement, except for a statement by Blockbuster that it would not have a major impact on its future financial performance. Blockbuster also said that the company planned to close 282 stores that year to shift focus to its online service. The company had already closed 290 stores in 2006.\nNetflix's initial business model included DVD sales and rental, although Hastings jettisoned DVD sales about a year after Netflix's founding to focus on the DVD rental by mail business. In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and Blu-ray Disc rental service.\nFollow @TIMEBusiness. When Netflix launched an instant streaming service for its movies and TV shows at the start of 2007, it was a minor perk for the companyâ\u0080\u0099s subscribers who were used to getting DVDs in the mail. Fast forward half a decade and Netflix streaming subscribers outnumber DVD subscribers by more than 11 million, and they make up about one-fourth of all Internet traffic in North America.\nFrom US DVDs to Global Streaming One of the reasons our focus in the recommendation algorithms has changed is because Netflix as a whole has changed dramatically in the last few years. Netflix launched an instant streaming service in 2007, one year after the Netflix Prize began.\nWith the launch of its Internet streaming service in 2007, Netflix was finally able to fully align its business strategy with the principles of content economics. With its video content now in a pure digital form, it was no longer subject to the constraints of a limited distribution pipeline.\nHereâ\u0080\u0099s how many people still rent Netflix DVDs by mail, and why Netflix loves it. Itâ\u0080\u0099s now been a full decade since Netflix launched its streaming service and in that time it has completely changed the company.\nIn the fourth quarter of 2016, the DVD service lost 159,000 subscribers. Though Netflix doesnâ\u0080\u0099t report the number of those who transitioned to streaming-only subscription, itâ\u0080\u0099s probably a rather high percentage. Still, thatâ\u0080\u0099s fewer people renting their DVDs, and some analysts predict that Netflix will axe the physical discs within the next five years.\nFollow @TIMEBusiness. When Netflix launched an instant streaming service for its movies and TV shows at the start of 2007, it was a minor perk for the companyâ\u0080\u0099s subscribers who were used to getting DVDs in the mail.\nNetflix Streaming and DVD New Releases for August 4th, 2014. Netflix Streaming releases include: The Killing (Netflix Original, new season), Shooter, Rounders, The Mind of a Chef (new season), Sky Captain and the World of Tomorrow, Chaplin: The Movie, Face/Off, The Den, Rocky, Hawking,... Netflix Streaming and DVD New Releases for July 21st, 2014. Netflix Streaming releases include: The Master, The Immigrant, Hitch, Downloaded, Dead in Tombstone, Manhunter, The Act of Killing, and Inside Lego.\nNetflix June 3rd, 2014 Instant New Releases. Here is a list of the current new releases and arrivals on Netflix Streaming and Netflix DVDs for June 3rd, 2014. The Adventures of Milo and Otis (1986) â\u0080\u0093 A cat and a dog...\nStatistics and facts about Netflix. Netflix is a streaming media provider based in the United States. Founded in California in 1997, the company started as a small DVD-by-mail service in the U.S., and specialized in streaming media and video on demand over the years. The number of Netflix streaming subscribers has been constantly increasing over the years, reaching a total of 86.7 million in the third quarter of 2016.\nRecommended statistics about â\u0080\u009cNetflixâ\u0080\u009d. 1  Number of Netflix subscribers 2020, by country+ Number of Netflix subscribers 2020, by country. 2  Netflix's streaming programming costs 2012-2017, by type+ Netflix's streaming programming costs 2012-2017, by type.\nAs of September 2013, for that year's third quarter report, Netflix reported its total of global streaming subscribers at 40.4 million (31.2 million in the U.S.). By the fourth quarter of 2013, Netflix reported 33.1 million U.S. subscribers.n January 2008, however, Netflix lifted this restriction, at which point virtually all rental-disc subscribers became entitled to unlimited streaming at no additional cost (however, subscribers on the restricted plan of two DVDs per month ($4.99) remained limited to two hours of streaming per month).\nIn January 2008, however, Netflix lifted this restriction, at which point virtually all rental-disc subscribers became entitled to unlimited streaming at no additional cost (however, subscribers on the restricted plan of two DVDs per month ($4.99) remained limited to two hours of streaming per month).n January 2008, however, Netflix lifted this restriction, at which point virtually all rental-disc subscribers became entitled to unlimited streaming at no additional cost (however, subscribers on the restricted plan of two DVDs per month ($4.99) remained limited to two hours of streaming per month).\nOf these subscribers, 54.75 million were from the United States. As the popularity of Netflix's streaming service has increased, the company has seen its DVD section decline. In 2017, there were 3.38 million subscribers to Netflix's DVD rental service in the United States, a decline from 11.17 million in 2011. Number of Netflix subscribers - additional information Netflix, founded in the U.S. in 1997, offers media through online streams or through a DVD-by-mail service.\nQwikster would carry video games whereas Netflix did not. However, in October 2011, Netflix announced that it would retain its DVD service under the name Netflix and would not, in fact, create Qwikster for that purpose. In April 2011, Netflix had over 23 million subscribers in the United States and over 26 million worldwide.\nNetflix Inc. (also known as Netflix, marketed and stylized as NETFLIX) is an American multinational entertainment company founded on August 29, 1997, in Scotts Valley, California, by Reed Hastings and Marc Randolph. It specializes in and provides streaming media and video on demand online and DVD by mail. In 2013, Netflix added film and television production, as well as online distribution. The company is currently headquartered in Los Gatos. In 1998, about a year after Netflix's founding, the company grew by starting in the DVD by mail business. In 2007, Netflix expanded its business with the introduction of streaming media, while retaining the DVD and Blu-ray rental service.\nEven before it began unlimited content streaming to subscribers in 2008, Netflix was well-established as a rent-from-home DVD service. Part of that success could be attributed to its breadth of movie offerings; its library had about 75,000 after its first decade, and that number is constantly growing.\nNetflix Plans and Prices Netflix Pricing Levels as of May 25, 2014: Netflix Streaming Plans. 1 SD Screen - $7.99 a month 2 HD Screens - $8.99 a month - up to 2 Screens streaming simultaneously; 4 HD Screens - $11.99 a month - up to 4 Screens streaming simultaneously; Netflix DVD Rental Plans. 1 DVD at-a-time - $7.99 a month 2 DVD at-a-time - $11.99 a month 3 DVD at-a-time - $15.99 a month 4 DVD at-a-time - $21.99 a month 5 DVD at-a-time - $27.99 a month 6 DVD at-a-time - $32.99 a month 7 DVD at-a-time - $37.99 a month 8 DVD at-a-time - $43.99 a month Netflix Blue-ray Rental Plans\nNetflix Inc. (also known as Netflix, marketed and stylized as NETFLIX) is an American multinational entertainment company founded on August 29, 1997, in Scotts Valley, California, by Reed Hastings and Marc Randolph. It specializes in and provides streaming media and video on demand online and DVD by mail. In 2013, Netflix added film and television production, as well as online distribution. The company is currently headquartered in Los Gatos.", "key": "49_4", "timestamp": "2020-06-23 21:18:59.085860", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}