{"input_text": "The film has a  Rotten Tomatoes  score of 82% based on reviews from 38 critics. The critical consensus reads: \"A magical journey about the power of a young boy's imagination to save a dying fantasy land, The NeverEnding Story remains a much-loved kids adventure.\"  Metacritic  gives the film a score of 46/100 based on reviews from 10 critics.\nThe NeverEnding Story (German: Die unendliche Geschichte) is a 1984  West German -produced English language  epic   fantasy film  based on the  novel of the same name  by  Michael Ende , about a boy who reads a magical book that tells a story of a young warrior whose task is to stop a dark storm called the Nothing from engulfing a fantasy world.\nThe NeverEnding Story (German: Die unendliche Geschichte) is a 1984  West German -produced English language  epic   fantasy film  series based on the  novel of the same name  by  Michael Ende .\nThe NeverEnding Story  was the first film adaptation of the novel. It was released in 1984, directed by  Wolfgang Petersen  and starring  Barret Oliver  as Bastian,  Noah Hathaway  as Atreyu, and  Tami Stronach  as the Childlike Empress. It covered only the first half of the book, ending at the point where Bastian enters Fantasia (Fantastica). Ende, who was reportedly \"revolted\" by the movie, requested they halt production or change the movie's name, as he felt it had drastically deviated from his novel; when they did neither, he sued them and subsequently lost the case.  The music was composed by  Klaus Doldinger . Some electronic tracks by  Giorgio Moroder  were added to the US version of the movie, as well as the titlesong Never Ending Story composed by  Giorgio Moroder  and  Keith Forsey  becoming a chart success for  Limahl , the former singer of  Kajagoogoo .\nThe role was portrayed by  Tami Stronach  in  Wolfgang Petersen 's  1984  adaptation, by  Alexandra Johnes  in The NeverEnding Story II: The Next Chapter (1990) and by  Julie Cox  (apparently as an adolescent) in The NeverEnding Story III (1994). In the movies, her hair is dark, rather than white, and in the first movie, she is  dressed like a bride .\n~ Gmork about the Nothing. The Nothing is the main antagonist and primary threat faced by the protagonist of the German novel Die unendliche Geschichte (The Neverending Story) and its 1984 movie adaptation.\n[â\u0080\u0093]tricky_fish 3 points4 points5 points 3 years ago (1 child) It even fits with the theme of the book: The story of the Empress is read by an ordinary boy whose story is read by the reader. Who in turn may be the subject of some other book; who knows. I think that this meaning of the neverending story got lost when the third layer became a movie.\nSynopsis: THE NEVER ENDING STORY centers on young Bastian Bux, who escapes his troubled life in a dusty old bookstore. The store owner tells him not to look at the book The NeverEnding Story, but Bastian does anyway. He becomes engrossed in the story, in which boy warrior Atreyu seeks to save the land of Fantasia from becoming destroyed by a mythical force known as the Nothing.\nThe Neverending Story (German: Die unendliche Geschichte) is a German fantasy novel by Michael Ende that was first published in 1979. An English translation, by Ralph Manheim, was first published in 1983. The novel was later adapted into several films. 1 Plot summary.\nThe NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nRate this answer: Two comments. (1) I'm amazed that you came here to ask that question instead of just pulling up www.yahoo.com and typing in [horse Neverending Story] Well, you got the answer, but MAN! did you go about it the long way!!!! and (2) to add to the comment above about the horse dying.\nThe NeverEnding Story (German: Die unendliche Geschichte) is a 1984 West German-produced English language epic fantasy film based on the novel of the same name by Michael Ende, about a boy who reads a magical book that tells a story of a young warrior whose task is to stop a dark storm called the Nothing from engulfing a fantasy world.\nThe name of Atrayu's horse in the neverending story was Artax. What is the horses name from Neverending story The name of Atrayu's horse in the neverending story was Artax. for now! What is the name of the horse off of the Neverending story Artax is the name of the horse in The Neverending Story. Have a fun weekend. ! Ask us Anything.\nThe Neverending Story (German: Die unendliche Geschichte) is a German fantasy novel by Michael Ende that was first published in 1979. The standard English translation, by Ralph Manheim, was first published in 1983.The novel was later adapted into several films.he NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nThe NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.The music was composed by Klaus Doldinger.he NeverEnding Story was the first film adaptation of the novel. It was released in 1984, directed by Wolfgang Petersen and starring Barret Oliver as Bastian, Noah Hathaway as Atreyu, and Tami Stronach as the Childlike Empress.\nThe Neverending Story (German: Die unendliche Geschichte) is a German fantasy novel by Michael Ende, originally released in 1979, with an English translation published in 1983.A troubled, insecure young boy named Bastian who loves to read happens upon a antique bookstore owned by a Mr. Coreander, when hiding from some bullies.\nPlot summary. The book centers on a boy, Bastian Balthazar Bux, a small and strange child who is neglected by his father after the death of Bastian's mother. While escaping from some bullies, Bastian bursts into the antique book store of Carl Conrad Coreander, where he finds his interest held by a book called The Neverending Story. The Neverending Story (German: Die unendliche Geschichte) is a German fantasy novel by Michael Ende that was first published in 1979. An English translation, by Ralph Manheim, was first published in 1983. The novel was later adapted into several films.", "key": "33_2", "timestamp": "2020-06-23 21:18:59.007969", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}