{"input_text": "Pinnipeds themselves are subject to predation. Most species are preyed on by the  killer whale  or orca. To subdue and kill seals, orcas continuously ram them with their heads, slap them with their tails and fling them in the air. They are typically hunted by groups of 10 or fewer whales, but they are occasionally hunted by larger groups or by lone individuals. Pups are more commonly taken by orcas, but adults can be targeted as well. Large  shark s are another major predator of pinnipeds—usually the  great white shark  but also the  tiger shark  and  mako shark . Sharks usually attack by ambushing them from below. The prey usually escapes, and seals are often seen with shark-inflicted wounds. Otariids typically have injuries in the hindquarters, while phocids usually have injuries on the forequarters.\nWell-known species such as the  great white shark ,  tiger shark ,  blue shark ,  mako shark , and the  hammerhead shark  are  apex predator s—organisms at the top of their underwater  food chain . Many shark populations are threatened by human activities.\nAmong the most dangerous to humans are: Great white; Tiger shark; Bull shark; Oceanic White tip; Gray sharks (territorial?) Mako; Only a few species consider people as prey. They usually attack mistaking humans for marine animals on which they feed (mammals or sea turtles). Most of the other sharks attack are provoked (feeding, spearfishing, bleeding, etc.) Sharks donâ\u0080\u0099t have many predators.\nThey have several sets of replaceable teeth. Well-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.hey have several sets of replaceable teeth. Well-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nSharks are found in all seas and are common to depths of 2,000 metres (6,600 ft). They generally do not live in freshwater although there are a few known exceptions, such as the bull shark and the river shark, which can survive and be found in both seawater and freshwater.ell-known species such as the great white shark, tiger shark, blue shark, mako shark, and the hammerhead shark are apex predators â\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.\nBlue sharks eat a significant amount of squid, while tiger sharks are known to eat sea turtles. Smooth dogfish sharks eat crabs and lobsters, and hammerhead sharks prefer stingrays. Some sharks that are quick and large enough also hunt sea mammals. Great white sharks, tiger sharks and mako sharks have been known to eat sea lions, seals, dolphins, porpoises and sea birds. They also prey on large fish like mackerel and tuna. The largest shark, the whale shark, doesn't hunt for its food.\nA sharkâ\u0080\u0099s tooth shape is dependent upon its diet. For instance, the shortfin mako razor like teeth tear flesh, the tiger shark has piercing teeth to cut flesh, and the zebra shark has dense flattened teeth because it feasts upon mollusks. 13. Whale sharks have 3,000 little teeth that are of little use.\nThe most dangerous sharks are the Great White shark, the Tiger shark, the Hammerhead shark, the Mako shark and the Bull shark. On average, there are only about 100 shark attacks each year and only 10 of those result in a human death. You should check it out from their perspective, though! People kill thousands of sharks in a year for sport and for food. Shark skins are used to make products like any other leather would be. Up until the 1950's, shark livers were used as a vitamin A supplement. Shark fin soup and shark steaks are both eaten in many countries (Mako, seen in the top photo, is the most popular in the United States).\nWell-known species such as the great white shark, tiger shark, blue shark, mako shark, thresher shark, and the hammerhead shark are apex predatorsâ\u0080\u0094organisms at the top of their underwater food chain. Many shark populations are threatened by human activities.", "key": "32_11", "timestamp": "2020-06-23 21:18:59.002528", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}