{"input_text": "Wonder Man debuted in the  superhero -team title  The Avengers  #9 ( cover-date d Oct. 1964), but appeared to die in that issue. Four years later, Avengers #58 (Nov. 1968) revisited the events of #9, explaining that the Avengers had electronically saved Wonder Man's mind in a computer. Wonder Man was not seen again until The Avengers #102 (Aug. 1972), where he made a cameo appearance in a comatose state. Wonder Man's body was revived by the villain  Kang  in The Avengers #131-132 (Jan.–Feb. 1975), and then again by the  Black Talon  in The Avengers #152 (Oct. 1976), and finally by the  Living Laser  in The Avengers Annual #6 (1976). After this last encounter, Wonder Man finally recovered his faculties and joined the Avengers in a full-time capacity in Avengers #160 (June 1977).\n[[File:powermanatlas.jpg|thumb|150px|left|Erik Josten makes his first appearance (where he was known as Power Man). From The Avengers #21 (October 1965). Art by  Jack Kirby .]]Erik Josten was born in  Milwaukee, Wisconsin . A former AWOL Marine turned mercenary, he is employed by  Baron Heinrich Zemo  as head of his South American security/mercenary force.  After Zemo's death, Josten is convinced by the  Enchantress  to undergo the same 'ionic-ray' treatment (from a machine invented by Zemo) as  Simon Williams (Wonder Man) , making Josten super-strong (though not as strong as Wonder Man since the treatment was specifically calibrated to Williams and the Enchantress wasn't aware it had to be tailored to the subject). Taking the name \"Power Man\", he becomes the Enchantress' partner and battles the  Avengers  at her request. She used illusions to turn the city against the Avengers, though finally  Captain America  used a tape recording to prove the Avengers were innocent. He becomes a professional supervillain and partners with the  Swordsman , and the two fight the Avengers again under the leadership of the brainwashed  Black Widow . Alongside the Swordsman, he becomes an unwitting pawn of the  Red Skull 's, and fights Captain America. He briefly serves as an agent of the  Mandarin . He later fights the Avengers again as a member of the first  Lethal Legion .\nAlbert Elwood made a single appearance as the Crimson Avenger, in  World's Finest Comics  #131 (February 1963), in a story entitled \"The Mystery of the Crimson Avenger\". Eccentric inventor Albert Elwood adopted the guise and attempted to help Superman, Batman and Robin thwart the robberies of the Octopus Gang. After the requisite identity confusion when one of the gang members assumed the Crimson Avenger's identity, Elwood did help the heroes capture the gang, and retired right afterward. He had many sophisticated gadgets, but his efforts often proved counterproductive, more a hindrance than a help. He did mention that he had \"taken the name of a former lawman,\" meaning the by-then long defunct original Crimson Avenger. After the introduction of the DC Comics multiverse in the 1960s, the original Crimson Avenger (Lee Travis) was explained to have lived on Earth-Two; Albert Elwood's Earth has never been specified.\nWonder Man (Simon Williams) is a  fictional   superhero  appearing in  American comic book s published by  Marvel Comics . Created by writer  Stan Lee  and artists  Don Heck  and  Jack Kirby , he  first appeared  in  The Avengers  #9 (Oct. 1964). In 2012, Wonder Man was ranked 38th in  IGN 's list of \"The Top 50 Avengers\".\nThe Avengers are a fictional team of  superhero es appearing in  American comic book s published by  Marvel Comics . The team made its debut in  The Avengers  #1 (Sept. 1963), created by writer-editor  Stan Lee  and artist/co-plotter  Jack Kirby , inspired by the success of  DC Comics '  Justice League of America .\nThe Swordsman first appeared as a supervillain in  The Avengers  Vol. 1 #19 (1965). He went on to appear in Avengers Vol. 1 #20, 30, 38, 65, 78 and 79 (1965–1970). The Swordsman changed his ways and became a superhero in Avengers Vol. 1 #100 (1972) and later became a member of the Avengers in Avengers Vol. 1 #112-130 (1973–1974),  Defenders  Vol. 1 #9-11 (1973),  Captain Marvel  Vol. 1 #32-33 (1974),  Fantastic Four  Vol. 1 #150 (1974), Giant-Size Avengers Vol. 1 #2 (1974) and  Avengers Spotlight  #22 (1989). Later, the Cotati-possessed Swordsman appeared in Avengers Vol. 1 #134, 135, 157, 160 (1975–1977), Giant-Size Avengers Vol. 1 #4 (1975) and  West Coast Avengers  Vol. 2 #39 (1988). The Swordsman has been a member of various supervillain groups. The character has appeared as a member of the  Lethal Legion  in Avengers Vol. 1 #78-79 (1970) and  Iron Man  Annual #7 (1984), the  Emissaries of Evil  in  Alpha Flight  Special Vol. 2 #1 (1992), and the  Legion of the Unliving  in Avengers Annual #16 (1987),  Avengers West Coast  Vol. 2 #61 (1990) and Avengers Vol. 3 #10-11 (1998). Introduced as a villainous counterpart to  Hawkeye  in the pages of the Avengers, the Swordsman went on to appear in Hawkeye Vol.1 #1 (1983),  Solo Avengers  #2 (1988), Hawkeye Vol.3 #3 (2004) and  Hawkeye: Blindspot  #1 (2011) as part of Hawkeye's origins. The Swordsman also battled  Captain America  in  Tales of Suspense  #88 (1967) and Captain America #105 (1968). The 2010-2011 crossover storyline  Chaos War  saw the return of the Swordsman. He was one of the central characters in the tie-in series Chaos War: Dead Avengers (2010–2011). The Swordsman also featured in Chaos War #2 & 4-5 (2010–2011) and Chaos War:  Ares  #1 (2010).\nThe Crimson Avenger (Lee Walter Travis) is a  masked   crime fighter  in the  and the first to use the name \" Crimson Avenger .\" He first appears in  Detective Comics  #20 (October 1938) - thus being DC's first masked hero - and was created by Jim Chambers.\nRare Captain America Comics. While there are some valuable Silver Age comic books featuring Captain America, none are truly rare comic books in the way that the Golden Age issues are. You'll come across Avengers comics much more often than the Captain America Comics of the 1940s and 50s.\nName: Hawkeye/Clint Barton. First comic appearance: Tales of Suspense #57 (September, 1964), written by Stan Lee, penciled and inked by Don Heck. First appearance in The Avengers (comic): Issue 16 (May, 1965), written by Lee, penciled by Jack Kirby.\nThe Avengers are a fictional team of superheroes appearing in American comic books published by Marvel Comics. The team made its debut in The Avengers #1 (Sept. 1963), created by writer-editor Stan Lee and artist/co-plotter Jack Kirby, inspired by the success of DC Comics' Justice League of America. Labeled Earth's Mightiest Heroes, the Avengers originally consisted of Hank Pym, the Hulk, Iron Man, Thor, and the Wasp.\nThe team debuted in The Avengers #1 (Sept. 1963). Much like the Justice League, the Avengers were an assemblage of pre-existing superhero characters created by Lee and Jack Kirby. Kirby did the artwork for the first eight issues only, in addition to doing the layouts for issue #16.\nThe team made its debut in The Avengers #1 (Sept. 1963)... The Avengers is a team of superheroes, appearing in comic books published by Marvel Comics. The team made its debut in The Avengers #1 (Sept. 1963)... The Avengers is a team of superheroes, appearing in comic books published by Marvel Comics. The team made its debut in The Avengers #1 (Sept. 1963), created by writer-editor Stan Lee and artist/co-plotter Jack Kirby, following the trend of super-hero teams after the success of DC Comics' Justice League of America.\nThe precursor to the Justice League was the Justice Society of America, who first appeared nearly two decades earlier, in All-Star Comics #3 of December 1940. The first appearance of the Avengers as a team was in their self-titled series, in September 1963.\nComics (narrative art form) The Justice League of America preceded the Avengers by over three years. The first appearance of the Justice League of America in comics was in The Brave and the Bold #28 in March 1960. The iconic cover featured five heroes battling Starro the Conqueror. In November 1960, the League got its own series, with the first appearance of the supervillain Despero.", "key": "61_2", "timestamp": "2020-06-23 21:18:59.198772", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}