{"input_text": "Trauma  is the most frequent cause of peripheral nerve lesions. There are two classifications of trauma which include civilian trauma and military trauma. Civilian trauma is most commonly caused by  motor vehicle accidents  but also by lacerations caused by glass, knives, fans, saw blades or fractures and occasionally  sports injuries . Of the civilian injuries, stretch injuries are the most common types and are considered to be a closed injury, where the tissue is unexposed. Stretch injures are commonly the result of  dislocation , such as a  shoulder dislocation  that stretches nerves. Opposite of civilian trauma, there is military trauma which most commonly results in open injuries from blasts often by bombs or  improvised explosive devices . Other mechanisms of injury are less common but include  ischemia ,  thermal ,  electric shock ,  radiation ,  adverse reactions to certain chemotherapy medications , percussion and vibration.\nThe most common etiology of piriformis syndrome is that resulting from a specific previous injury due to  trauma . Large injuries include trauma to the buttocks while \"micro traumas\" result from small repeated bouts of stress on the  piriformis  itself. To the extent that piriformis syndrome is the result of some type f trauma and not neuropathy, such secondary causes are considered preventable, especially those occurring in daily activities: according to this theory, periods of prolonged sitting, especially on hard surfaces, produce minor stress that can be relieved with bouts of standing. An individual's environment, including lifestyle factors and physical activity, determine susceptibility to trauma of any given type. Although empirical research findings on the subject have never been published, many believe that taking sensible precautions during high-impact sports and when working in physically demanding conditions may decrease the risk of experiencing piriformis syndrome, either by forestalling injury to the muscle itself or injury to the nerve root that causes it to spasm. In this vein, proper safety and padded equipment should be worn for protection during any type of regular, firm contact (i.e., American football, etc.). In the workplace, individuals are encouraged to make regular assessments of their surroundings and attempt to recognize those things in one's routine that might produce micro or macro traumas.  No research has substantiated the effectiveness of any such routine, however, and participation in one may do nothing but heighten an individual's sense of worry over physical minutiae while have no effect in reducing the likeliness of experiencing or re-experiencing piriformis syndrome.\nThe most common injury type suffered by musicians is  repetitive strain injury  (RSIs). A survey of orchestral performers found that 64–76% had significant RSIs. Other types of  musculoskeletal disorder s, such as  carpal tunnel syndrome  and  focal dystonia , are also common.\nFootball is a full-contact sport, and injuries are relatively common. Most injuries occur during training sessions, particularly ones that involve contact between players. To try to prevent injuries, players are required to wear a set of equipment. At a minimum players must wear a  football helmet  and a set of  shoulder pads , but individual leagues may require additional padding such as thigh pads and guards, knee pads, chest protectors, and  mouthguard s. Most injuries occur in the lower extremities, particularly in the knee, but a significant number also affect the upper extremities. The most common types of injuries are  strains ,  sprain s,  bruise s, fractures,  dislocations , and  concussions . Repeated concussions can increase a person's risk in later life for  chronic traumatic encephalopathy  and mental health issues such as  dementia ,  Parkinson's disease , and  depression . Concussions are often caused by helmet-to-helmet or upper-body contact between opposing players, although helmets have prevented more serious injuries such as  skull fracture s. Various programs are aiming to reduce concussions by reducing the frequency of helmet-to-helmet hits;  USA Football 's \"Heads Up Football\" program is aiming to reduce concussions in youth football by teaching coaches and players about the signs of a concussion, the proper way to wear football equipment and ensure it fits, and proper tackling methods that avoid helmet-to-helmet contact. However, a study in the Orthopaedic Journal of Sports Medicine found that Heads Up Football was ineffective.\nTwo of the most common injuries at the elbow are overuse injuries:  tennis elbow  and  golfer's elbow .  Golfer's elbow involves the tendon of the common flexor origin which originates at the  medial epicondyle of the humerus  (the \"inside\" of the elbow).  Tennis elbow is the equivalent injury, but at the common extensor origin (the  lateral epicondyle of the humerus ).\nThe spine consists of the spinal cord, which is a group of nerves that are protected by the individual vertebrae of the spine. The main function of the spinal cord is to send signals from the brain to other regions of the body. It is the main messenger throughout the body. Spinal cord injuries can either be complete or incomplete. If sensations and movements are lost below the injured area, the injury is complete. On the other hand when only a small portion of the feeling and movements below the injured area is lost, the injury is considered incomplete. Traumatic car accidents, sports injuries, and falls can all be a cause for either incomplete or complete spinal injury. Athletes are especially susceptible to becoming involved in high collision spinal injuries. Some of the more common injuries include any type of sprain and strain of the spinal cord. These injuries can either occur alone, or with another spinal disease. Dislocations and fractures are also common in spine injuries. Other spinal injuries include stingers and burners and cervical cord neurapraxia. Apophyseal Ring Avulsion/Fracture, Spondydololysis, and Acute Disc injury, are specifically thoracolumbar injuries, which refers to the  thoracic and lumbar regions of the spine.\nUp to five percent of  sports injuries  are concussions.  The U.S.  Centers for Disease Control and Prevention  estimates that 300,000 sports-related concussions occur yearly in the U.S., but that number includes only athletes who lost consciousness.  Since loss of consciousness is thought to occur in less than 10% of concussions, the CDC estimate is likely lower than the real number. Sports in which concussion is particularly common include football and boxing (a boxer aims to \" knock out \", i.e. give a mild traumatic brain injury to, the opponent). The injury is so common in the latter that several medical groups have called for a ban on the sport, including the American Academy of Neurology, the  World Medical Association , and the medical associations of the UK, the U.S., Australia, and Canada.\nWater polo is a contact sport, with little protective gear besides swim suits and caps with ear protectors. Among the most common serious injuries are those affecting the head and shoulders. Those induced to the head are usually caused by elbows or the ball itself. One case would be when the defense guards the offense, the defense are right behind offense trying to steal the ball or trying to stop the ball from scoring or being passed. So as a result of the offense trying to shake off the defense to either score or pass the ball, a lot of elbowing and forceful removal from the defensive grab is needed. Many times the head being the main body part out of the water is injured in such a way. Many times these injuries are intentional and can sometimes anger many players to take revenge. Another common injury would be in the shoulder. Throwing or shooting the ball with a \"cold arm\" can strain the shoulder if not warmed up properly. Also occasionally, the defensive player will sometimes pull the arm to foul the offensive player. This can also injure the shoulder. With the arm, fingers are also usually harmed, due to not catching the ball right or blocking the ball. Many sprained fingers or on a more serious scale, fractured fingers have resulted from water polo. Some of the most injured players on the field are the goalies. They have to endure the ball thrown at them at a fast speed and are expected to \"throw it down\" to prevent the ball from going into the goal and scoring. When blocking shots the ball can hit the fingers instead of the whole hand causing fractures and strains. Goalies have also been known to suffer nosebleeds. Other injuries take place underwater as many things can not be seen from above the surface and not much padding is used to protect the players.\nPlantar fasciitis is the most common type of plantar fascia injury and is the most common reason for heel pain, responsible for 80% of cases. The condition tends to occur more often in women, military recruits, older athletes, the obese, and young male athletes.\nThe most common causes of myalgia by  injury  are:  sprains  and  strains .\nInjuries sustained during a tornado vary in nature and in severity. The most common injuries experienced during a tornado are complex contaminated soft tissue wounds and account for more than 50% of the cases seen by emergency rooms following a tornado. These wounds will most likely be contaminated with soil and foreign bodies due to high wind speeds caused by tornadoes. Fractures are the second most common injury obtained after a tornado strikes and account for up to 30% of total injuries. Head injuries are also commonly reported during a tornado, but severe head injuries only account for less than 10% of the total. Even though only 10% of reported head injuries are severe, they are the most common cause of death following a tornado. Blunt trauma to the chest and abdomen are also injuries obtained following a tornado, but only account for less than 10% of overall injuries.\nThe most common knee structure damaged in  skiing  is the medial collateral ligament, although the  carve turn  has diminished the incidence somewhat. MCL strains and tears are also fairly common in  American football . The  center  and the  guards  are the most common victims of this type of injury due to the grip trend on their cleats, although sometimes it can be caused by a helmet striking the knee. The number of football players who get this injury has increased in recent years. Companies are currently trying to develop better cleats that will prevent the injury. MCL is also crucially affected in breaststroke and many professional swimmers suffer from chronic MCL pains.\nHead trauma is classified as either open or closed head injury. In  open head injury   the skull is penetrated and brain tissue is destroy in a localized area.  Closed head injury  is more common, the skull is not penetrated but there is an impact of the brain against the skull which can create permanent structural damage (e.g.  subdural hematoma ). With both types, symptoms may disappear or persist over time.  It has been found that typically the longer the length of time spent unconscious and the length of  post-traumatic amnesia  the worse the prognosis for the individual.  The cognitive residual symptoms of head trauma are associated with the type of injury (either open head injury or closed head injury)and the amount of tissue destroyed. Symptoms of closed injury head trauma tend to be the experience of intellectual deficits in  abstract reasoning ability , judgement, and memory, and also marked personality changes. Symptoms of open injury head trauma tend to be the experience of classic neuropsychological syndromes like  aphasia , visual-spatial disorders, and types of memory or  perceptual disorder s.\nDiaphragmatic injuries are present in 1–7% of people with significant blunt trauma and an average of 3% of abdominal injuries. A high  body mass index  may be associated with a higher risk of diaphragmatic rupture in people involved in vehicle accidents.  It is rare for the diaphragm alone to be injured, especially in blunt trauma; other injuries are associated in as many as 80–100% of cases.  In fact, if the diaphragm is injured, it is an indication that more severe injuries to organs may have occurred.  Thus, the mortality after a diagnosis of diaphragmatic rupture is 17%, with most deaths due to lung complications.  Common associated injuries include  head injury , injuries to the  aorta ,  fractures  of the  pelvis  and  long bone s, and  laceration s of the  liver  and  spleen .  Associated injuries occur in over three quarters of cases.\nSlips, trips and falls account for over a third of all injuries that happen at work. Incorrect handling of items was the most common cause of injuries that led to absences from work of more than 7 days. Upper limb injuries represented 47.3% of workplace injuries in 2010-2011, the most common area injured.\nCommon peroneal nerve injury is more common in people:\nAccording to the Hughston Health Alert, \"Lacerations to the head, scalp, and face are the most frequent types of injury [in hockey].\" Even a shallow cut to the head results in a loss of a large amount of blood. Not only are lacerations common, \"it is estimated that direct trauma accounts for 80% of all [hockey] injuries. Most of these injuries are caused by player contact, falls and contact with a puck, high stick and occasionally, a skate blade.\" One of the causes of head injury is checking from behind. Due to the danger of delivering a check from behind, many leagues, including the NHL have made this a major and game misconduct penalty (called \"boarding\"). Another type of check that accounts for many of the player-to-player contact concussions is a check to the head resulting in a misconduct penalty (called \"head contact\"). A check to the head can be defined as delivering a hit while the receiving player's head is down and their waist is bent and the aggressor is targeting the opponent player's head. The most dangerous result of a head injury in hockey can be classified as a concussion. Most concussions occur during player-to-player contact rather than when a player is checked into the boards. Checks to the head have accounted for nearly 50% of concussions that players in the National Hockey League have suffered. Concussions that players suffer may go unreported because there is no obvious physical signs if a player is not knocked unconscious. This can prove to be dangerous if a player decides to return to play without receiving proper medical attention. Studies show that, ice hockey causes 44.3% of all traumatic brain injuries among Canadian children. In severe cases, the traumatic brain injuries are capable of resulting in death. Occurrences of death from these injuries are rare, but occur all too much in a variety of sports.\nThe most common types of injuries are  strains ,  sprain s,  bruise s,  fractures ,  dislocations , and  concussions . According to the NFL Physicians Society, the most common injuries in football are \"concussions, blunt injuries to the chest such as  cardiac contusions ,  pulmonary contusion s,  broken ribs ,  abdominal injuries ,  splenic lacerations  and kidney injuries.\" Orthopedic injuries to the knee, foot, ankle, shoulder, neck and back are also common, as are muscle strains to the hamstrings, quads, calves and the abdomen.\nInjuries have always been of concern in terms of sport but youth are much more susceptible to injury considering both their immature musculoskeletal system and increasingly high intensity training. According to the U.S. Centers for Disease Control, participation in organized sports is on the rise. Nearly 30 million children and adolescents participate in youth sports just in the United States. This high rise in sport participation has led to some startling statistics, high school athletes account for an estimated 2 million injuries, 500,000 doctor visits, and 30,000 hospitalizations each year. The most common types of sports-related injuries among youth are sprains, muscle strains, bone or growth plate injuries, and repetitive motion injuries.\nThe most common sites of preserved injury and disease in theropod dinosaur in the  ribs  and  tail vertebrae . The least common sites of preserved injury are the  cranium  and forelimb in about equal frequency. The least common sites of preserved pathology are the weight-bearing bones like the  tibia ,  femur  and  sacrum . The lack of preserved injuries in skeletal elements like  femora  suggests that they were selected by evolution for resistance to breakage.\nShoulders are a common place for tissue injuries, especially if the person plays overhead sports such as tennis,  volleyball , baseball, swimming, etc.  According to Bahr’s major injury related statistics, shoulder dislocations or subluxations account for 4% of injuries in adults ages 20–30 and 20% of shoulder injuries are fractures.  Damage to the shoulder and adjacent features can fluctuate in severity depending on the person’s age, sport, position, recurring shoulder dysfunction, and many other factors.  Some other common shoulder injuries are fractures to any shoulder girdle bones i.e.  clavicle , ligamentous sprains such as  AC joint  or GH ligaments, rotator cuff injuries, different labral tears, and other acute or chronic conditions related to shoulder anatomy. In order to help limit or decrease the severity of an injury, proper maintenance and conditioning should take place. Proper warm ups, strengthening of the shoulder complex, and lifestyle choices can help bring positive lifelong use of the shoulders.\nInjury to the medial meniscus is about five times greater than injury to the lateral meniscus due to its anatomical attachment to the MCL. Lateral meniscal tears are more common in acute ACL injuries, whereas medial mensical injuries are more common in chronic ACL-deficient knees and more amenable to repair.\nA concussion is the most common type of traumatic brain injury. It can be caused by direct damage to the head, gunshot wounds, violent shaking of the head (very common in children), or force from a  whiplash  type injury. A concussion is caused when the brain receives trauma from an impact or a sudden momentum or movement change. The blood vessels in the brain may stretch, and cranial nerves may be damaged.\nInjuries to the  skin  are amongst the most common indicators that a child has been  physically abused . These injuries include  burn s and  bruise s. While also looking at the different types of abuse that occur such as neglect, sexual abuse that can also leave signs on the skin that the child has been recently or previously abused. Intentionally inflicted injuries are often in characteristic locations, patterns, and shapes that help differentiate them from accidental injury.\nFocal and diffuse brain injury are ways to classify  brain injury : focal injury occurs in a specific location, while diffuse injury occurs over a more widespread area.  It is common for both focal and diffuse damage to occur as the result of the same event; many traumatic brain injuries have aspects of both focal and diffuse injury. Focal injuries are commonly associated with an injury in which the head strikes or is struck by an object; diffuse injuries are more often found in  acceleration /deceleration injuries, in which the head does not necessarily contact anything, but brain tissue is damaged because tissue types with varying densities accelerate at different rates.  In addition to  physical trauma , other types of  brain injury , such as  stroke , can also produce focal and diffuse injuries. There may be  primary and secondary brain injury  processes.\nA patella fracture is a  fracture  of the  kneecap , which is one of the most common knee injuries. It is usually the result of a hard blow to the front of the  knee . Treatment options for patella fracture include nonsurgical and surgical options, depending on the type of fracture.\nThe most common catastrophic injury occurring in  ice hockey  is cervical spinal cord injury, which most often occur at  C5 ,  C6 , or  C7 . The most common cause is  checking from behind . Such checking was banned from hockey in 1985, which has resulted in a decreased incidence of catastrophic spinal injuries and a reduction of head and neck injuries.\nA focal traumatic injury results from direct mechanical forces (such as occur when the head strikes a windshield in a  vehicle accident ) and is usually associated with brain tissue damage visible to the naked eye.  A common cause of focal injury is  penetrating head injury , in which the skull is perforated, as frequently occurs in auto accidents, blows, and  gunshot wound s. Focal injuries typically have symptoms that are related to the damaged area of the brain. Stroke can produce focal damage that is associated with signs and symptoms that correspond to the part of the brain that was damaged.  For example, if a speech center of the brain such as  Broca's area  is damaged, problems with speech are common.\nTwo thirds of injuries occur to the upper body and one third to the lower body. This contrasts with alpine skiing where two thirds of injuries are to the lower body. The most common types of injuries are sprains, which account for around 40% of injuries. The most common point of injury is the wrists – 40% of all snowboard injuries are to the wrists and 24% of all snowboard injuries are wrist fractures. There are around 100,000 wrist fractures worldwide among snowboarders each year. For this reason the use of wrist guards, either separate or built into gloves, is very strongly recommended. They are often compulsory in beginner's classes and their use reduces the likelihood of wrist injury by half. In addition it is important for snow boarders to learn how to fall without stopping the fall with their hand by trying to \"push\" the slope away, as landing a wrist which is bent at a 90 degree angle increase the chance of it breaking. Rather, landing with the arms stretched out (like a wing) and slapping the slope with the entire arm is an effective way to break a fall. This is the method used by practitioners of judo and other martial arts to break a fall when they are thrown against the floor by a training partner.\nSports injuries are injuries that occur in athletic activities or  exercising . In the United States there are about 30 million teenagers and children alone that participate in some form of organized sport. About 3 million avid sports competitors 14 years of age and under experience sports injuries annually, which causes some loss of time of participation in the sport. The leading cause of death involving sports-related injuries, although rare, is  brain injuries . When injured the two main systems affected are the  nervous  and  vascular systems . The origins in the body where  numbness  and  tingling  occurs upon sports injuries are usually the first signs of the body telling you that the body was impacted. Thus, when an athlete complains of numbness and especially tingling, the key to a diagnosis is to obtain a detailed history of the athlete’s acquired symptom perception, determine the effect the injury had on the body and its processes, and then establish the prime treatment method. In the process to determine what exactly happened in the body and the standing effects most medical professionals choose a method of technological medical devices to acquire a credible solution to the site of injury. Prevention helps reduce potential sport injuries. It is important to establish participation in  warm-ups , stretching, and  exercises  that focus on main muscle groups commonly used in the sport of interest. Also, creating an injury prevention program as a team, which includes education on  rehydration ,  nutrition , monitoring team members “at risk”, monitoring behavior, skills, and techniques. Season analysis reviews and preseason screenings are also beneficial reviews for preventing player sport injuries. One technique used in the process of preseason screening is the functional movement screen. The functional movement screen can assess movement patterns in athletes in order to find the at risk players. Following various researches about sport injuries shows that levels of  anxiety ,  stress , and  depression  are elevated. A study in 2010 found that athletes with severe sports injuries would display higher levels of post-traumatic distress and the higher the levels of post-traumatic distress are linked with avoidant  coping skills .\nKnee injuries are very common among athletes as well as regular active people and can always be prevented.  Ligament  tears account for more than forty percent of knee injuries and the  posterior cruciate ligament  is considered one of the less common injuries. Although it is less common, there are still important measures that can be taken in order to prevent this type of knee injury. Maintaining proper exercise and sport technique is crucial for injury prevention, which include not exceeding the body or not going over the proper  range of motion  of the knee, properly warming up and cooling down\nSports injuries  are often the result of overuse or trauma to a part of the body.  An issue unique to youth athletics is that the participants’ bones are still growing, making them especially at risk for injury. Around 8,000 children are rushed to the emergency room daily because of sports injuries. High school athletes suffer approximately 715,000 injuries annually. In  American football , for instance, five times as many  catastrophic injuries  happen in high school as in  college-level competition . Injuries include heat illness and dehydration, concussions, and trauma-related deaths.  Heat illnesses are a rising concern in youth athletics. These illnesses include  heat syncope ,  muscle cramps ,  heat exhaustion ,  heat stroke  and  exertional hyponatremia .  Each year, high school athletes sustain 300,000 head injuries, of which 90% are concussions. By the start of high school, 53% of athletes will have already suffered a concussion, but fewer than 50% of them say anything because they are concerned they will be removed from play. Ice hockey, soccer, lacrosse, wrestling and basketball have a high risk of concussion, with football carrying the most risk. A history of concussion in a football player can contribute to sports-related sudden death.\nBecause of the many older adults opting to remain in the U.S. workforce, many studies have been done to investigate whether the older workers are at greater risk of occupational injury than their younger counterparts. Due to the physical declines associated with  aging , older adults tend to exhibit losses in eyesight, hearing and physical strength. Data shows that older adults have low overall injury rates compared to all age groups, but are more likely to suffer from fatal and more severe occupational injuries. Of all fatal occupational injuries in 2005, older workers accounted for 26.4%, despite only comprising 16.4% of the workforce at the time. Age increases in fatality rates in occupational injury are more pronounced for workers over the age of 65. The return to work for older workers is also extended; older workers experience a greater median number of lost work days and longer recovery times than younger workers. Some common occupational injuries and illnesses for older workers include  arthritis  and  fractures . Among older workers, hip fractures are a large concern, given the severity of these injuries.\nMotor vehicle collisions are a common source of blunt abdominal trauma. Seat belts reduce the incidence of injuries such as  head injury  and  chest injury , but present a threat to such abdominal organs as the  pancreas  and the  intestines , which may be displaced or compressed against the  spinal column .  Children are especially vulnerable to abdominal injury from seat belts, because they have softer abdominal regions and seat belts were not designed to fit them.  In children,  bicycle  mishaps are also a common cause of abdominal injury, especially when the abdomen is struck by the handlebars.  Sports injuries can affect abdominal organs such as the spleen and kidneys.  Falls and sports are also frequent mechanisms of abdominal injury in children. Abdominal injury may result from  child abuse  and is the second leading cause of child abuse-related death, after  traumatic brain injury .\nThe most common type of injury was  soft tissue  damage, usually just  bruise s, followed by  fractures , constituting 22.3% of the cases, and  lacerations , accounting for 15.5% of injuries. Other types of injuries include concussions, internal injuries,  subdural hematoma ,  spinal cord injury , or acute respiratory compromise. While rare, a few cases had severe outcomes: 4 fatalities, 2  paraplegic , and 1  quadriplegic  injuries have been documented.\nThe most common types of repetitive motion injuries are tendinitis and bursitis, injuries to tendons and bursae, respectively. These disorders are difficult to distinguish and often coexist. Tendinitis. A tendon is a white fibrous tissue that connects muscle to bone and allows for movement at all joints throughout the body.\nHead injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year. A concussion is a type of traumatic brain injury (TBI) that happens when the brain is jarred or shaken hard enough to bounce against the skull.\nTypes of brain injury There are two types of brain injury traumatic and non-traumatic. A traumatic brain injury can be classed as an open or closed injury. A closed injury is caused when the brain is bounced around in the skull due to a blow to the head or severe shaking such as in a road traffic accident. A closed motion can cause tearing, shearing or stretching of the brain tissue. These types of injury are much more common than open head injuries.\nKnee injury facts. The knee is one of the most common body parts to be injured. Types of knee injuries include sprains, strains, bursitis, dislocations, fractures, meniscus tears, and overuse injuries. Knee injuries are generally caused by twisting or bending force applied to the knee, or a direct blow, such as from sports, falls, or accidents.\nHead injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year.\nThe difference between hard and soft tissue injuries is that hard tissue injuries involve damage to bone tissue and soft tissue injuries involve damage to other types of tissues e.g. muscular tissue, tendons, ligaments, etc..Bone fractures, also known as hard tissue injuries, are less common sporting injuries than soft tissue injuries.However, hard tissue injury does sometimes happen during sporting events, especially in the case of certain more extreme sports such as downhill skiing, some equine sports and even motor sports. hard tissue injury is damage to bone tissue. A hard tissue injury is also called a  fracture  and is defined as a  loss of continuity in the substance of a bone .\nThe causes and types of injuries. 1  More injuries occur during games than training. 2  Up to 35% of injuries are caused by foul play. 3  The most common types of injuries are bruising, sprains, strains, fractures and dislocations.  Injuries to the lower body, namely the ankle and. knee, to the upper body and head are most common.\nThis leads to a concussion or closed brain injury that can cause mild or serious symptoms. A concussion is defined as a blow to the head that results in disturbance of cerebral function. Concussions are the most common type of traumatic brain injury and can, in more severe injuries, cause permanent brain damage.his leads to a concussion or closed brain injury that can cause mild or serious symptoms. A concussion is defined as a blow to the head that results in disturbance of cerebral function. Concussions are the most common type of traumatic brain injury and can, in more severe injuries, cause permanent brain damage.\nSports Injuries. Sports Shoulder Injuries. Common sporting injuries of the shoulder include dislocations, Acromioclavicular joint (ACJ) injuries, rotator cuff injuries, Labral tears, thrower's shoulder, biceps injuries, bursitis and fractures.\nDirect force crush injuries are the most common types of crush injuries. In this case, an object (or objects) applies force and destroys tissue by direct compression. Examples of this include injuries caused by falling objects and blunt trauma distributed over larger areas.\nKey Difference: A sprained ankle is when the ligament is partially torn or fully torn. An ankle fracture is when a bone in the ankle breaks. Ankle injuries are the most common injuries that people get, especially in sports. The two most common types of ankle injuries are sprain and fractures. Though these may seem similar due to the immense amount of pain that follows, they are different from each other. Sprain is milder compared to fracture. The ankle joint is made up of three bones: tibia, fibula, and talus.\nBy far, the most common injuries are sprains and strains. Obviously, some sports are more dangerous than others. For example, contact sports such as football can be expected to result in a higher number of injuries than a noncontact sport such as swimming.\nAfter a sedentary work week, end-zone catches and 36-hole weekends can take their toll in common sports injuries. The seven most common sports injuries are: Ankle sprain; Groin pull; Hamstring strain; Shin splints; Knee injury: ACL tear\nLigament injuries in athletes are common and can occur at any joint. The knee and ankle are particularly vulnerable but it is sport specific. Ligaments are strained when the joint is stressed beyond its normal range. Common causes of a ligament injury include: twisting, or landing awkwardly.It is most common when the ligaments around a particular joint are at full-stretch can cause it to tear away from the bone.The most common torn ligaments are knee ligaments and ankle ligaments.This is because the joints are weight-bearing and under high stress with change of direction sports or full contact sports.t is most common when the ligaments around a particular joint are at full-stretch can cause it to tear away from the bone. The most common torn ligaments are knee ligaments and ankle ligaments.\nTop 10 facts about the world. A sports medicine physician is a trained medical professional who diagnoses and treats injuries resulting from sports-related activities. The most common types of injuries treated by this type of doctor include sprains, strains, broken bones, knee injuries, and low back injuries.\nA concussion can be caused by direct blows to the head, gunshot wounds, violent shaking of the head, or force from a whiplash type injury. Both closed and open head injuries can produce a concussion. A concussion is the most common type of traumatic brain injury. A concussion is caused when the brain receives trauma from an impact or a sudden momentum or movement change. The blood vessels in the brain may stretch and cranial nerves may be damaged. A person may or may not experience a brief loss of consciousness.\nResolving Groin Injuries. Groin injuries are a common athletic injury in both contact and non-contact sports. Injuries to the groin can occur from direct trauma in sports such ice hockey, basketball, football, rugby, and in non-contact sports such as gymnastics. In hockey, 10% of the injuries that occur each year are groin injuries.\nThe most common sports injuries are. 1  Sprains and strains. 2  Knee injuries. 3  Swollen muscles. 4  Achilles tendon injuries. 5  Pain along the shin bone. 6  Rotator cuff injuries. 7  Fractures. 8  Dislocations.\nHamstring injuries are one of the most common strains to affect athletes and the most common type of strain to affect the lower extremity. Hamstring strains can also be one of the most disabling injuries to the lower extremity.These strains are most common amongst athletes that participate in sports that involve a lot of acceleration, deceleration, kicking, jumping, cutting, and pivoting. - sports such as soccer, rugby, football, and raquet sports.amstring strains can also be one of the most disabling injuries to the lower extremity. These strains are most common amongst athletes that participate in sports that involve a lot of acceleration, deceleration, kicking, jumping, cutting, and pivoting. - sports such as soccer, rugby, football, and raquet sports.\nCauses. Dislocated joints are caused by injury to the joints. The most common type of injuries responsible for dislocated joints are sports-related injuries. Contact sports, such as football and hockey, commonly cause joint dislocations, as do sports that involve potential falls, such as gymnastics and volleyball.he most common type of injuries responsible for dislocated joints are sports-related injuries. Contact sports, such as football and hockey, commonly cause joint dislocations, as do sports that involve potential falls, such as gymnastics and volleyball.\nPlayground, sports, and bicycle-related injuries occur most often among children between ages 5 and 14 years old. The highest rates of injury occur in sports that involve contact and collisions. More severe injuries occur during individual sports and recreational activities. Most organized sports-related injuries (62 percent) occur during practice. Types of sports and recreational activities. Consider these estimated injury statistics for 2009 from the Consumer Product Safety Commission: Basketball.\n1 A concussion can be caused by direct blows to the head, gunshot wounds, violent shaking of the head, or force from a whiplash type injury. 2  Both closed and open head injuries can produce a concussion. 3  A concussion is the most common type of traumatic brain injury.\nGroin pain is any discomfort in this area. The pain typically results from an injury caused by physical activity, such as sports. A pulled or strained muscle in the groin area is one of the most common injuries among athletes. Groin pain is a common symptom and can happen to anyone. There are some potential causes of groin pain that are more common than others. The most common cause of groin pain is a strain of the muscles, ligaments, or tendons in the groin area. This type of injury occurs most often in athletes. If you play a contact sport, such as football, rugby, or hockey, itâ\u0080\u0099s likely that youâ\u0080\u0099ve had groin pain at some point.\nCartilage damage is a relatively common type of injury. It often involves the knees, although joints such as the hips, ankles and elbows can also be affected. Cartilage is a tough, flexible tissue found throughout the body. It covers the surface of joints, acting as a shock absorber and allowing bones to slide over one another. It can become damaged as a result of a sudden injury, such as a sports injury, or gradual wear and tear (osteoarthritis).\nBy far, the most common injuries are sprains and strains. Obviously, some sports are more dangerous than others. For example, contact sports such as football can be expected to result in a higher number of injuries than a noncontact sport such as swimming.However, all types of sports have a potential for injury, whether from the trauma of contact with other players or from overuse or misuse of a body part.he highest rates of injury occur in sports that involve contact and collisions. More severe injuries occur during individual sports and recreational activities. Most organized sports-related injuries (62 percent) occur during practice.\nSoft Tissue Injuries and Car Accidents. A soft tissue injury is damage to the bodyâ\u0080\u0099s connective tissue, which means muscles, ligaments and tendons. This is the most common type of injury resulting from a car accident. Soft tissue injuries can take many forms. A â\u0080\u009cwhiplashâ\u0080\u009d type injury to the neck and upper back is a form of soft tissue injury.\nWhat could be the matter and what kind of doctor should I see for help? There are two common types of muscle injuries, strains and sprains. A muscle strain is an injury that affects muscles or tendons, which are the thick bands that connect muscles to bone. A muscle sprain is an injury that affects ligaments, which are thick bands that connect bone to bone.\nConcussion (TBI) 1  A concussion can be caused by direct blows to the head, gunshot wounds, violent shaking of the head, or force from a whiplash type injury. 2  Both closed and open head injuries can produce a concussion. A concussion is the most common type of traumatic brain injury.\nA concussion can be caused by direct blows to the head, gunshot wounds, violent shaking of the head, or force from a whiplash type injury. Both closed and open head injuries can produce a concussion. A concussion is the most common type of traumatic brain injury.\nHere are the five most common on-the-job injuries, according to the survey: 1  Musculoskeletal injuries. 2  Slip-and-fall injuries. 3  Repetitive motion injuries.  Injured by machinery or struck by 1  object. Motor vehicle accident.\nAccording to the U.S. Department of Labor's recent workplace safety index, some of the most common work-related injuries are: Overextension. Consistently rated as the most common work-related injury, overextension occurs most often when a worker is pulling, pushing, lifting, gripping, carrying or throwing. Overextension is known to cause sprained and torn muscles, tendons, and ligaments.\nVolleyball Injuries. Volleyball is a game where individuals must possess agility, strength, endurance, coordination, balance, and hand-eye coordination. Volleyball requires that individuals move laterally and vertically in a rapid succession of start and stop movements.Volleyball is commonly played on two types of playing surfaced: a hard court and the sand. While the injuries associated with both types of playing surfaces are similar, there are a few differences.Typical injuries associated with playing volleyball include soft tissue sprains, strains, spasms, cramps, and tears.In addition, injuries associated with virtually all joints occur as well. The core and lower body is placed under a fairly high level of stress.olleyball is commonly played on two types of playing surfaced: a hard court and the sand. While the injuries associated with both types of playing surfaces are similar, there are a few differences.\nCommon volleyball injuries and their causes. Common volleyball injuries and their causes. Sports medicine literature speaks of two kinds of injuries, 'cumulative' overuse, and 'acute' traumatic injuries caused by a sudden impact.ommon volleyball injuries and their causes. Common volleyball injuries and their causes. Sports medicine literature speaks of two kinds of injuries, 'cumulative' overuse, and 'acute' traumatic injuries caused by a sudden impact.\nThe following are the most common types of closed wounds: 1  Contusions: These are a common type of sports injury, where a direct blunt trauma can damage the small blood vessels and capillaries, muscles and underlying tissue, as well the internal organs or bone.\nCommon causes of overuse injury. An overuse injury is any type of muscle or joint injury, such as tendinitis or a stress fracture, that's caused by repetitive trauma. An overuse injury typically stems from: 1  Training errors. 2  Training errors can occur when you enthusiastically take on too much physical activity too quickly. 3  Going too fast, exercising for too long or simply doing too much of one type of activity can strain your muscles and lead to an overuse injury. 4  Technique errors.\nShoulder strains are the most common type of shoulder injury. Many shoulder strains occur in the front or anterior head of the deltoid, where the biceps runs underneath the deltoid. Shoulder strains can happen when someone lifts too much weight, jerks a heavy weight or object around, or falls.\nSubscribe to our Pain Management Advisor e-newsletter for tips to manage pain. Whiplash typically occurs when a person's head is forcefully and quickly thrown backward and then forward. This motion can injure bones in the spine, disks between the bones, ligaments, muscles, nerves and other tissues of the neck.This type of injury may result from: 1  Auto accidents. 2  Rear-end collisions are the most common cause of whiplash. 3  Physical abuse or assault.4  Whiplash may also result from incidents of being punched or shaken. 5  Whiplash is one of the injuries sustained in shaken baby syndrome.his type of injury may result from: 1  Auto accidents. 2  Rear-end collisions are the most common cause of whiplash. 3  Physical abuse or assault. 4  Whiplash may also result from incidents of being punched or shaken. 5  Whiplash is one of the injuries sustained in shaken baby syndrome.\nThe most common mechanisms of injury are either direct impact, such as a crushing injury causing a. transverse or comminuted fracture pattern, or a twisting-type injury causing an oblique fracture pattern with. soft-tissue swelling. Chronic direct forces can produce stress fractures.\nThere are basically two types of injuries: acute injuries and overuse injuries. Acute injuries are usually the result of a single, traumatic event. Common examples include wrist fractures, ankle sprains, shoulder dislocations, and hamstring muscle strain.While overuse injuries are more common in sports than acute injuries, they are subtle and usually occur over time, making them challenging to diagnose and treat.ome tips for treating an overuse injury include: 1  Cutting back the intensity, duration, and frequency of an activity. 2  Adopting a hard/easy workout schedule and crosstraining with other activities to maintain fitness levels. 3  Learning about proper training and technique from a coach or athletic trainer.\nHead injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year.ead injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year.\nThe most common types of injuries that can occur from exposure to toxic chemicals are burns, rashes, and throat or lung injuries, but nerve and neurological injuries (i.e., brain damage) from chemical exposure are not uncommon.\nPlantar fasciitis is the most common type of plantar fascia injury and is the most common reason for heel pain, responsible for 80% of cases.\nQuadriceps Contusions and Hip Pointers in Football. Football is a contact sport, with a high risk of injury. Knee, ankle, and head injuries, such as concussions, are the most common types of football injuries. However, despite being well padded, the anterior (front) thigh is a commonly injured part of the body.uadriceps contusion Football is considered by many to be a bone-bruising sport. For the most part, this is very true. The quadriceps muscles (four muscles comprising the front of the thigh) (Fig. 1) are particularly susceptible to contusions (bruising).\nWhat is the most common type of traumatic brain injury? The most common type of traumatic brain injury is a concussion, which again is classified as a mild traumatic brain injury. Mild traumatic brain injuries often go undiagnosed and consequently the person suffering that type of injury loses out on the benefits of rehab or medical care.\nShattering glass or loose objects flying inside the car on impact often cause these types of injuries. Soft Tissue Injuries and Car Accidents. A soft tissue injury is damage to the bodyâ\u0080\u0099s connective tissue, which means muscles, ligaments and tendons. This is the most common type of injury resulting from a car accident. Soft tissue injuries can take many forms. A â\u0080\u009cwhiplashâ\u0080\u009d type injury to the neck and upper back is a form of soft tissue injury. In that type of injury the muscles and ligaments are stretched due to sudden movements imposed on the head and neck in the collision.\nCommon Knee Injuries. Your knee is made up of many important structures, any of which can be injured. The most common knee injuries include fractures around the knee, dislocation, and sprains and tears of soft tissues, like ligaments. In many cases, injuries involve more than one structure in the knee. Pain and swelling are the most common signs of knee injury. In addition, your knee may catch or lock up.\nOne of the most common injuries associated with auto accidents is a whiplash-type neck injury, but it can be difficult to predict what an insurance company will offer in terms of settlement in this kind of case, because the injury may not be all that obvious.ne of the most common injuries associated with auto accidents is a whiplash-type neck injury, but it can be difficult to predict what an insurance company will offer in terms of settlement in this kind of case, because the injury may not be all that obvious.\nA nerve injury can result in a problem with a muscle or in a loss of sensation. In some people, it also causes pain. To understand nerve injury and recovery, it is important to understand the different types of nerve injury. The type of nerve injury will determine the type of treatment that will be needed.n some people, it also causes pain. To understand nerve injury and recovery, it is important to understand the different types of nerve injury. The type of nerve injury will determine the type of treatment that will be needed.\nSome common type of traumatic injuries include, but are not limited to: Traumatic brain injury. Spinal cord injury. Spine fractures. Amputation - traumatic. Facial trauma. Acoustic trauma. Crush injury.\nTYPES OF WORKERSâ\u0080\u0099 COMPENSATION INJURIES. While you can file a workersâ\u0080\u0099 compensation for almost any type of workplace injury, some of the most common types include: Spine Injuries: Lower/Middle/Upper Back and Neck Injuries, including Strains, Disc Bulges, Fractures, etc. Orthopedic-Type Injuries: Sprains/Strains/Fractures of the Shoulders, Arms, Elbows, Wrists (including Carpal Tunnel), Hands, Fingers, Hips, Legs, Knees, Ankles, Feet, Toes, etc.\nMost of the time, coccydynia, or tail bone pain, is caused by or associated with an injury, such as a fall. However, this is not always the case. For example, another very common cause of coccydynia is over use injury or repetitive use injury on the coccyx (tail bone).Believe it or not, sitting down all day at an office job can cause this! Riding a bike is another common cause.or example, another very common cause of coccydynia is over use injury or repetitive use injury on the coccyx (tail bone). Believe it or not, sitting down all day at an office job can cause this! Riding a bike is another common cause.\n5 of the most common sports related injuries are: 1) Strains and Sprains. These are the most common type of sports injury by far, and can occur in almost any type of physical activity. A sprain occurs when a ligament (band of connective tissue that attaches bones to other bones) tears or overstretches. These can range from minor to complete tears where the ligament is severed.\nTypes of ACL Injuries. There are several conditions that cause varying levels of anterior cruciate ligament (ACL) instability. These include: sprains, avulsion fractures, ACL deficiencies, and complex ligament injuries. More than half of all types of ACL injuries occur with associated damage to another part of the knee â\u0080\u0093 most commonly, another ligament, articular cartilage (bone lining), or meniscus (cushion pad). Types of ACL injuries can be diagnosed by a thorough examination, X-rays, and magnetic resonance imaging (MRI).\nWrist pain is any pain or discomfort that occurs in the wrist. The wrist contains many small bones, cartilage, muscles, blood vessels, and tendons, and is particularly susceptible to injury.Wrist pain is commonly caused by inflammation or injury but may also arise from an infection or a tumor on the wrist.Common inflammatory causes of wrist pain include arthritis and gout.Common wrist injuries include repetitive use injuries, sports injuries, fractures, and sprains or strains.rist pain is commonly caused by inflammation or injury but may also arise from an infection or a tumor on the wrist. Common inflammatory causes of wrist pain include arthritis and gout. Common wrist injuries include repetitive use injuries, sports injuries, fractures, and sprains or strains.\n1 Use an elastic bandage wrap to compress and support your wrist. 2  Start your wrap at a point farthest from your heart. 3  This is done to prevent swelling of the lower part of the extremity that can be caused by the wrapping process. 4  Compression can help enable lymphatic and venous return to the heart.rapping the wrist to avoid a sports-related injury is most commonly done to prevent two common types of wrist injuries. These are known as hyperextension and hyperflexion. 1  Hyperextension is the most common type of wrist injury. 2  This occurs when your hand goes out to break your fall, and you land on your opened hand.\nA different method for wrapping your wrist may provide greater stability for the injured area and allow you to resume minor activity when you are ready. 1  Start your wrap by securing the elastic bandage wrap at an area just above the injury, meaning on the elbow side of the injured part of the wrist.rapping the wrist to avoid a sports-related injury is most commonly done to prevent two common types of wrist injuries. These are known as hyperextension and hyperflexion. 1  Hyperextension is the most common type of wrist injury. 2  This occurs when your hand goes out to break your fall, and you land on your opened hand.\nRunning injuries usually happen when you push yourself too hard. The way your body moves also plays a role. You can prevent many of them. Here's how. 1. Runner's knee. This is a common overuse injury.Runner's knee has several different causes. It often happens when your kneecap is out of alignment.Over time, the cartilage on your kneecap can wear down. When that happens, you may feel pain around the kneecap, particularly when: 1  Going up or down stairs. 2  Squatting.unning injuries usually happen when you push yourself too hard. The way your body moves also plays a role. You can prevent many of them. Here's how. 1. Runner's knee. This is a common overuse injury.\nOne of the most common injuries in sports, particularly in football, is a groin strain. This type of injury describes a strain on the Adductor muscles located inside the thigh. There are five types of muscles that fall under the Adductor muscle group.\nAfter a sedentary work week, end-zone catches and 36-hole weekends can take their toll in common sports injuries. The seven most common sports injuries are: 1  Ankle sprain. 2  Groin pull. 3  Hamstring strain. 4  Shin splints. 5  Knee injury: ACL tear. 6  Knee injury: Patellofemoral syndrome â\u0080\u0094 injury resulting from the repetitive movement of your kneecap against your thigh bone. 7  Tennis elbow (epicondylitis).\nInversion Ankle Sprains. The most common type of ankle sprain occurs when the foot is inverted or falling inward. When this type of ankle injury occurs, the 3 outer ligaments, or lateral ligaments are at risk of injury.This can result in a tear or increased laxity of the ligament.nversion Ankle Sprains. The most common type of ankle sprain occurs when the foot is inverted or falling inward. When this type of ankle injury occurs, the 3 outer ligaments, or lateral ligaments are at risk of injury.\nAnkle injuries are extremely common. The most common ankle injury is a sprained ankle, but ankle pain can have numerous sources.Ankle pain that results from injury are often thought of as sports injuries. But you don't necessarily have to be an athlete or even a social sportsperson to twist your ankle.hile ankle pain can result from a large number of ankle and foot injuries, the most common ankle injuries are sprains (low and high ankle), which involve ligaments and bones in the ankle.\nAnkle Pain. Ankle injuries are extremely common. The most common ankle injury is a sprained ankle, but ankle pain can have numerous sources. Ankle pain that results from injury are often thought of as sports injuries.But you don't necessarily have to be an athlete or even a social sportsperson to twist your ankle.hile ankle pain can result from a large number of ankle and foot injuries, the most common ankle injuries are sprains (low and high ankle), which involve ligaments and bones in the ankle.\n5 of the most common sports related injuries are: 1) Strains and Sprains. These are the most common type of sports injury by far, and can occur in almost any type of physical activity. A sprain occurs when a ligament (band of connective tissue that attaches bones to other bones) tears or overstretches. These can range from minor to complete tears where the ligament is severed. A sprain is most common in wrists, ankles, or knees. A strain is also known as a pulled muscle, and occurs when the fibers within a muscle or tendon stretch too far or tear. Strains can also be minor to severe. 2) Knee Injuries. Every year over five million people visit orthopedic surgeons for knee related injuries and problems.\nHead, knee, neck, and foot injuries are common results. Employee's diligence and employer focus on keeping the work environment free from hazards are key to preventing these types of injuries. 5. Falling Object Injuries - Objects that fall from shelves or dropped by another person can cause very serious injuries. Head injuries are a common result of this type of accident. Employee's diligence and employer focus on keeping the work environment free from hazards are key to preventing these types of injuries.\nProximal Biceps Tendon Ruptures A proximal biceps tendon rupture is an injury to the biceps tendon at the shoulder joint. This injury type is the most common type of biceps tendon injury. It is most common in patients over 60 years of age and often causes minimal symptoms.\nA proximal biceps tendon rupture is an injury to the biceps tendon at the shoulder joint. This injury type is the most common type of biceps tendon injury. It is most common in patients over 60 years of age, and often causes minimal symptoms.\nThey are also common among those who participate in many types of sports. A physician's care is needed for a wrist injury that may be a fracture. Another type of wrist injury that is increasingly common occurs because of repetitive motion.\n1 The most common types of primary headaches are 1) tension, 2) migraine, and 3) cluster. 2  Tension headaches are the most common type of primary headache and usually are treated with over-the-counter (OTC) medications for pain. 3  Secondary headaches are a symptom of an injury or an underlying illness. The most common types of primary headaches are 1) tension, 2) migraine, and 3) cluster. 2  Tension headaches are the most common type of primary headache and usually are treated with over-the-counter (OTC) medications for pain. 3  Secondary headaches are a symptom of an injury or an underlying illness.\nTen percent of all fractures that occur are those to the metacarpals and phalanges, the most common injuries being from car accidents, sports injuries, and work-related injuries. The goal in repairing these injuries is to do so while maintaining strength of hand grip and no residual pain upon using the hand.en percent of all fractures that occur are those to the metacarpals and phalanges, the most common injuries being from car accidents, sports injuries, and work-related injuries. The goal in repairing these injuries is to do so while maintaining strength of hand grip and no residual pain upon using the hand.\nBruising is a very general term for a condition in which blood leaks out of the blood vessels into the tissues of the skin, mucus membranes or other organs, including muscles and bones.Different types of bruises include contusions, hematomas and purpura.Contusions are common types of bruises that are caused by trauma, often blunt-force injury, that damages and breaks open the tiny blood vessels in the tissues of the skin, mucus membranes or other organs.Contusions are often accompanied by pain and swelling due to the bodyâ\u0080\u0099s inflammatory response to injury.ifferent types of bruises include contusions, hematomas and purpura. Contusions are common types of bruises that are caused by trauma, often blunt-force injury, that damages and breaks open the tiny blood vessels in the tissues of the skin, mucus membranes or other organs.\nConcussion. 1  A concussion can be caused by direct blows to the head, gunshot wounds, violent shaking of the head, or force from a whiplash type injury. 2  Both closed and open head injuries can produce a concussion. A concussion is the most common type of traumatic brain injury.\nWhat Are Head Injuries? Head injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year. A concussion is a type of traumatic brain injury (TBI) that happens when the brain is jarred or shaken hard enough to bounce against the skull.\nTypes of Traumatic Brain Injury Learn about some of the most common types of traumatic brain injury. Traumatic brain injuries (TBI) are the most common variety of brain injuries, affecting as many as 1.7 million people and claiming 52,000 lives annually. The trauma in this term refers to the physical trauma of a blow to the head, but not all blows to the head produce the same level of damage.\nTo learn more about non-traumatic brain injuries, see Types of Acquired Brain Injuries. Following are common types of traumatic brain injury: Coup-Contrecoup Brain Injury . A coup-countrecoup brain injury occurs when there is significant impact to the brain that causes the brain or skull to slam into the opposite side of the site of impact.\nTypes of injuries The most common injuries associated with tennis are rotator cuff tendinitis, tennis elbow, wrist strains, back pain, anterior (front) knee pain involving the knee cap, calf and Achilles tendon injuries, ankle sprains, and tennis toe.\nInjury to the anterior cruciate ligament (ACL) is the most common ligament injury in the knee. This type of injury is usually sports related requiring surgical intervention as a torn ligament will not heal on its own.Visit http://www.milwaukeeorthopaedics.com to find out more.njury to the anterior cruciate ligament (ACL) is the most common ligament injury in the knee. This type of injury is usually sports related requiring surgical intervention as a torn ligament will not heal on its own.\nThe most common sports injuries are: 1  Sprains and strains. 2  Knee injuries. 3  Swollen muscles.  Achilles tendon 1  injuries. Pain along the shin bone. 2  Fractures. Dislocations.\nHamstring injuries are one of the most common strains to affect athletes and the most common type of strain to affect the lower extremity. Hamstring strains can also be one of the most disabling injuries to the lower extremity. These strains are most common amongst athletes that participate in sports that involve a lot of acceleration, deceleration, kicking, jumping, cutting, and pivoting. - sports such as soccer, rugby, football, and raquet sports.\nKnee injury facts. The knee is one of the most common body parts to be injured. Types of knee injuries include sprains, strains, bursitis, dislocations, fractures, meniscus tears, and overuse injuries.\nMCL injury is also part of the  Unhappy Triad , or the common injury of the MCL, ACL, and Meniscus all together, usually through a pivot shift type of mechanism.The most obvious sypmtom of MCL injury is pain. Following the injury, you will experience pain in the knee, usually along the iside of the joint.CL injury is also part of the  Unhappy Triad , or the common injury of the MCL, ACL, and Meniscus all together, usually through a pivot shift type of mechanism.\nWhat Are Head Injuries? Head injuries are injuries to the scalp, skull, or brain caused by trauma. Concussions are the most common type of sports-related brain injury with an estimated 1.6 million to 3.8 million sports-related concussions a year.\nNone of the 101 nonabused infants (controls) had a previous sentinel injury ( P < .001). The type of sentinel injury in the definitely abused cohort was bruising (80%), intraoral injury (11%), and other injury (7%). Sentinel injuries occurred in early infancy: 66% at <3 months of age and 95% at or before the age of 7 months. Medical providers were reportedly aware of the sentinel injury in 41.9% of cases. CONCLUSIONS: Previous sentinel injuries are common in infants with severe physical abuse and rare in infants evaluated for abuse and found to not be abused. Detection of sentinel injuries with appropriate interventions could prevent many cases of abuse. 1  abuse. 2  bruising. 3  infants. 4  maltreatment. 5  screening. 6  abusive head trauma. 7  Abbreviations: AHT â\u0080\u0094. abusive head trauma.", "key": "59_2", "timestamp": "2020-06-23 21:18:59.178708", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}