{"input_text": "Çukuriçi Höyük is situated in what is today a very fertile plain surrounded by flourishing fruit plantations. Excavations have revealed that this hill, which is clearly visible in the landscape, is in fact a prehistoric tell (Höyük): through millennia-long usage as a settled site on the same location, massive occupation layers were created which have accumulated into an artificial hill. This type of settlement is typical for the Neolithic and Bronze Age periods (8th–2nd millennium B.C.) from the orient to south-east Europe; in western Anatolia, however, only a few tells have so far been excavated and systematically investigated.At Çukuriçi Höyük it has been possible up until now to excavate five settlements lying on top of each other, from several periods and with differing dimensions. These offer a preliminary insight into the history of this settlement hill.Already at the end of the 7th millennium B.C. (late Neolithic/early Chalcolithic) the site was used as a settlement: as a house built with stone socles and loam walls attests, people probably settled here permanently. The diet at this early stage was already varied, and was primarily based on domestic animal husbandry of pigs, sheep, and goats as well as cattle. The diet was supplemented by the hunting of rabbits, foxes, red deer and aurochs, as well as the collecting of shellfish. The technical specialisation of the people who settled here is proven by, amongst other things, high-quality ceramic vessels and beaten stone utensils, which were predominantly produced out of imported  Obsidian . This early settlement was vacated after its destruction, the reasons for which are still unclear, and apparently abandoned.The next secure usage of the site which has been identified so far is attested approximately 1,500 years later, in the developed 4th millennium B.C. The tell would now be continuously occupied without a break until about 2,500 B.C., when in this Early Bronze Age period it was again abandoned.The Early Bronze Age was an era of great and lasting changes in the Aegean region and in south-east Europe. Presumably triggered by the demand for metals and their trade, as well as the resulting prosperity from these activities, the first proto-urban centres and large fortified settlements arose. The role of western Anatolia during this important phase of development of human society is still in many respects unclear. On Çukuriçi Höyük in this period large single-room and multi-room buildings, with massive stone socles and mudbrick walls, were constructed. The most recent of these settlements was violently destroyed, most probably by an earthquake, and was not reconstructed. The spectrum of finds points to numerous differing and specialised activities within the settlement. Of particular significance is the manufacture of copper objects: the production of these objects can be demonstrated, from the initial casting in a prefabricated mould up to the finishing process in a forge. A distinct change in the inhabitants’ diet, in comparison with the previous period, can be observed: at Çukuriçi Höyük now, above all, sheep and goats were kept as domestic animals, while rabbits, foxes, wild boar and fallow deer were hunted, supplemented by the hunting of wolves, bears and various types of birds. The sea was also increasingly exploited as a source of food: in addition to the utilization of shellfish, already attested for the earlier periods, in the Early Bronze Age there is also evidence for the catching of fish, in both shallow and deep waters.\nAlthough Homer refers to a union of the Greek kingdoms under the leadership of the king of Mycenea during the  Trojan War , there is no evidence that these kingdoms were dominated by a central power. Most of the Mycenean palaces were destroyed at the end of the 13th century BC. The Greek tradition relates this destruction to the Dorians, but it is suggested that the  Dorian invasion  was only one of the causes of the Bronze Age collapse in the Eastern  Mediterranean , as there is no evidence that the newcomers established a different civilization. The destruction was followed by the  Greek Dark Ages  with very poor archaeological findings, when most occupied areas were deserted, but some areas like  Attica  occupied by the Ionians remained untouched by the invaders. Several Greek tribes moved to regions of Greece where they acquired different names, and population groups moved through the islands to the western coasts of Asia Minor where they kept their native names Aeolians, Ionians and Dorians.\nIn the 13th century BCE, at the end of the  Bronze Age , seafaring invaders from  Europe  and the  Aegean  known as the  Sea Peoples  entered the  Eastern Mediterranean , invading  Anatolia ,  Syria ,  Canaan ,  Cyprus  and  Egypt . The invasions by the Sea Peoples ushered the  Bronze Age Collapse , which resulted in the cultural collapse of  Mycenean Greece , the  Hittite Empire , the  New Kingdom of Egypt  and the civilizations of Canaan and Syria. The Sea Peoples are regarded as being composed of various groups of  Indo-European  peoples.\nIn 1178 BCE, the  Battle of Djahy (Canaan)  between  Ramesses III  and the  Sea Peoples  marked the beginning of the decline in power of the  New Kingdom  in the  Levant  during the wider  Bronze Age collapse .\nThe most eminent of early biblical archaeologists was  William F. Albright , who believed that he had identified the Patriarchal age in the period 2100–1800 BC, the Intermediate  Bronze Age , the interval between two periods of highly developed urban culture in ancient  Canaan . Albright argued that he had found evidence of the  sudden collapse  of the previous Early Bronze Age culture, and ascribed this to the invasion of migratory  pastoral nomads  from the northeast whom he identified with the  Amorites  mentioned in Mesopotamian texts. According to Albright, Abraham was a wandering Amorite who migrated from the north into the central highlands of Canaan and the Negev with his flocks and followers as the Canaanite city-states collapsed. Albright,  E. A. Speiser  and  Cyrus Gordon  argued that although the texts described by the documentary hypothesis were written centuries after the Patriarchal age, archaeology had shown that they were nevertheless an accurate reflection of the conditions of the 2nd millennium BC: \"We can assert with full confidence that Abraham, Isaac and Jacob were actual historical individuals.\"\nThe  Bronze Age  begins around 2500 BC with the first appearance of bronze objects in the archaeological record. This coincides with the appearance of the characteristic  Beaker culture ; again it is unknown whether this was brought about primarily by folk movement or by cultural assimilation, and again it may be a mixture of both. The Bronze Age sees a shift of emphasis from the communal to the individual, and the rise to prominence of increasingly powerful elites, whose power was enshrined in the control of the flow of precious resources, to manipulate tin and copper into high-status bronze objects such as swords and axes, and their prowess as hunters and warriors. Settlement became increasingly permanent and intensive. Towards the end of the period, numerous examples of extremely fine metalwork begin to be found deposited in rivers, presumably for ritual reasons and perhaps reflecting a progressive shift of emphasis away from the sky and back to the earth, as a rising population increasingly put the land under greater pressure. England largely also becomes in this period bound up with the  Atlantic trade system , which created something of a cultural continuum over a large part of Western Europe. It is possible that the  Celtic languages  developed or spread to England as part of this system; by the end of the Iron Age at the very least there is ample evidence that they were spoken across the whole of England, as well as the Western parts of Britain.\nArchaeological research in Northern Vietnam indicates an increase in rates of infectious disease following the advent of metallurgy; skeletal fragments in sites dating to the early and mid-Bronze Age evidence a greater proportion of lesions than in sites of earlier periods. There are a few possible implications of this. One is the increase contact with bacterial and/or fungal pathogens due to increased population density and land clearing/ cultivation. The other one is decreased levels of immunocompetence in the Metal age due to changes in diet caused by agriculture. The last is that there may have been an emergence of infectious disease in the Da But period that evolved into a more virulent form in the metal period. Archaeology also suggests that Bronze Age metallurgy may not have been as significant a catalyst in social stratification and warfare in Southeast Asia as in other regions, social distribution shifting away from chiefdom-states to a heterarchical network. Data analyses of sites such as Ban Lum Khao, Ban Na Di, Non Nok Tha, Khok Phanom Di, and Nong Nor have consistently led researchers to conclude that there was no forentrenched hierarchy.\nAnother possible cause is invasion by outside peoples, though the only evidence of warfare found so far is the wooden stockade and watchtowers that enclosed Cahokia's main ceremonial precinct. Due to the lack of other evidence for warfare, the  palisade  appears to have been more for ritual or formal separation than for military purposes. Diseases transmitted among the large, dense urban population are another possible cause of decline. Many theories since the late 20th century propose conquest-induced political collapse as the primary reason for Cahokia’s abandonment.\nThe Mycenaean civilization started to collapse from 1200 BC. Archaeology suggests that, around 1100 BC, the palace centres and outlying settlements of the Mycenaeans' highly organized culture began to be abandoned or destroyed, and by 1050 BC, the recognizable features of Mycenaean culture had disappeared, and the population had decreased significantly. Many explanations attribute the fall of the Mycenaean civilization and the  Bronze Age collapse  to climatic or environmental catastrophe, combined with an invasion by  Dorians  or by the  Sea Peoples , or to the widespread availability of edged weapons of iron, but no single explanation fits the available  archaeological evidence .\nVarious and currently outdated theories have been proposed that postulate waves of  migration  during the  Middle Bronze Age  in the  Ancient Near East . While the turmoils that separate the Late Bronze Age from the Early Iron Age are well documented (see  Bronze Age collapse ), theories of migration during the Middle Bronze Age (20th century BCE) have little direct support.\nThe end of the Ottomány culture is connected with turbulent events at the end of Old Bronze Age in Central Europe, where there was a collapse of the whole \"Old Bronze Age world\" with its highly advanced culture of mighty hill-forts, rich burials, and trade over wast distances. The gradual decline in the number of fortified settlements, change of burial rites, and the decision of people to desert fortified settlements could have had several reasons, including the collapse of trade and exchange networks, the attacks of enemies, the internal collapse of society or environmental causes. The following Middle Bronze Age/Late Bronze Age cultures are very different in their burial rites (cremation, erecting of barrows) as well as in their handling of bronze - there is an \"explosion\" in bronze working, and many bronze hoards found across all of Europe illustrate this change in quantity and quality of produced bronze objects. We see not only bronze ornaments and arms (including first examples of  sword s), but also bronze tools ( sickle s,  axe s,  adze s), which changed the everyday life of prehistoric man.\nBronze Age collapse theories have described aspects of the end of the Age in this region. At the end of the Bronze Age in the Aegean region, the  Mycenaean  administration of the regional trade empire followed the decline of Minoan primacy. Several Minoan  client states  lost much of their population to famine and/or pestilence. This would indicate that the trade network may have failed, preventing the trade that would previously have relieved such famines and prevented illness caused by malnutrition. It is also known that in this era the  breadbasket  of the Minoan empire, the area north of the  Black Sea , also suddenly lost much of its population, and thus probably some capacity to cultivate crops.\nTell Sukas was located at the center of the fertile plain of Jableh on a hill with access to two natural harbors. There is evidence of an earlier  Neolithic  settlement at the site dating back to the seventh or sixth millennium BC.  The site was identified as ancient Suksi, which was mentioned in the  Ugarit  tablets and was probably the southernmost port of the Kingdom of Ugarit. The  Bronze Age  settlement was probably destroyed along with the capital, Ugarit, during the  Bronze Age collapse . The site was reused shortly thereafter and commercial activity at the  Iron Age  settlement can be traced again to at least the tenth century BC, when it became the port of  Luhuti , A  Phoenician  settlement was established in the eighth century BC and the town thrived as a  Greek  trading outpost between c. 850 BC and c. 550 BC, when it was destroyed by the  Babylonians . Recent excavations reveal that the site was inhabited again by the Phoenicians between 380 and 69 BC until it was destroyed again, possibly by an earthquake. It was later re-occupied for a short period by the  Crusaders .\nThe  Bronze Age collapse  is the name given by those historians who see the transition from the  Late Bronze Age  to the  Early Iron Age  as violent, sudden and culturally disruptive, expressed by the collapse of  palace economies  of the  Aegean  and  Anatolia , which were replaced after a hiatus by the isolated village cultures of the  Dark Age period in history  of the ancient Middle East. Some have gone so far as to call the catalyst that ended the Bronze Age a \"catastrophe\". The Bronze Age collapse may be seen in the context of a technological history that saw the slow, comparatively continuous spread of iron-working technology in the region, beginning with precocious iron-working in what is now  Romania  in the 13th and 12th centuries. The cultural collapse of the  Mycenaean kingdoms , the  Hittite Empire  in  Anatolia  and  Syria , and the  Egyptian Empire  in  Syria  and  Israel , the scission of long-distance  trade  contacts and sudden eclipse of literacy occurred between 1206 and 1150 BC. In the first phase of this period, almost every city between  Troy  and  Gaza  was violently destroyed, and often left unoccupied thereafter (for example,  Hattusas ,  Mycenae ,  Ugarit ). The gradual end of the  Dark Age  that ensued saw the rise of settled  Neo-Hittite  and  Aramaean  kingdoms of the mid-10th century BC, and the rise of the  Neo-Assyrian Empire .\nThe Aegean Collapse has been attributed to the exhaustion of the  Cypriot  forests causing the end of the bronze trade. These forests are known to have existed into later times, and experiments have shown that  charcoal  production on the scale necessary for the bronze production of the late Bronze Age would have exhausted them in less than fifty years.\nAfter 1180s BCE, amid general turmoil in the  Levant  associated with the sudden arrival of the  Sea Peoples , and the  collapse of the Bronze Age  the empire disintegrated into several independent  Syro-Hittite  (Neo-Hittite) city-states, some of which survived until as late as the 8th century BCE. In the West, Greeks were arriving on the Anatolian coast, and the  Kaskas  along the northern Black Sea coast. Eventually  Hattusha  itself was destroyed around 1200 BCE and the age of Empires shifted to that of regional states as the Bronze Age transitioned into the Iron Age.\nIsrael Finkelstein  claims that the Israelites emerged as a subculture within Canaanite society and rejects the biblical account of the Israelite conquest of Canaan. In this view, the Book of Joshua conflates several independent battles between disparate groups over the centuries, and artificially attributes them to a single leader, Joshua. Nevertheless, one archaeological  stratum , dating from around 1200 BCE, shows signs of catastrophic fire, and cuneiform tablets found at the site refer to monarchs named Ibni Addi, where Ibni may be the  etymological  origin of Yavin (Jabin). The city also show signs of having been a magnificent Canaanite city prior to its destruction, with great temples and opulent palaces, split into an upper  acropolis , and lower city; the town evidently had been a major Canaanite city. He theorized that the destruction of Hazor was the result of civil strife, attacks by the  Sea Peoples , and/or a result of the  general collapse  of civilization across the whole eastern Mediterranean in the Late Bronze Age.\nMore recently, it has been shown how the diversion of midwinter storms from the Atlantic to north of the Pyrenees and the Alps, bringing wetter conditions to Central Europe but drought to the Eastern Mediterranean, was associated with the Late Bronze Age collapse.\nThe  Bronze Age collapse  is the transition from the  Late Bronze Age  to the  Early Iron Age , expressed by the collapse of  palace economies  of the  Aegean  and  Anatolia , which were replaced after a hiatus by the isolated village cultures of the  Dark Age period in history  of the ancient Near East. Some have gone so far as to call the catalyst that ended the Bronze Age a \"catastrophe\". The Bronze Age collapse may be seen in the context of a technological history that saw the slow, comparatively continuous spread of iron-working technology in the region, beginning with precocious iron-working in what is now  Romania  in the 13th and 12th centuries. The cultural collapse of the  Mycenaean kingdoms , the  Hittite Empire  in  Anatolia  and  Syria , and the  Egyptian Empire  in  Syria  and  Israel , the scission of long-distance  trade  contacts and sudden eclipse of literacy occurred between 1206 and 1150 BCE. In the first phase of this period, almost every city between  Troy  and  Gaza  was violently destroyed, and often left unoccupied thereafter (for example,  Hattusas ,  Mycenae ,  Ugarit ). The gradual end of the Dark Age that ensued saw the rise of settled  Neo-Hittite   Aramaean  kingdoms of the mid-10th century BCE, and the rise of the  Neo-Assyrian Empire .\nThe  Late Bronze Age collapse  saw methodical invasion and destruction of cities, populations, wealth and means of production by competing tribal groups, states and empires in the eastern Mediterranean. Although cities had been sacked before, the systematic nature and scale of these campaigns stand out.\nTablet RS 18.38 from  Ugarit  also mentions grain to the Hittites, suggesting a long period of famine, connected further, in the full theory, to drought. Barry Weiss, using the  Palmer Drought Index  for 35 Greek, Turkish, and Middle Eastern weather stations, showed that a drought of the kinds that persisted from January 1972 would have affected all of the sites associated with the Late Bronze Age collapse. Drought could have easily precipitated or hastened socio-economic problems and led to wars. More recently,  Brian Fagan  has shown how mid-winter storms from the Atlantic were diverted to travel north of the Pyrenees and the Alps, bringing wetter conditions to Central Europe, but drought to the Eastern Mediterranean.  More recent  paleoclimatological research  has also shown climatic disruption and increasing aridity in the Eastern Mediterranean, associated with the  North Atlantic Oscillation  at this time (See  Bronze Age Collapse ).\nThe archaeological evidence shows a widespread  collapse of Bronze Age civilization  in the Eastern Mediterranean world at the outset of the period, as the great palaces and cities of the Mycenaeans were destroyed or abandoned. Around then, the  Hittite  civilization suffered serious disruption and cities from  Troy  to  Gaza  were destroyed. Following the collapse, fewer and smaller settlements suggest famine and depopulation. In Greece, the  Linear B  writing of the  Greek language  used by Mycenaean bureaucrats ceased. The decoration on  Greek pottery  after about 1100 BC lacks the figurative decoration of Mycenaean ware and is restricted to simpler, generally geometric styles (1000–700 BC).\nThe development of iron smelting was once attributed to the  Hittites  of Anatolia during the Late Bronze Age. It was believed that they maintained a monopoly on ironworking, and that their empire had been based on that advantage. Accordingly, the invading  Sea Peoples  were responsible for spreading the knowledge through that region. This theory is no longer held in the common current thought of the majority of scholarship, since there is no archaeological evidence of the alleged Hittite monopoly. While there are some iron objects from Bronze Age Anatolia, the number is comparable to iron objects found in Egypt and other places of the same time period; and only a small number of these objects are weapons. As part of the Late Bronze Age-Early Iron Age, the  Bronze Age collapse  saw the slow, comparatively continuous spread of iron-working technology in the region. The  Ugaritic script  was in use during this time, around 1300 BC.  Ugarit  was one of the centres of the literate world.\nThe Sea People invasions are often listed among the causes or symptoms of the  Bronze Age collapse .  Ramesses had fought the Sea Peoples in southern  Lebanon , at the  Battle of Djahy . Ramesses III describes a great movement of peoples in the East from the Mediterranean, which caused a massive destruction of the former great powers of the Levant, Cyprus and Anatolia:\nThe Mycenaean civilization perished with the  collapse of Bronze-Age civilization  on the eastern shores of the Mediterranean Sea. The collapse is commonly attributed to the  Dorian invasion , although other theories describing natural disasters and climate change have been advanced as well. Whatever the causes, the Mycenaean civilization had definitely disappeared after  LH III C , when the sites of Mycenae and Tirynth were again destroyed and lost their importance. This end, during the last years of the 12th century BC, occurred after a slow decline of the Mycenaean civilization, which lasted many years before dying out. The beginning of the 11th century BC opened a new context, that of the protogeometric, the beginning of the geometric period, the  Greek Dark Ages  of traditional historiography.\nThe growing complexity and specialization of the Late Bronze Age political, economic, and social organization in Carol Thomas and Craig Conant's phrase together made the organization of civilization too intricate to reestablish piecewise when disrupted. That could explain why the collapse was so widespread and able to render the Bronze Age civilizations incapable of recovery. The critical flaws of the Late Bronze Age are its centralisation, specialisation, complexity, and top-heavy political structure. These flaws then were exposed by sociopolitical events (revolt of peasantry and defection of mercenaries), fragility of all kingdoms (Mycenaean, Hittite, Ugaritic, and Egyptian), demographic crises (overpopulation), and wars between states. Other factors that could have placed increasing pressure on the fragile kingdoms include interruption of maritime trade by piracy by the  Sea Peoples , as well as drought, crop failure, famine, or the Dorian migration or invasion.\nThe Late Bronze Age collapse was a  Dark Age  transition period in the  Aegean Region ,  Southwestern Asia  and the  Eastern Mediterranean  from the Late  Bronze Age  to the Early  Iron Age  that historians believe was violent, sudden and culturally disruptive. The  palace economy  of the Aegean Region and  Anatolia  that characterised the Late Bronze Age was replaced, after a hiatus, by the isolated village cultures of the  Greek Dark Ages .\nAn inquiry is investigating the possibility that sea bed erosion is the primary cause of the collapse.\nMylonas joins two of the previous possibilities. He believes that some developments in Argolis and attempts for recovery after 1200 BC,  can be explained by an internal fighting, and by an enemy pressure, by the  Dorians . Even if the Dorians, were one of the causes of the  Bronze age collapse , there is evidence that they brought with them  some new elements of culture. It seems that the Doric clans moved southward gradually over a number of years, and they devastated the territory, until they managed to establish themselves in the Mycenaean centres.\nThe collapse of the Hittite Empire is usually associated with the gradual decline of Eastern Mediterranean trade networks and the resulting  collapse of major Late Bronze Age cities  in the Levant, Anatolia and the Aegean.At the beginning of the 12th century BC,  Wilusa  ( Troy ) was destroyed and the  Hittite Empire  suffered a sudden devastating attack from the  Kaskas , who occupied the coasts around the  Black Sea , and who joined with the  Mysians . They proceeded to destroy almost all Hittite sites but  were finally defeated by the  Assyria ns beyond the southern borders near the  Tigris .   Hatti ,  Arzawa  ( Lydia ),  Alashiya  ( Cyprus ),  Ugarit  and  Alalakh  were destroyed.", "key": "34_3", "timestamp": "2020-06-23 21:18:59.027174", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}