{"input_text": "The biology of the longfin mako is little-known; it is somewhat common in the western Atlantic and possibly the central Pacific, while in the eastern Atlantic, it is rare and outnumbered over 1000-fold by the shortfin mako in fishery landings. The longfin mako's slender body and long, broad pectoral fins evoke the  oceanic whitetip shark  (Carcharhinus longimanus) and the  blue shark  (Prionace glauca), both slow-cruising sharks of upper oceanic waters. This  morphological  similarity suggests that the longfin mako is less active than the shortfin mako, one of the fastest and most energetic sharks. Like the other members of its family, this species possesses  blood vessel   countercurrent exchange  systems called the  rete mirabilia  (Latin for \"wonderful net\", singular rete mirabile) in its trunk musculature and around its eyes and brain. This system enables other mackerel sharks to conserve  metabolic heat  and maintain a higher body temperature than their environments, though whether the longfin mako is capable of the same is uncertain.\nOf all studied sharks, the shortfin mako has one of the largest  brain:body ratios . This large brain size prompted New Zealand Sealife Australia and New Zealand senior curator Craig Thorburn of Auckland, New Zealand, and film-maker Mike Bhana to investigate the intelligence of the mako. From tests involving shape differentiation to electroreception tests and individual recognition, they discovered makos are fast-learning sharks, able to determine whether or not the researchers were threatening. The sharks involved in the study (while never the same individuals) after initial caution showed unique and never before seen behaviors, such as refusing to roll back their eyes during feeding and allowing themselves to be briefly restrained and touched while being offered bait. Shortfin makos also do not rely on electroreception when hunting, unlike the great white shark, based on tests involving wired fiberglass fish designed to emit weak electrical signals resembling real fish of similar size. Instead, they rely on smell, hearing, and most prominently, vision. The results this research were featured on a documentary presented by  Shark Week  in 1999 called \"The Mako Shark: Swift, Smart and Deadly\".\nLongfin mako sharks are  predator s that feed on small  schooling   bony fish es and  cephalopod s. Whether this shark is capable of elevating its body temperature above that of the surrounding water like the other members of its family is uncertain, though it possesses the requisite physiological adaptations. Reproduction in this species is  aplacental viviparous , meaning the  embryo s hatch from eggs inside the  uterus . In the later stages of development, the unborn young are fed nonviable eggs by the mother ( oophagy ). The litter size is typically two, but may be as many as eight. The longfin mako is of limited  commercial value , as its meat and fins are of lower quality than those of other pelagic sharks; it is caught unintentionally in low numbers across its range. The  International Union for Conservation of Nature   has assessed this species as  vulnerable  due to its rarity, low reproductive rate, and continuing  bycatch  mortality.\nSharks and rays are both  cartilaginous fish es which can be  contrasted with bony fishes . Rays are basically flattened sharks, adapted for feeding on the bottom.  Guitarfish  are somewhat between sharks and rays, and show characteristics of both (though they are classified as rays).\nDescription & Behavior. Shortfin mako sharks, Isurus oxyrinchus (Rafinesque, 1810), aka makos, shortfins, short-finned makos, blue pointers, mackerel sharks, blue dynamites, bonitos, spriglios, palomas â\u0080\u0094 are truly beautiful animals. They are well-adapted and active pelagic (open water) sharks.\nSharks are fish, they are a type of fish called chondricthyes or cartilaginous fish. This group includes Sharks, rays and a group of fish called Chimaera, none of the fish in this group have any bones, instead they have cartilage, click here to find out more about types of fish. There are 8 orders (types) of shark. We'll look at these now, in another part we'll look at their relatives and where they fit into the entire grouping of the animal kingdom. Each of the 8 orders of sharks have their own adaptations to their environment.\nThe mako shark has a very pretty dark blue color on top. It is white underneath which allows it to blend in and stay hidden when it is hunting for food. It has a unique nose that has a point to it like a cone. They are very big sharks in reference to their weight which can be up to 1,000 pounds.\nThe type of shark they are asking for is clearly a Great White  Shark.   It's alot faster than 1 mph, a human swims 2-5 mph average.   It depends on what kind of shar â\u0080¦ k, but the mako can get up to 45-50  mph in short bursts. When a shark is hitting prey from underneath  they can reach up to 30mph.12 people found this useful.Answered. It's alot faster than 1 mph, a human swims 2-5 mph average.   It depends on what kind of shar â\u0080¦ k, but the mako can get up to 45-50  mph in short bursts. When a shark is hitting prey from underneath  they can reach up to 30mph. 12 people found this useful. Answered.\nAnswer: In a race among the sharks, the shortfin mako shark (Isurus oxyrinchus) would be the winner. The robust, streamlined shortfin mako shark is reported to have been clocked at 22 mph, although some sources say it can reach up to 60 mph.This may be because it is capable of chasing even quicker fish, the sailfish and swordfish, which can reach speeds over 60 mph (when leaping).The mako can also perform giant leaps of up to 20 feet out of the water. Sources: 1  R. Aidan Martin.he robust, streamlined shortfin mako shark is reported to have been clocked at 22 mph, although some sources say it can reach up to 60 mph.\nShark and Ray Reproduction. Sharks have been around for a long time, making them evolutionarily successful. Over hundreds of millions of years of evolution, sharks have developed a wide range of reproductive adaptations, a characteristic which has allowed them to survive major extinction episodes.\nAnswer: In a race among the sharks, the shortfin mako shark (Isurus oxyrinchus) would be the winner. The robust, streamlined shortfin mako shark is reported to have been clocked at 22 mph, although some sources say it can reach up to 60 mph.This may be because it is capable of chasing even quicker fish, the sailfish and swordfish, which can reach speeds over 60 mph (when leaping).The mako can also perform giant leaps of up to 20 feet out of the water. Sources: 1  R. Aidan Martin.his may be because it is capable of chasing even quicker fish, the sailfish and swordfish, which can reach speeds over 60 mph (when leaping). The mako can also perform giant leaps of up to 20 feet out of the water. Sources: 1  R. Aidan Martin.\nNormally sharks swim at a speed of less than 5 kph but few species such as mako sharks are able to cruise at a speed of 48 kph. Makos are the worldâ\u0080\u0099s fastest swimmers. They are agile hunters; built for the speed and chasing prey.Their body is thickest at the center and narrow at the ends.t reaches a length of 40 ft (12 m) and weighs up to 13 tons (12 metric tons). Great white sharks are one of the fast movers in water. They are able to reach speeds of 25 miles per hour (40 km/h). They swim just below the waterâ\u0080\u0099s surface.\nThe type of shark they are asking for is clearly a Great White  Shark.   It's alot faster than 1 mph, a human swims 2-5 mph average.   It depends on what kind of shar â\u0080¦ k, but the mako can get up to 45-50  mph in short bursts.When a shark is hitting prey from underneath  they can reach up to 30mph. 12 people found this useful. It's alot faster than 1 mph, a human swims 2-5 mph average.   It depends on what kind of shar â\u0080¦ k, but the mako can get up to 45-50  mph in short bursts. When a shark is hitting prey from underneath  they can reach up to 30mph. 12 people found this useful.\nAnswer: The fastest shark is a Mako Shark, the shark can reach a speed of 45 mph. The Great White Shark attack with a speed of about 30 mph. Answer: It is said that sharks can scent 1 single drop of blood in a 6 miles distance, but I have never heard about documented proofs telling so.nswer: The fastest shark is a Mako Shark, the shark can reach a speed of 45 mph. The Great White Shark attack with a speed of about 30 mph. Answer: It is said that sharks can scent 1 single drop of blood in a 6 miles distance, but I have never heard about documented proofs telling so.\nanswer in a race among the sharks the shortfin mako shark isurus oxyrinchus would be the winner the robust streamlined shortfin mako shark is reported to have been clocked at 22 mph although some sources say it can reach up to 60 mphthis may be because it is capable of chasing even quicker fish the sailfish and swordfish which can reach speeds over 60 mph when leapinghe robust streamlined shortfin mako shark is reported to have been clocked at 22 mph although some sources say it can reach up to 60 mph this may be because it is capable of chasing even quicker fish the sailfish and swordfish which can reach speeds over 60 mph when leaping\nWhale sharks are slow swimmers and their top speed is no more than 5 miles (8 kilometers per hour) probably due to the fact that whale shark is the biggest fish in the world. It reaches a length of 40 ft (12 m) and weighs up to 13 tons (12 metric tons).Great white sharks are one of the fast movers in water.ormally sharks swim at a speed of less than 5 kph but few species such as mako sharks are able to cruise at a speed of 48 kph. Makos are the worldâ\u0080\u0099s fastest swimmers.\nNormally sharks swim at a speed of less than 5 kph but few species such as mako sharks are able to cruise at a speed of 48 kph. Makos are the worldâ\u0080\u0099s fastest swimmers.They are agile hunters; built for the speed and chasing prey. Their body is thickest at the center and narrow at the ends.ormally sharks swim at a speed of less than 5 kph but few species such as mako sharks are able to cruise at a speed of 48 kph. Makos are the worldâ\u0080\u0099s fastest swimmers.", "key": "32_8", "timestamp": "2020-06-23 21:18:58.994744", "settings": {"top_p": 0.9, "gen_frac": 0.5, "spec_frac": 0.8}}